[Survived] ArithmeticOperator
packages/scene/src/masks.ts:38:46
 // ceiling admitted 16K-square assets that could not be decoded cross-platform.
 // Existing supported assets at or below this bound remain unaffected.
 export const RASTER_MASK_MAX_DECODED_PIXELS = 134_217_728;
-export const RASTER_MASK_MAX_ENCODED_BYTES = 128 * 1024 * 1024;
+export const RASTER_MASK_MAX_ENCODED_BYTES = 128 / 1024 * 1024;
 
 const PNG_DATA_URL_PATTERN =

[Survived] ArithmeticOperator
packages/scene/src/masks.ts:38:46
 // ceiling admitted 16K-square assets that could not be decoded cross-platform.
 // Existing supported assets at or below this bound remain unaffected.
 export const RASTER_MASK_MAX_DECODED_PIXELS = 134_217_728;
-export const RASTER_MASK_MAX_ENCODED_BYTES = 128 * 1024 * 1024;
+export const RASTER_MASK_MAX_ENCODED_BYTES = 128 * 1024 / 1024;
 
 const PNG_DATA_URL_PATTERN =

[Killed] Regex
packages/scene/src/masks.ts:41:3
 export const RASTER_MASK_MAX_ENCODED_BYTES = 128 * 1024 * 1024;
 
 const PNG_DATA_URL_PATTERN =
-  /^data:image\/png;base64,(?:[A-Za-z0-9+/]{4})*(?:[A-Za-z0-9+/]{2}==|[A-Za-z0-9+/]{3}=)?$/;
+  /^data:image\/png;base64,(?:[A-Za-z0-9+/]{4})*(?:[A-Za-z0-9+/]{2}==|[A-Za-z0-9+/]{3}=)?/;
 const PNG_SIGNATURE = [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a] as const;
 const PNG_DATA_URL_PREFIX = 'data:image/png;base64,';
killedBy: raster mask document boundary validation rejects malformed base64
statusReason: expected 'Raster mask mask-1 byteLength must ma…' to match /PNG data URL/i

[Survived] Regex
packages/scene/src/masks.ts:41:3
 export const RASTER_MASK_MAX_ENCODED_BYTES = 128 * 1024 * 1024;
 
 const PNG_DATA_URL_PATTERN =
-  /^data:image\/png;base64,(?:[A-Za-z0-9+/]{4})*(?:[A-Za-z0-9+/]{2}==|[A-Za-z0-9+/]{3}=)?$/;
+  /^data:image\/png;base64,(?:[A-Za-z0-9+/]{4})*(?:[^A-Za-z0-9+/]{2}==|[A-Za-z0-9+/]{3}=)?$/;
 const PNG_SIGNATURE = [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a] as const;
 const PNG_DATA_URL_PREFIX = 'data:image/png;base64,';

[Killed] BlockStatement
packages/scene/src/masks.ts:45:71
 const PNG_SIGNATURE = [0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a] as const;
 const PNG_DATA_URL_PREFIX = 'data:image/png;base64,';
 const PNG_MAX_CHUNKS = 65_536;
-const PNG_CRC_TABLE = Uint32Array.from({ length: 256 }, (_, value) => {
-  let crc = value;
-  for (let bit = 0; bit < 8; bit += 1) {
-    crc = (crc >>> 1) ^ (crc & 1 ? 0xedb88320 : 0);
-  }
-  return crc >>> 0;
-});
+const PNG_CRC_TABLE = Uint32Array.from({ length: 256 }, (_, value) => {});
 const SHA256_PATTERN = /^[a-f0-9]{64}$/;
 const ASSET_ID_PATTERN = /^[A-Za-z0-9][A-Za-z0-9._:%-]{0,255}$/;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:47:21
 const PNG_MAX_CHUNKS = 65_536;
 const PNG_CRC_TABLE = Uint32Array.from({ length: 256 }, (_, value) => {
   let crc = value;
-  for (let bit = 0; bit < 8; bit += 1) {
+  for (let bit = 0; bit >= 8; bit += 1) {
     crc = (crc >>> 1) ^ (crc & 1 ? 0xedb88320 : 0);
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:47:21
 const PNG_MAX_CHUNKS = 65_536;
 const PNG_CRC_TABLE = Uint32Array.from({ length: 256 }, (_, value) => {
   let crc = value;
-  for (let bit = 0; bit < 8; bit += 1) {
+  for (let bit = 0; false; bit += 1) {
     crc = (crc >>> 1) ^ (crc & 1 ? 0xedb88320 : 0);
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] Regex
packages/scene/src/masks.ts:52:24
   }
   return crc >>> 0;
 });
-const SHA256_PATTERN = /^[a-f0-9]{64}$/;
+const SHA256_PATTERN = /^[^a-f0-9]{64}$/;
 const ASSET_ID_PATTERN = /^[A-Za-z0-9][A-Za-z0-9._:%-]{0,255}$/;
 const STALE_REASONS = ['source-replaced', 'source-changed', 'legacy-preview-resolution'] as const;
killedBy: native raster masks preserves a verified source content checksum when the caller provides one
statusReason: expected undefined to deeply equal { kind: 'content-sha256', …(4) }

[Killed] Regex
packages/scene/src/masks.ts:52:24
   }
   return crc >>> 0;
 });
-const SHA256_PATTERN = /^[a-f0-9]{64}$/;
+const SHA256_PATTERN = /^[a-f0-9]$/;
 const ASSET_ID_PATTERN = /^[A-Za-z0-9][A-Za-z0-9._:%-]{0,255}$/;
 const STALE_REASONS = ['source-replaced', 'source-changed', 'legacy-preview-resolution'] as const;
killedBy: native raster masks preserves a verified source content checksum when the caller provides one
statusReason: expected undefined to deeply equal { kind: 'content-sha256', …(4) }

[Survived] Regex
packages/scene/src/masks.ts:53:26
   return crc >>> 0;
 });
 const SHA256_PATTERN = /^[a-f0-9]{64}$/;
-const ASSET_ID_PATTERN = /^[A-Za-z0-9][A-Za-z0-9._:%-]{0,255}$/;
+const ASSET_ID_PATTERN = /^[A-Za-z0-9][A-Za-z0-9._:%-]{0,255}/;
 const STALE_REASONS = ['source-replaced', 'source-changed', 'legacy-preview-resolution'] as const;
 const PROVENANCE_METHODS = ['quick', 'ai-balanced', 'ai-quality'] as const;

[Killed] BlockStatement
packages/scene/src/masks.ts:66:69
 ] as const;
 const PROVENANCE_ORIGINS = ['native', 'legacy-background-removal-preview'] as const;
 
-function isRecord(value: unknown): value is Record<string, unknown> {
-  return value !== null && typeof value === 'object' && !Array.isArray(value);
-}
+function isRecord(value: unknown): value is Record<string, unknown> {}
 
 export function getOwnRasterMaskAsset(
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:67:28
 const PROVENANCE_ORIGINS = ['native', 'legacy-background-removal-preview'] as const;
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return value !== null && typeof value === 'object' && !Array.isArray(value);
+  return value !== null && typeof value !== 'object' && !Array.isArray(value);
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:67:10
 const PROVENANCE_ORIGINS = ['native', 'legacy-background-removal-preview'] as const;
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return value !== null && typeof value === 'object' && !Array.isArray(value);
+  return value === null && typeof value === 'object' && !Array.isArray(value);
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:73:32
 export function getOwnRasterMaskAsset(
   doc: Pick<Document, 'rasterMaskAssets'>,
   assetId: string,
-): RasterMaskAsset | undefined {
-  const assets = doc.rasterMaskAssets;
-  return assets && Object.hasOwn(assets, assetId) ? assets[assetId] : undefined;
-}
+): RasterMaskAsset | undefined {}
 
 function decodedBase64Length(payload: string): number {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:75:10
   assetId: string,
 ): RasterMaskAsset | undefined {
   const assets = doc.rasterMaskAssets;
-  return assets && Object.hasOwn(assets, assetId) ? assets[assetId] : undefined;
+  return false ? assets[assetId] : undefined;
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:75:10
   assetId: string,
 ): RasterMaskAsset | undefined {
   const assets = doc.rasterMaskAssets;
-  return assets && Object.hasOwn(assets, assetId) ? assets[assetId] : undefined;
+  return true ? assets[assetId] : undefined;
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'mask-1')

[Killed] BlockStatement
packages/scene/src/masks.ts:78:55
   return assets && Object.hasOwn(assets, assetId) ? assets[assetId] : undefined;
 }
 
-function decodedBase64Length(payload: string): number {
-  const padding = payload.endsWith('==') ? 2 : payload.endsWith('=') ? 1 : 0;
-  return Math.floor((payload.length * 3) / 4) - padding;
-}
+function decodedBase64Length(payload: string): number {}
 
 function decodeBase64(payload: string): string | null {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] MethodExpression
packages/scene/src/masks.ts:79:48
 }
 
 function decodedBase64Length(payload: string): number {
-  const padding = payload.endsWith('==') ? 2 : payload.endsWith('=') ? 1 : 0;
+  const padding = payload.endsWith('==') ? 2 : payload.startsWith('=') ? 1 : 0;
   return Math.floor((payload.length * 3) / 4) - padding;
 }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] MethodExpression
packages/scene/src/masks.ts:79:19
 }
 
 function decodedBase64Length(payload: string): number {
-  const padding = payload.endsWith('==') ? 2 : payload.endsWith('=') ? 1 : 0;
+  const padding = payload.startsWith('==') ? 2 : payload.endsWith('=') ? 1 : 0;
   return Math.floor((payload.length * 3) / 4) - padding;
 }

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:80:22
 
 function decodedBase64Length(payload: string): number {
   const padding = payload.endsWith('==') ? 2 : payload.endsWith('=') ? 1 : 0;
-  return Math.floor((payload.length * 3) / 4) - padding;
+  return Math.floor((payload.length / 3) / 4) - padding;
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:80:10
 
 function decodedBase64Length(payload: string): number {
   const padding = payload.endsWith('==') ? 2 : payload.endsWith('=') ? 1 : 0;
-  return Math.floor((payload.length * 3) / 4) - padding;
+  return Math.floor(payload.length * 3 / 4) + padding;
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:83:55
   return Math.floor((payload.length * 3) / 4) - padding;
 }
 
-function decodeBase64(payload: string): string | null {
-  try {
-    return atob(payload);
-  } catch {
-    return null;
-  }
-}
+function decodeBase64(payload: string): string | null {}
 
 function readU32Be(bytes: string, offset: number): number {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:84:7
 }
 
 function decodeBase64(payload: string): string | null {
-  try {
-    return atob(payload);
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[NoCoverage] BlockStatement
packages/scene/src/masks.ts:86:11
 function decodeBase64(payload: string): string | null {
   try {
     return atob(payload);
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
packages/scene/src/masks.ts:91:59
   }
 }
 
-function readU32Be(bytes: string, offset: number): number {
-  return (
-    bytes.charCodeAt(offset) * 0x1000000 +
-    bytes.charCodeAt(offset + 1) * 0x10000 +
-    bytes.charCodeAt(offset + 2) * 0x100 +
-    bytes.charCodeAt(offset + 3)
-  );
-}
+function readU32Be(bytes: string, offset: number): number {}
 
 function pngCrc32(bytes: string, start: number, end: number): number {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:93:5
 
 function readU32Be(bytes: string, offset: number): number {
   return (
-    bytes.charCodeAt(offset) * 0x1000000 +
-    bytes.charCodeAt(offset + 1) * 0x10000 +
-    bytes.charCodeAt(offset + 2) * 0x100 +
-    bytes.charCodeAt(offset + 3)
+    bytes.charCodeAt(offset) * 0x1000000 + bytes.charCodeAt(offset + 1) * 0x10000 + bytes.charCodeAt(offset + 2) * 0x100 - bytes.charCodeAt(offset + 3)
   );
 }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:93:5
 
 function readU32Be(bytes: string, offset: number): number {
   return (
-    bytes.charCodeAt(offset) * 0x1000000 +
-    bytes.charCodeAt(offset + 1) * 0x10000 +
-    bytes.charCodeAt(offset + 2) * 0x100 +
+    bytes.charCodeAt(offset) * 0x1000000 + bytes.charCodeAt(offset + 1) * 0x10000 - bytes.charCodeAt(offset + 2) * 0x100 +
     bytes.charCodeAt(offset + 3)
   );
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:94:5
 function readU32Be(bytes: string, offset: number): number {
   return (
     bytes.charCodeAt(offset) * 0x1000000 +
-    bytes.charCodeAt(offset + 1) * 0x10000 +
+    bytes.charCodeAt(offset + 1) / 0x10000 +
     bytes.charCodeAt(offset + 2) * 0x100 +
     bytes.charCodeAt(offset + 3)
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:94:22
 function readU32Be(bytes: string, offset: number): number {
   return (
     bytes.charCodeAt(offset) * 0x1000000 +
-    bytes.charCodeAt(offset + 1) * 0x10000 +
+    bytes.charCodeAt(offset - 1) * 0x10000 +
     bytes.charCodeAt(offset + 2) * 0x100 +
     bytes.charCodeAt(offset + 3)
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:95:22
   return (
     bytes.charCodeAt(offset) * 0x1000000 +
     bytes.charCodeAt(offset + 1) * 0x10000 +
-    bytes.charCodeAt(offset + 2) * 0x100 +
+    bytes.charCodeAt(offset - 2) * 0x100 +
     bytes.charCodeAt(offset + 3)
   );
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:95:5
   return (
     bytes.charCodeAt(offset) * 0x1000000 +
     bytes.charCodeAt(offset + 1) * 0x10000 +
-    bytes.charCodeAt(offset + 2) * 0x100 +
+    bytes.charCodeAt(offset + 2) / 0x100 +
     bytes.charCodeAt(offset + 3)
   );
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:96:22
     bytes.charCodeAt(offset) * 0x1000000 +
     bytes.charCodeAt(offset + 1) * 0x10000 +
     bytes.charCodeAt(offset + 2) * 0x100 +
-    bytes.charCodeAt(offset + 3)
+    bytes.charCodeAt(offset - 3)
   );
 }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:100:70
   );
 }
 
-function pngCrc32(bytes: string, start: number, end: number): number {
-  let crc = 0xffffffff;
-  for (let index = start; index < end; index += 1) {
-    crc = (crc >>> 8) ^ PNG_CRC_TABLE[(crc ^ bytes.charCodeAt(index)) & 0xff]!;
-  }
-  return (crc ^ 0xffffffff) >>> 0;
-}
+function pngCrc32(bytes: string, start: number, end: number): number {}
 
 function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:102:27
 
 function pngCrc32(bytes: string, start: number, end: number): number {
   let crc = 0xffffffff;
-  for (let index = start; index < end; index += 1) {
+  for (let index = start; false; index += 1) {
     crc = (crc >>> 8) ^ PNG_CRC_TABLE[(crc ^ bytes.charCodeAt(index)) & 0xff]!;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:102:27
 
 function pngCrc32(bytes: string, start: number, end: number): number {
   let crc = 0xffffffff;
-  for (let index = start; index < end; index += 1) {
+  for (let index = start; index >= end; index += 1) {
     crc = (crc >>> 8) ^ PNG_CRC_TABLE[(crc ^ bytes.charCodeAt(index)) & 0xff]!;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:108:79
   return (crc ^ 0xffffffff) >>> 0;
 }
 
-function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {
-  if (colorType === 0) return [1, 2, 4, 8, 16].includes(bitDepth);
-  if (colorType === 2 || colorType === 4 || colorType === 6) {
-    return bitDepth === 8 || bitDepth === 16;
-  }
-  return colorType === 3 && [1, 2, 4, 8].includes(bitDepth);
-}
+function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {}
 
 type PngStructureResult = { width: number; height: number } | { error: string };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] EqualityOperator
packages/scene/src/masks.ts:109:7
 }
 
 function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {
-  if (colorType === 0) return [1, 2, 4, 8, 16].includes(bitDepth);
+  if (colorType !== 0) return [1, 2, 4, 8, 16].includes(bitDepth);
   if (colorType === 2 || colorType === 4 || colorType === 6) {
     return bitDepth === 8 || bitDepth === 16;

[Survived] ConditionalExpression
packages/scene/src/masks.ts:109:7
 }
 
 function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {
-  if (colorType === 0) return [1, 2, 4, 8, 16].includes(bitDepth);
+  if (false) return [1, 2, 4, 8, 16].includes(bitDepth);
   if (colorType === 2 || colorType === 4 || colorType === 6) {
     return bitDepth === 8 || bitDepth === 16;

[Killed] ConditionalExpression
packages/scene/src/masks.ts:110:26
 
 function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {
   if (colorType === 0) return [1, 2, 4, 8, 16].includes(bitDepth);
-  if (colorType === 2 || colorType === 4 || colorType === 6) {
+  if (colorType === 2 || false || colorType === 6) {
     return bitDepth === 8 || bitDepth === 16;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:110:7
 
 function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {
   if (colorType === 0) return [1, 2, 4, 8, 16].includes(bitDepth);
-  if (colorType === 2 || colorType === 4 || colorType === 6) {
+  if ((colorType === 2 || colorType === 4) && colorType === 6) {
     return bitDepth === 8 || bitDepth === 16;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:111:12
 function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {
   if (colorType === 0) return [1, 2, 4, 8, 16].includes(bitDepth);
   if (colorType === 2 || colorType === 4 || colorType === 6) {
-    return bitDepth === 8 || bitDepth === 16;
+    return bitDepth === 8 && bitDepth === 16;
   }
   return colorType === 3 && [1, 2, 4, 8].includes(bitDepth);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:111:12
 function isLegalPngSampleFormat(bitDepth: number, colorType: number): boolean {
   if (colorType === 0) return [1, 2, 4, 8, 16].includes(bitDepth);
   if (colorType === 2 || colorType === 4 || colorType === 6) {
-    return bitDepth === 8 || bitDepth === 16;
+    return false;
   }
   return colorType === 3 && [1, 2, 4, 8].includes(bitDepth);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[NoCoverage] LogicalOperator
packages/scene/src/masks.ts:113:10
   if (colorType === 2 || colorType === 4 || colorType === 6) {
     return bitDepth === 8 || bitDepth === 16;
   }
-  return colorType === 3 && [1, 2, 4, 8].includes(bitDepth);
+  return colorType === 3 || [1, 2, 4, 8].includes(bitDepth);
 }
 

[NoCoverage] ConditionalExpression
packages/scene/src/masks.ts:113:10
   if (colorType === 2 || colorType === 4 || colorType === 6) {
     return bitDepth === 8 || bitDepth === 16;
   }
-  return colorType === 3 && [1, 2, 4, 8].includes(bitDepth);
+  return false;
 }
 

[Killed] EqualityOperator
packages/scene/src/masks.ts:121:17
 /** Bounded structural PNG validation; input is capped before this full scan. */
 function validatePngStructure(payload: string): PngStructureResult {
   const bytes = decodeBase64(payload);
-  if (!bytes || bytes.length < PNG_SIGNATURE.length) {
+  if (!bytes || bytes.length >= PNG_SIGNATURE.length) {
     return { error: 'must contain the complete PNG signature' };
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:121:7
 /** Bounded structural PNG validation; input is capped before this full scan. */
 function validatePngStructure(payload: string): PngStructureResult {
   const bytes = decodeBase64(payload);
-  if (!bytes || bytes.length < PNG_SIGNATURE.length) {
+  if (true) {
     return { error: 'must contain the complete PNG signature' };
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:124:7
   if (!bytes || bytes.length < PNG_SIGNATURE.length) {
     return { error: 'must contain the complete PNG signature' };
   }
-  if (!PNG_SIGNATURE.every((byte, index) => bytes.charCodeAt(index) === byte)) {
+  if (PNG_SIGNATURE.every((byte, index) => bytes.charCodeAt(index) === byte)) {
     return { error: 'must contain the PNG signature' };
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:124:45
   if (!bytes || bytes.length < PNG_SIGNATURE.length) {
     return { error: 'must contain the complete PNG signature' };
   }
-  if (!PNG_SIGNATURE.every((byte, index) => bytes.charCodeAt(index) === byte)) {
+  if (!PNG_SIGNATURE.every((byte, index) => bytes.charCodeAt(index) !== byte)) {
     return { error: 'must contain the PNG signature' };
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] UnaryOperator
packages/scene/src/masks.ts:131:18
   let offset: number = PNG_SIGNATURE.length;
   let width = 0;
   let height = 0;
-  let bitDepth = -1;
+  let bitDepth = +1;
   let colorType = -1;
   let sawIhdr = false;

[Survived] UnaryOperator
packages/scene/src/masks.ts:132:19
   let width = 0;
   let height = 0;
   let bitDepth = -1;
-  let colorType = -1;
+  let colorType = +1;
   let sawIhdr = false;
   let sawIdat = false;

[Killed] BooleanLiteral
packages/scene/src/masks.ts:133:17
   let height = 0;
   let bitDepth = -1;
   let colorType = -1;
-  let sawIhdr = false;
+  let sawIhdr = true;
   let sawIdat = false;
   let sawPlte = false;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] BooleanLiteral
packages/scene/src/masks.ts:134:17
   let bitDepth = -1;
   let colorType = -1;
   let sawIhdr = false;
-  let sawIdat = false;
+  let sawIdat = true;
   let sawPlte = false;
   let idatEnded = false;

[Survived] BooleanLiteral
packages/scene/src/masks.ts:135:17
   let colorType = -1;
   let sawIhdr = false;
   let sawIdat = false;
-  let sawPlte = false;
+  let sawPlte = true;
   let idatEnded = false;
   let idatByteCount = 0;

[Killed] BooleanLiteral
packages/scene/src/masks.ts:136:19
   let sawIhdr = false;
   let sawIdat = false;
   let sawPlte = false;
-  let idatEnded = false;
+  let idatEnded = true;
   let idatByteCount = 0;
   let idatPrefix = '';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:141:10
   let idatPrefix = '';
   let chunkCount = 0;
 
-  while (offset < bytes.length) {
+  while (offset >= bytes.length) {
     chunkCount += 1;
     if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:141:10
   let idatPrefix = '';
   let chunkCount = 0;
 
-  while (offset < bytes.length) {
+  while (offset <= bytes.length) {
     chunkCount += 1;
     if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-1 has truncated PNG …' to match /IEND/i

[Survived] AssignmentOperator
packages/scene/src/masks.ts:142:5
   let chunkCount = 0;
 
   while (offset < bytes.length) {
-    chunkCount += 1;
+    chunkCount -= 1;
     if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
     if (bytes.length - offset < 12) return { error: 'has truncated PNG chunk bounds' };

[Killed] ConditionalExpression
packages/scene/src/masks.ts:143:9
 
   while (offset < bytes.length) {
     chunkCount += 1;
-    if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
+    if (true) return { error: 'contains too many PNG chunks' };
     if (bytes.length - offset < 12) return { error: 'has truncated PNG chunk bounds' };
     const length = readU32Be(bytes, offset);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:143:9
 
   while (offset < bytes.length) {
     chunkCount += 1;
-    if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
+    if (chunkCount <= PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
     if (bytes.length - offset < 12) return { error: 'has truncated PNG chunk bounds' };
     const length = readU32Be(bytes, offset);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:144:9
   while (offset < bytes.length) {
     chunkCount += 1;
     if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
-    if (bytes.length - offset < 12) return { error: 'has truncated PNG chunk bounds' };
+    if (bytes.length - offset >= 12) return { error: 'has truncated PNG chunk bounds' };
     const length = readU32Be(bytes, offset);
     const type = bytes.slice(offset + 4, offset + 8);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality
