[Killed] EqualityOperator
packages/scene/src/masks.ts:144:9
   while (offset < bytes.length) {
     chunkCount += 1;
     if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
-    if (bytes.length - offset < 12) return { error: 'has truncated PNG chunk bounds' };
+    if (bytes.length - offset <= 12) return { error: 'has truncated PNG chunk bounds' };
     const length = readU32Be(bytes, offset);
     const type = bytes.slice(offset + 4, offset + 8);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] MethodExpression
packages/scene/src/masks.ts:146:18
     if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
     if (bytes.length - offset < 12) return { error: 'has truncated PNG chunk bounds' };
     const length = readU32Be(bytes, offset);
-    const type = bytes.slice(offset + 4, offset + 8);
+    const type = bytes;
     const dataStart = offset + 8;
     const dataEnd = dataStart + length;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:146:42
     if (chunkCount > PNG_MAX_CHUNKS) return { error: 'contains too many PNG chunks' };
     if (bytes.length - offset < 12) return { error: 'has truncated PNG chunk bounds' };
     const length = readU32Be(bytes, offset);
-    const type = bytes.slice(offset + 4, offset + 8);
+    const type = bytes.slice(offset + 4, offset - 8);
     const dataStart = offset + 8;
     const dataEnd = dataStart + length;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:147:23
     if (bytes.length - offset < 12) return { error: 'has truncated PNG chunk bounds' };
     const length = readU32Be(bytes, offset);
     const type = bytes.slice(offset + 4, offset + 8);
-    const dataStart = offset + 8;
+    const dataStart = offset - 8;
     const dataEnd = dataStart + length;
     const chunkEnd = dataEnd + 4;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:148:21
     const length = readU32Be(bytes, offset);
     const type = bytes.slice(offset + 4, offset + 8);
     const dataStart = offset + 8;
-    const dataEnd = dataStart + length;
+    const dataEnd = dataStart - length;
     const chunkEnd = dataEnd + 4;
     if (dataEnd < dataStart || chunkEnd > bytes.length) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:149:22
     const type = bytes.slice(offset + 4, offset + 8);
     const dataStart = offset + 8;
     const dataEnd = dataStart + length;
-    const chunkEnd = dataEnd + 4;
+    const chunkEnd = dataEnd - 4;
     if (dataEnd < dataStart || chunkEnd > bytes.length) {
       return { error: 'has truncated PNG chunk bounds' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:150:9
     const dataStart = offset + 8;
     const dataEnd = dataStart + length;
     const chunkEnd = dataEnd + 4;
-    if (dataEnd < dataStart || chunkEnd > bytes.length) {
+    if (dataEnd >= dataStart || chunkEnd > bytes.length) {
       return { error: 'has truncated PNG chunk bounds' };
     }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:150:9
     const dataStart = offset + 8;
     const dataEnd = dataStart + length;
     const chunkEnd = dataEnd + 4;
-    if (dataEnd < dataStart || chunkEnd > bytes.length) {
+    if (false) {
       return { error: 'has truncated PNG chunk bounds' };
     }
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-0 has an invalid IHD…' to match /IHDR.*(truncated|complete)|chunk bou…/i

[Killed] StringLiteral
packages/scene/src/masks.ts:151:23
     const dataEnd = dataStart + length;
     const chunkEnd = dataEnd + 4;
     if (dataEnd < dataStart || chunkEnd > bytes.length) {
-      return { error: 'has truncated PNG chunk bounds' };
+      return { error: "" };
     }
     if (!/^[A-Za-z]{4}$/.test(type)) return { error: 'has an invalid PNG chunk type' };
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-0 ' to match /IHDR.*(truncated|complete)|chunk bou…/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:153:9
     if (dataEnd < dataStart || chunkEnd > bytes.length) {
       return { error: 'has truncated PNG chunk bounds' };
     }
-    if (!/^[A-Za-z]{4}$/.test(type)) return { error: 'has an invalid PNG chunk type' };
+    if (true) return { error: 'has an invalid PNG chunk type' };
     if (readU32Be(bytes, dataEnd) !== pngCrc32(bytes, offset + 4, dataEnd)) {
       return { error: `has an invalid ${type} CRC` };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:153:9
     if (dataEnd < dataStart || chunkEnd > bytes.length) {
       return { error: 'has truncated PNG chunk bounds' };
     }
-    if (!/^[A-Za-z]{4}$/.test(type)) return { error: 'has an invalid PNG chunk type' };
+    if (/^[A-Za-z]{4}$/.test(type)) return { error: 'has an invalid PNG chunk type' };
     if (readU32Be(bytes, dataEnd) !== pngCrc32(bytes, offset + 4, dataEnd)) {
       return { error: `has an invalid ${type} CRC` };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:154:9
       return { error: 'has truncated PNG chunk bounds' };
     }
     if (!/^[A-Za-z]{4}$/.test(type)) return { error: 'has an invalid PNG chunk type' };
-    if (readU32Be(bytes, dataEnd) !== pngCrc32(bytes, offset + 4, dataEnd)) {
+    if (true) {
       return { error: `has an invalid ${type} CRC` };
     }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:154:55
       return { error: 'has truncated PNG chunk bounds' };
     }
     if (!/^[A-Za-z]{4}$/.test(type)) return { error: 'has an invalid PNG chunk type' };
-    if (readU32Be(bytes, dataEnd) !== pngCrc32(bytes, offset + 4, dataEnd)) {
+    if (readU32Be(bytes, dataEnd) !== pngCrc32(bytes, offset - 4, dataEnd)) {
       return { error: `has an invalid ${type} CRC` };
     }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:155:23
     }
     if (!/^[A-Za-z]{4}$/.test(type)) return { error: 'has an invalid PNG chunk type' };
     if (readU32Be(bytes, dataEnd) !== pngCrc32(bytes, offset + 4, dataEnd)) {
-      return { error: `has an invalid ${type} CRC` };
+      return { error: `` };
     }
 
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-2 ' to match /CRC/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:158:9
       return { error: `has an invalid ${type} CRC` };
     }
 
-    if (!sawIhdr) {
+    if (true) {
       if (type !== 'IHDR' || length !== 13) {
         return { error: 'must contain a complete 13-byte first IHDR chunk' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:158:9
       return { error: `has an invalid ${type} CRC` };
     }
 
-    if (!sawIhdr) {
+    if (false) {
       if (type !== 'IHDR' || length !== 13) {
         return { error: 'must contain a complete 13-byte first IHDR chunk' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:159:30
     }
 
     if (!sawIhdr) {
-      if (type !== 'IHDR' || length !== 13) {
+      if (type !== 'IHDR' || length === 13) {
         return { error: 'must contain a complete 13-byte first IHDR chunk' };
       }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:159:11
     }
 
     if (!sawIhdr) {
-      if (type !== 'IHDR' || length !== 13) {
+      if (true) {
         return { error: 'must contain a complete 13-byte first IHDR chunk' };
       }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:163:33
         return { error: 'must contain a complete 13-byte first IHDR chunk' };
       }
       width = readU32Be(bytes, dataStart);
-      height = readU32Be(bytes, dataStart + 4);
+      height = readU32Be(bytes, dataStart - 4);
       bitDepth = bytes.charCodeAt(dataStart + 8);
       colorType = bytes.charCodeAt(dataStart + 9);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:164:35
       }
       width = readU32Be(bytes, dataStart);
       height = readU32Be(bytes, dataStart + 4);
-      bitDepth = bytes.charCodeAt(dataStart + 8);
+      bitDepth = bytes.charCodeAt(dataStart - 8);
       colorType = bytes.charCodeAt(dataStart + 9);
       const compression = bytes.charCodeAt(dataStart + 10);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:165:36
       width = readU32Be(bytes, dataStart);
       height = readU32Be(bytes, dataStart + 4);
       bitDepth = bytes.charCodeAt(dataStart + 8);
-      colorType = bytes.charCodeAt(dataStart + 9);
+      colorType = bytes.charCodeAt(dataStart - 9);
       const compression = bytes.charCodeAt(dataStart + 10);
       const filter = bytes.charCodeAt(dataStart + 11);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:166:44
       height = readU32Be(bytes, dataStart + 4);
       bitDepth = bytes.charCodeAt(dataStart + 8);
       colorType = bytes.charCodeAt(dataStart + 9);
-      const compression = bytes.charCodeAt(dataStart + 10);
+      const compression = bytes.charCodeAt(dataStart - 10);
       const filter = bytes.charCodeAt(dataStart + 11);
       const interlace = bytes.charCodeAt(dataStart + 12);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:167:39
       bitDepth = bytes.charCodeAt(dataStart + 8);
       colorType = bytes.charCodeAt(dataStart + 9);
       const compression = bytes.charCodeAt(dataStart + 10);
-      const filter = bytes.charCodeAt(dataStart + 11);
+      const filter = bytes.charCodeAt(dataStart - 11);
       const interlace = bytes.charCodeAt(dataStart + 12);
       if (
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:168:42
       colorType = bytes.charCodeAt(dataStart + 9);
       const compression = bytes.charCodeAt(dataStart + 10);
       const filter = bytes.charCodeAt(dataStart + 11);
-      const interlace = bytes.charCodeAt(dataStart + 12);
+      const interlace = bytes.charCodeAt(dataStart - 12);
       if (
         width === 0 ||
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:170:9
       const filter = bytes.charCodeAt(dataStart + 11);
       const interlace = bytes.charCodeAt(dataStart + 12);
       if (
-        width === 0 ||
-        height === 0 ||
-        !isLegalPngSampleFormat(bitDepth, colorType) ||
-        compression !== 0 ||
+        (width === 0 || height === 0 || !isLegalPngSampleFormat(bitDepth, colorType)) && compression !== 0 ||
         filter !== 0 ||
         (interlace !== 0 && interlace !== 1)
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: .toMatch() expects to receive a string, but got object

[Killed] ConditionalExpression
packages/scene/src/masks.ts:170:9
       const filter = bytes.charCodeAt(dataStart + 11);
       const interlace = bytes.charCodeAt(dataStart + 12);
       if (
-        width === 0 ||
-        height === 0 ||
-        !isLegalPngSampleFormat(bitDepth, colorType) ||
-        compression !== 0 ||
-        filter !== 0 ||
-        (interlace !== 0 && interlace !== 1)
+        true
       ) {
         return { error: 'has invalid IHDR fields' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:171:9
       const interlace = bytes.charCodeAt(dataStart + 12);
       if (
         width === 0 ||
-        height === 0 ||
+        height !== 0 ||
         !isLegalPngSampleFormat(bitDepth, colorType) ||
         compression !== 0 ||
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:171:9
       const interlace = bytes.charCodeAt(dataStart + 12);
       if (
         width === 0 ||
-        height === 0 ||
+        false ||
         !isLegalPngSampleFormat(bitDepth, colorType) ||
         compression !== 0 ||

[Killed] BooleanLiteral
packages/scene/src/masks.ts:172:9
       if (
         width === 0 ||
         height === 0 ||
-        !isLegalPngSampleFormat(bitDepth, colorType) ||
+        isLegalPngSampleFormat(bitDepth, colorType) ||
         compression !== 0 ||
         filter !== 0 ||
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:173:9
         width === 0 ||
         height === 0 ||
         !isLegalPngSampleFormat(bitDepth, colorType) ||
-        compression !== 0 ||
+        false ||
         filter !== 0 ||
         (interlace !== 0 && interlace !== 1)
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: .toMatch() expects to receive a string, but got object

[Killed] EqualityOperator
packages/scene/src/masks.ts:173:9
         width === 0 ||
         height === 0 ||
         !isLegalPngSampleFormat(bitDepth, colorType) ||
-        compression !== 0 ||
+        compression === 0 ||
         filter !== 0 ||
         (interlace !== 0 && interlace !== 1)
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:174:9
         height === 0 ||
         !isLegalPngSampleFormat(bitDepth, colorType) ||
         compression !== 0 ||
-        filter !== 0 ||
+        filter === 0 ||
         (interlace !== 0 && interlace !== 1)
       ) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:174:9
         height === 0 ||
         !isLegalPngSampleFormat(bitDepth, colorType) ||
         compression !== 0 ||
-        filter !== 0 ||
+        false ||
         (interlace !== 0 && interlace !== 1)
       ) {

[Killed] LogicalOperator
packages/scene/src/masks.ts:175:10
         !isLegalPngSampleFormat(bitDepth, colorType) ||
         compression !== 0 ||
         filter !== 0 ||
-        (interlace !== 0 && interlace !== 1)
+        (interlace !== 0 || interlace !== 1)
       ) {
         return { error: 'has invalid IHDR fields' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:175:10
         !isLegalPngSampleFormat(bitDepth, colorType) ||
         compression !== 0 ||
         filter !== 0 ||
-        (interlace !== 0 && interlace !== 1)
+        (interlace === 0 && interlace !== 1)
       ) {
         return { error: 'has invalid IHDR fields' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:176:9
         compression !== 0 ||
         filter !== 0 ||
         (interlace !== 0 && interlace !== 1)
-      ) {
-        return { error: 'has invalid IHDR fields' };
-      }
+      ) {}
       sawIhdr = true;
     } else if (type === 'IHDR') {
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: .toMatch() expects to receive a string, but got object

[Killed] StringLiteral
packages/scene/src/masks.ts:177:25
         filter !== 0 ||
         (interlace !== 0 && interlace !== 1)
       ) {
-        return { error: 'has invalid IHDR fields' };
+        return { error: "" };
       }
       sawIhdr = true;
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-4 ' to match /IHDR fields/i

[Killed] ObjectLiteral
packages/scene/src/masks.ts:177:16
         filter !== 0 ||
         (interlace !== 0 && interlace !== 1)
       ) {
-        return { error: 'has invalid IHDR fields' };
+        return {};
       }
       sawIhdr = true;
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-4 declared dimension…' to match /IHDR fields/i

[Killed] BooleanLiteral
packages/scene/src/masks.ts:179:17
       ) {
         return { error: 'has invalid IHDR fields' };
       }
-      sawIhdr = true;
+      sawIhdr = false;
     } else if (type === 'IHDR') {
       return { error: 'contains multiple IHDR chunks' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:180:16
         return { error: 'has invalid IHDR fields' };
       }
       sawIhdr = true;
-    } else if (type === 'IHDR') {
+    } else if (type !== 'IHDR') {
       return { error: 'contains multiple IHDR chunks' };
     } else if (type === 'PLTE') {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:180:16
         return { error: 'has invalid IHDR fields' };
       }
       sawIhdr = true;
-    } else if (type === 'IHDR') {
+    } else if (true) {
       return { error: 'contains multiple IHDR chunks' };
     } else if (type === 'PLTE') {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:182:16
       sawIhdr = true;
     } else if (type === 'IHDR') {
       return { error: 'contains multiple IHDR chunks' };
-    } else if (type === 'PLTE') {
+    } else if (true) {
       const paletteEntries = length / 3;
       if (
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:182:16
       sawIhdr = true;
     } else if (type === 'IHDR') {
       return { error: 'contains multiple IHDR chunks' };
-    } else if (type === 'PLTE') {
+    } else if (type !== 'PLTE') {
       const paletteEntries = length / 3;
       if (
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[NoCoverage] ArithmeticOperator
packages/scene/src/masks.ts:183:30
     } else if (type === 'IHDR') {
       return { error: 'contains multiple IHDR chunks' };
     } else if (type === 'PLTE') {
-      const paletteEntries = length / 3;
+      const paletteEntries = length * 3;
       if (
         sawPlte ||

[NoCoverage] LogicalOperator
packages/scene/src/masks.ts:185:9
     } else if (type === 'PLTE') {
       const paletteEntries = length / 3;
       if (
-        sawPlte ||
-        sawIdat ||
+        sawPlte && sawIdat ||
         length === 0 ||
         length % 3 !== 0 ||

[NoCoverage] LogicalOperator
packages/scene/src/masks.ts:185:9
     } else if (type === 'PLTE') {
       const paletteEntries = length / 3;
       if (
-        sawPlte ||
-        sawIdat ||
-        length === 0 ||
-        length % 3 !== 0 ||
-        length > 768 ||
+        (sawPlte || sawIdat || length === 0 || length % 3 !== 0) && length > 768 ||
         colorType === 0 ||
         colorType === 4 ||

[NoCoverage] ConditionalExpression
packages/scene/src/masks.ts:187:9
       if (
         sawPlte ||
         sawIdat ||
-        length === 0 ||
+        false ||
         length % 3 !== 0 ||
         length > 768 ||

[NoCoverage] EqualityOperator
packages/scene/src/masks.ts:187:9
       if (
         sawPlte ||
         sawIdat ||
-        length === 0 ||
+        length !== 0 ||
         length % 3 !== 0 ||
         length > 768 ||

[NoCoverage] ArithmeticOperator
packages/scene/src/masks.ts:188:9
         sawPlte ||
         sawIdat ||
         length === 0 ||
-        length % 3 !== 0 ||
+        length * 3 !== 0 ||
         length > 768 ||
         colorType === 0 ||

[NoCoverage] EqualityOperator
packages/scene/src/masks.ts:188:9
         sawPlte ||
         sawIdat ||
         length === 0 ||
-        length % 3 !== 0 ||
+        length % 3 === 0 ||
         length > 768 ||
         colorType === 0 ||

[NoCoverage] EqualityOperator
packages/scene/src/masks.ts:189:9
         sawIdat ||
         length === 0 ||
         length % 3 !== 0 ||
-        length > 768 ||
+        length >= 768 ||
         colorType === 0 ||
         colorType === 4 ||

[NoCoverage] ConditionalExpression
packages/scene/src/masks.ts:189:9
         sawIdat ||
         length === 0 ||
         length % 3 !== 0 ||
-        length > 768 ||
+        false ||
         colorType === 0 ||
         colorType === 4 ||

[NoCoverage] ConditionalExpression
packages/scene/src/masks.ts:190:9
         length === 0 ||
         length % 3 !== 0 ||
         length > 768 ||
-        colorType === 0 ||
+        false ||
         colorType === 4 ||
         (colorType === 3 && paletteEntries > 2 ** bitDepth)

[NoCoverage] EqualityOperator
packages/scene/src/masks.ts:190:9
         length === 0 ||
         length % 3 !== 0 ||
         length > 768 ||
-        colorType === 0 ||
+        colorType !== 0 ||
         colorType === 4 ||
         (colorType === 3 && paletteEntries > 2 ** bitDepth)

[NoCoverage] EqualityOperator
packages/scene/src/masks.ts:191:9
         length % 3 !== 0 ||
         length > 768 ||
         colorType === 0 ||
-        colorType === 4 ||
+        colorType !== 4 ||
         (colorType === 3 && paletteEntries > 2 ** bitDepth)
       ) {

[NoCoverage] ConditionalExpression
packages/scene/src/masks.ts:191:9
         length % 3 !== 0 ||
         length > 768 ||
         colorType === 0 ||
-        colorType === 4 ||
+        false ||
         (colorType === 3 && paletteEntries > 2 ** bitDepth)
       ) {

[NoCoverage] EqualityOperator
packages/scene/src/masks.ts:192:29
         length > 768 ||
         colorType === 0 ||
         colorType === 4 ||
-        (colorType === 3 && paletteEntries > 2 ** bitDepth)
+        (colorType === 3 && paletteEntries <= 2 ** bitDepth)
       ) {
         return { error: 'has an invalid PLTE chunk' };

[NoCoverage] EqualityOperator
packages/scene/src/masks.ts:192:29
         length > 768 ||
         colorType === 0 ||
         colorType === 4 ||
-        (colorType === 3 && paletteEntries > 2 ** bitDepth)
+        (colorType === 3 && paletteEntries >= 2 ** bitDepth)
       ) {
         return { error: 'has an invalid PLTE chunk' };

[NoCoverage] BlockStatement
packages/scene/src/masks.ts:193:9
         colorType === 0 ||
         colorType === 4 ||
         (colorType === 3 && paletteEntries > 2 ** bitDepth)
-      ) {
-        return { error: 'has an invalid PLTE chunk' };
-      }
+      ) {}
       sawPlte = true;
     } else if (type === 'IDAT') {

[NoCoverage] ObjectLiteral
packages/scene/src/masks.ts:194:16
         colorType === 4 ||
         (colorType === 3 && paletteEntries > 2 ** bitDepth)
       ) {
-        return { error: 'has an invalid PLTE chunk' };
+        return {};
       }
       sawPlte = true;

[NoCoverage] BooleanLiteral
packages/scene/src/masks.ts:196:17
       ) {
         return { error: 'has an invalid PLTE chunk' };
       }
-      sawPlte = true;
+      sawPlte = false;
     } else if (type === 'IDAT') {
       if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };

[Killed] EqualityOperator
packages/scene/src/masks.ts:197:16
         return { error: 'has an invalid PLTE chunk' };
       }
       sawPlte = true;
-    } else if (type === 'IDAT') {
+    } else if (type !== 'IDAT') {
       if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };
       sawIdat = true;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:197:16
         return { error: 'has an invalid PLTE chunk' };
       }
       sawPlte = true;
-    } else if (type === 'IDAT') {
+    } else if (true) {
       if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };
       sawIdat = true;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:198:11
       }
       sawPlte = true;
     } else if (type === 'IDAT') {
-      if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };
+      if (true) return { error: 'has invalid IDAT structure' };
       sawIdat = true;
       idatByteCount += length;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:198:24
       }
       sawPlte = true;
     } else if (type === 'IDAT') {
-      if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };
+      if (idatEnded || length !== 0) return { error: 'has invalid IDAT structure' };
       sawIdat = true;
       idatByteCount += length;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:199:17
       sawPlte = true;
     } else if (type === 'IDAT') {
       if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };
-      sawIdat = true;
+      sawIdat = false;
       idatByteCount += length;
       if (idatPrefix.length < 2) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality
