[Killed] AssignmentOperator
packages/scene/src/masks.ts:200:7
     } else if (type === 'IDAT') {
       if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };
       sawIdat = true;
-      idatByteCount += length;
+      idatByteCount -= length;
       if (idatPrefix.length < 2) {
         idatPrefix += bytes.slice(dataStart, dataStart + Math.min(length, 2 - idatPrefix.length));
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:201:11
       if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };
       sawIdat = true;
       idatByteCount += length;
-      if (idatPrefix.length < 2) {
+      if (false) {
         idatPrefix += bytes.slice(dataStart, dataStart + Math.min(length, 2 - idatPrefix.length));
       }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:201:34
       if (idatEnded || length === 0) return { error: 'has invalid IDAT structure' };
       sawIdat = true;
       idatByteCount += length;
-      if (idatPrefix.length < 2) {
-        idatPrefix += bytes.slice(dataStart, dataStart + Math.min(length, 2 - idatPrefix.length));
-      }
+      if (idatPrefix.length < 2) {}
     } else if (type === 'IEND') {
       const cmf = idatPrefix.charCodeAt(0);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] MethodExpression
packages/scene/src/masks.ts:202:58
       sawIdat = true;
       idatByteCount += length;
       if (idatPrefix.length < 2) {
-        idatPrefix += bytes.slice(dataStart, dataStart + Math.min(length, 2 - idatPrefix.length));
+        idatPrefix += bytes.slice(dataStart, dataStart + Math.max(length, 2 - idatPrefix.length));
       }
     } else if (type === 'IEND') {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] MethodExpression
packages/scene/src/masks.ts:202:23
       sawIdat = true;
       idatByteCount += length;
       if (idatPrefix.length < 2) {
-        idatPrefix += bytes.slice(dataStart, dataStart + Math.min(length, 2 - idatPrefix.length));
+        idatPrefix += bytes;
       }
     } else if (type === 'IEND') {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:204:16
       if (idatPrefix.length < 2) {
         idatPrefix += bytes.slice(dataStart, dataStart + Math.min(length, 2 - idatPrefix.length));
       }
-    } else if (type === 'IEND') {
+    } else if (type !== 'IEND') {
       const cmf = idatPrefix.charCodeAt(0);
       const flg = idatPrefix.charCodeAt(1);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:204:16
       if (idatPrefix.length < 2) {
         idatPrefix += bytes.slice(dataStart, dataStart + Math.min(length, 2 - idatPrefix.length));
       }
-    } else if (type === 'IEND') {
+    } else if (false) {
       const cmf = idatPrefix.charCodeAt(0);
       const flg = idatPrefix.charCodeAt(1);
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:208:9
       const cmf = idatPrefix.charCodeAt(0);
       const flg = idatPrefix.charCodeAt(1);
       const validZlibHeader =
-        idatPrefix.length === 2 &&
+        idatPrefix.length !== 2 &&
         (cmf & 0x0f) === 8 &&
         cmf >>> 4 <= 7 &&
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:208:9
       const cmf = idatPrefix.charCodeAt(0);
       const flg = idatPrefix.charCodeAt(1);
       const validZlibHeader =
-        idatPrefix.length === 2 &&
-        (cmf & 0x0f) === 8 &&
-        cmf >>> 4 <= 7 &&
-        ((cmf << 8) + flg) % 31 === 0 &&
-        (flg & 0x20) === 0;
+        idatPrefix.length === 2 && (cmf & 0x0f) === 8 && cmf >>> 4 <= 7 && ((cmf << 8) + flg) % 31 === 0 || (flg & 0x20) === 0;
       if (
         length !== 0 ||
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: .toMatch() expects to receive a string, but got object

[Killed] EqualityOperator
packages/scene/src/masks.ts:209:9
       const flg = idatPrefix.charCodeAt(1);
       const validZlibHeader =
         idatPrefix.length === 2 &&
-        (cmf & 0x0f) === 8 &&
+        (cmf & 0x0f) !== 8 &&
         cmf >>> 4 <= 7 &&
         ((cmf << 8) + flg) % 31 === 0 &&
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:209:9
       const flg = idatPrefix.charCodeAt(1);
       const validZlibHeader =
         idatPrefix.length === 2 &&
-        (cmf & 0x0f) === 8 &&
+        true &&
         cmf >>> 4 <= 7 &&
         ((cmf << 8) + flg) % 31 === 0 &&

[Killed] EqualityOperator
packages/scene/src/masks.ts:210:9
       const validZlibHeader =
         idatPrefix.length === 2 &&
         (cmf & 0x0f) === 8 &&
-        cmf >>> 4 <= 7 &&
+        cmf >>> 4 > 7 &&
         ((cmf << 8) + flg) % 31 === 0 &&
         (flg & 0x20) === 0;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:210:9
       const validZlibHeader =
         idatPrefix.length === 2 &&
         (cmf & 0x0f) === 8 &&
-        cmf >>> 4 <= 7 &&
+        cmf >>> 4 < 7 &&
         ((cmf << 8) + flg) % 31 === 0 &&
         (flg & 0x20) === 0;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:211:9
         idatPrefix.length === 2 &&
         (cmf & 0x0f) === 8 &&
         cmf >>> 4 <= 7 &&
-        ((cmf << 8) + flg) % 31 === 0 &&
+        ((cmf << 8) + flg) * 31 === 0 &&
         (flg & 0x20) === 0;
       if (
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:211:10
         idatPrefix.length === 2 &&
         (cmf & 0x0f) === 8 &&
         cmf >>> 4 <= 7 &&
-        ((cmf << 8) + flg) % 31 === 0 &&
+        ((cmf << 8) - flg) % 31 === 0 &&
         (flg & 0x20) === 0;
       if (
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:212:9
         (cmf & 0x0f) === 8 &&
         cmf >>> 4 <= 7 &&
         ((cmf << 8) + flg) % 31 === 0 &&
-        (flg & 0x20) === 0;
+        (flg & 0x20) !== 0;
       if (
         length !== 0 ||
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:212:9
         (cmf & 0x0f) === 8 &&
         cmf >>> 4 <= 7 &&
         ((cmf << 8) + flg) % 31 === 0 &&
-        (flg & 0x20) === 0;
+        true;
       if (
         length !== 0 ||

[Killed] ConditionalExpression
packages/scene/src/masks.ts:214:9
         ((cmf << 8) + flg) % 31 === 0 &&
         (flg & 0x20) === 0;
       if (
-        length !== 0 ||
-        !sawIdat ||
-        idatByteCount < 6 ||
-        !validZlibHeader ||
-        (colorType === 3 && !sawPlte)
+        true
       ) {
         if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:214:9
         ((cmf << 8) + flg) % 31 === 0 &&
         (flg & 0x20) === 0;
       if (
-        length !== 0 ||
-        !sawIdat ||
-        idatByteCount < 6 ||
-        !validZlibHeader ||
-        (colorType === 3 && !sawPlte)
+        (length !== 0 || !sawIdat || idatByteCount < 6 || !validZlibHeader) && colorType === 3 && !sawPlte
       ) {
         if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: .toMatch() expects to receive a string, but got object

[Killed] BooleanLiteral
packages/scene/src/masks.ts:215:9
         (flg & 0x20) === 0;
       if (
         length !== 0 ||
-        !sawIdat ||
+        sawIdat ||
         idatByteCount < 6 ||
         !validZlibHeader ||
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:216:9
       if (
         length !== 0 ||
         !sawIdat ||
-        idatByteCount < 6 ||
+        idatByteCount >= 6 ||
         !validZlibHeader ||
         (colorType === 3 && !sawPlte)
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] EqualityOperator
packages/scene/src/masks.ts:216:9
       if (
         length !== 0 ||
         !sawIdat ||
-        idatByteCount < 6 ||
+        idatByteCount <= 6 ||
         !validZlibHeader ||
         (colorType === 3 && !sawPlte)

[Killed] BooleanLiteral
packages/scene/src/masks.ts:217:9
         length !== 0 ||
         !sawIdat ||
         idatByteCount < 6 ||
-        !validZlibHeader ||
+        validZlibHeader ||
         (colorType === 3 && !sawPlte)
       ) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:218:10
         !sawIdat ||
         idatByteCount < 6 ||
         !validZlibHeader ||
-        (colorType === 3 && !sawPlte)
+        (colorType === 3 || !sawPlte)
       ) {
         if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:218:10
         !sawIdat ||
         idatByteCount < 6 ||
         !validZlibHeader ||
-        (colorType === 3 && !sawPlte)
+        (colorType !== 3 && !sawPlte)
       ) {
         if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:219:9
         idatByteCount < 6 ||
         !validZlibHeader ||
         (colorType === 3 && !sawPlte)
-      ) {
-        if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
-        return { error: 'has invalid IDAT/IEND structure' };
-      }
+      ) {}
       if (chunkEnd !== bytes.length) return { error: 'must have a terminal IEND chunk' };
       return { width, height };
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: .toMatch() expects to receive a string, but got object

[Killed] BooleanLiteral
packages/scene/src/masks.ts:220:24
         !validZlibHeader ||
         (colorType === 3 && !sawPlte)
       ) {
-        if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
+        if (sawIdat && validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
         return { error: 'has invalid IDAT/IEND structure' };
       }
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-5 has invalid IDAT/I…' to match /IDAT.*zlib/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:220:13
         !validZlibHeader ||
         (colorType === 3 && !sawPlte)
       ) {
-        if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
+        if (false) return { error: 'has an invalid IDAT zlib header' };
         return { error: 'has invalid IDAT/IEND structure' };
       }
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-5 has invalid IDAT/I…' to match /IDAT.*zlib/i

[Killed] ObjectLiteral
packages/scene/src/masks.ts:221:16
         (colorType === 3 && !sawPlte)
       ) {
         if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
-        return { error: 'has invalid IDAT/IEND structure' };
+        return {};
       }
       if (chunkEnd !== bytes.length) return { error: 'must have a terminal IEND chunk' };
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-6 declared dimension…' to match /IDAT/i

[Killed] EqualityOperator
packages/scene/src/masks.ts:223:11
         if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
         return { error: 'has invalid IDAT/IEND structure' };
       }
-      if (chunkEnd !== bytes.length) return { error: 'must have a terminal IEND chunk' };
+      if (chunkEnd === bytes.length) return { error: 'must have a terminal IEND chunk' };
       return { width, height };
     } else {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:223:11
         if (sawIdat && !validZlibHeader) return { error: 'has an invalid IDAT zlib header' };
         return { error: 'has invalid IDAT/IEND structure' };
       }
-      if (chunkEnd !== bytes.length) return { error: 'must have a terminal IEND chunk' };
+      if (true) return { error: 'must have a terminal IEND chunk' };
       return { width, height };
     } else {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ObjectLiteral
packages/scene/src/masks.ts:224:14
         return { error: 'has invalid IDAT/IEND structure' };
       }
       if (chunkEnd !== bytes.length) return { error: 'must have a terminal IEND chunk' };
-      return { width, height };
+      return {};
     } else {
       if (sawIdat) idatEnded = true;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[NoCoverage] BlockStatement
packages/scene/src/masks.ts:225:12
       }
       if (chunkEnd !== bytes.length) return { error: 'must have a terminal IEND chunk' };
       return { width, height };
-    } else {
-      if (sawIdat) idatEnded = true;
-      if ((type.charCodeAt(0) & 0x20) === 0) {
-        return { error: `contains unsupported critical PNG chunk ${type}` };
-      }
-    }
+    } else {}
     offset = chunkEnd;
   }

[NoCoverage] BooleanLiteral
packages/scene/src/masks.ts:226:32
       if (chunkEnd !== bytes.length) return { error: 'must have a terminal IEND chunk' };
       return { width, height };
     } else {
-      if (sawIdat) idatEnded = true;
+      if (sawIdat) idatEnded = false;
       if ((type.charCodeAt(0) & 0x20) === 0) {
         return { error: `contains unsupported critical PNG chunk ${type}` };

[NoCoverage] ConditionalExpression
packages/scene/src/masks.ts:226:11
       if (chunkEnd !== bytes.length) return { error: 'must have a terminal IEND chunk' };
       return { width, height };
     } else {
-      if (sawIdat) idatEnded = true;
+      if (true) idatEnded = true;
       if ((type.charCodeAt(0) & 0x20) === 0) {
         return { error: `contains unsupported critical PNG chunk ${type}` };

[NoCoverage] BlockStatement
packages/scene/src/masks.ts:227:46
       return { width, height };
     } else {
       if (sawIdat) idatEnded = true;
-      if ((type.charCodeAt(0) & 0x20) === 0) {
-        return { error: `contains unsupported critical PNG chunk ${type}` };
-      }
+      if ((type.charCodeAt(0) & 0x20) === 0) {}
     }
     offset = chunkEnd;

[NoCoverage] ConditionalExpression
packages/scene/src/masks.ts:227:11
       return { width, height };
     } else {
       if (sawIdat) idatEnded = true;
-      if ((type.charCodeAt(0) & 0x20) === 0) {
+      if (false) {
         return { error: `contains unsupported critical PNG chunk ${type}` };
       }

[Killed] BooleanLiteral
packages/scene/src/masks.ts:234:7
     offset = chunkEnd;
   }
 
-  if (!sawIhdr) return { error: 'must contain a complete 13-byte first IHDR chunk' };
+  if (sawIhdr) return { error: 'must contain a complete 13-byte first IHDR chunk' };
   if (!sawIdat) return { error: 'must contain image data in an IDAT chunk' };
   return { error: 'must contain a terminal IEND chunk' };
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-1 must contain a com…' to match /IEND/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:234:7
     offset = chunkEnd;
   }
 
-  if (!sawIhdr) return { error: 'must contain a complete 13-byte first IHDR chunk' };
+  if (false) return { error: 'must contain a complete 13-byte first IHDR chunk' };
   if (!sawIdat) return { error: 'must contain image data in an IDAT chunk' };
   return { error: 'must contain a terminal IEND chunk' };
killedBy: raster mask document boundary validation rejects signature-only PNG
statusReason: expected 'Raster mask mask-1 must contain image…' to match /IHDR/i

[Killed] BooleanLiteral
packages/scene/src/masks.ts:235:7
   }
 
   if (!sawIhdr) return { error: 'must contain a complete 13-byte first IHDR chunk' };
-  if (!sawIdat) return { error: 'must contain image data in an IDAT chunk' };
+  if (sawIdat) return { error: 'must contain image data in an IDAT chunk' };
   return { error: 'must contain a terminal IEND chunk' };
 }
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-1 must contain image…' to match /IEND/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:235:7
   }
 
   if (!sawIhdr) return { error: 'must contain a complete 13-byte first IHDR chunk' };
-  if (!sawIdat) return { error: 'must contain image data in an IDAT chunk' };
+  if (true) return { error: 'must contain image data in an IDAT chunk' };
   return { error: 'must contain a terminal IEND chunk' };
 }
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-1 must contain image…' to match /IEND/i

[Killed] BlockStatement
packages/scene/src/masks.ts:239:68
   return { error: 'must contain a terminal IEND chunk' };
 }
 
-function isSafeNonnegativeInteger(value: unknown): value is number {
-  return Number.isSafeInteger(value) && (value as number) >= 0;
-}
+function isSafeNonnegativeInteger(value: unknown): value is number {}
 
 function validateSourceIdentity(value: unknown): string | null {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:240:10
 }
 
 function isSafeNonnegativeInteger(value: unknown): value is number {
-  return Number.isSafeInteger(value) && (value as number) >= 0;
+  return true;
 }
 
killedBy: raster mask document boundary validation rejects untrusted raster.editRevision metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:240:10
 }
 
 function isSafeNonnegativeInteger(value: unknown): value is number {
-  return Number.isSafeInteger(value) && (value as number) >= 0;
+  return false;
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:244:7
 }
 
 function validateSourceIdentity(value: unknown): string | null {
-  if (!isRecord(value)) return 'Raster mask source identity must be an object';
+  if (true) return 'Raster mask source identity must be an object';
   if (!isSafeNonnegativeInteger(value.revision)) {
     return 'Raster mask source identity revision must be a safe nonnegative integer';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:244:7
 }
 
 function validateSourceIdentity(value: unknown): string | null {
-  if (!isRecord(value)) return 'Raster mask source identity must be an object';
+  if (isRecord(value)) return 'Raster mask source identity must be an object';
   if (!isSafeNonnegativeInteger(value.revision)) {
     return 'Raster mask source identity revision must be a safe nonnegative integer';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:245:7
 
 function validateSourceIdentity(value: unknown): string | null {
   if (!isRecord(value)) return 'Raster mask source identity must be an object';
-  if (!isSafeNonnegativeInteger(value.revision)) {
+  if (false) {
     return 'Raster mask source identity revision must be a safe nonnegative integer';
   }
killedBy: raster mask document boundary validation rejects untrusted identity.revision metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:245:7
 
 function validateSourceIdentity(value: unknown): string | null {
   if (!isRecord(value)) return 'Raster mask source identity must be an object';
-  if (!isSafeNonnegativeInteger(value.revision)) {
+  if (true) {
     return 'Raster mask source identity revision must be a safe nonnegative integer';
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] BlockStatement
packages/scene/src/masks.ts:248:61
   if (!isSafeNonnegativeInteger(value.revision)) {
     return 'Raster mask source identity revision must be a safe nonnegative integer';
   }
-  for (const key of ['pixelWidth', 'pixelHeight'] as const) {
-    if (
-      value[key] !== undefined &&
-      (!Number.isInteger(value[key]) ||
-        (value[key] as number) <= 0 ||
-        (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
-    ) {
-      return `Raster mask source identity ${key} must be a supported positive integer`;
-    }
-  }
+  for (const key of ['pixelWidth', 'pixelHeight'] as const) {}
   if ((value.pixelWidth === undefined) !== (value.pixelHeight === undefined)) {
     return 'Raster mask source identity pixel dimensions must be provided together';

[Killed] LogicalOperator
packages/scene/src/masks.ts:250:7
   }
   for (const key of ['pixelWidth', 'pixelHeight'] as const) {
     if (
-      value[key] !== undefined &&
-      (!Number.isInteger(value[key]) ||
-        (value[key] as number) <= 0 ||
-        (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
+      value[key] !== undefined || !Number.isInteger(value[key]) || value[key] as number <= 0 || value[key] as number > RASTER_MASK_MAX_DIMENSION
     ) {
       return `Raster mask source identity ${key} must be a supported positive integer`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:250:7
   }
   for (const key of ['pixelWidth', 'pixelHeight'] as const) {
     if (
-      value[key] !== undefined &&
+      value[key] === undefined &&
       (!Number.isInteger(value[key]) ||
         (value[key] as number) <= 0 ||
killedBy: raster mask document boundary validation rejects an inherited toString asset reference during decode
statusReason: expected 'image-1: Raster mask source identity …' to match /missing raster mask asset/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:251:8
   for (const key of ['pixelWidth', 'pixelHeight'] as const) {
     if (
       value[key] !== undefined &&
-      (!Number.isInteger(value[key]) ||
-        (value[key] as number) <= 0 ||
-        (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
+      (true)
     ) {
       return `Raster mask source identity ${key} must be a supported positive integer`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:251:8
   for (const key of ['pixelWidth', 'pixelHeight'] as const) {
     if (
       value[key] !== undefined &&
-      (!Number.isInteger(value[key]) ||
+      (Number.isInteger(value[key]) ||
         (value[key] as number) <= 0 ||
         (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:252:9
     if (
       value[key] !== undefined &&
       (!Number.isInteger(value[key]) ||
-        (value[key] as number) <= 0 ||
+        value[key] as number > 0 ||
         (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
     ) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] EqualityOperator
packages/scene/src/masks.ts:252:9
     if (
       value[key] !== undefined &&
       (!Number.isInteger(value[key]) ||
-        (value[key] as number) <= 0 ||
+        value[key] as number < 0 ||
         (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
     ) {

[Killed] EqualityOperator
packages/scene/src/masks.ts:253:9
       value[key] !== undefined &&
       (!Number.isInteger(value[key]) ||
         (value[key] as number) <= 0 ||
-        (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
+        value[key] as number <= RASTER_MASK_MAX_DIMENSION)
     ) {
       return `Raster mask source identity ${key} must be a supported positive integer`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:253:9
       value[key] !== undefined &&
       (!Number.isInteger(value[key]) ||
         (value[key] as number) <= 0 ||
-        (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
+        false)
     ) {
       return `Raster mask source identity ${key} must be a supported positive integer`;

[Survived] BlockStatement
packages/scene/src/masks.ts:254:7
       (!Number.isInteger(value[key]) ||
         (value[key] as number) <= 0 ||
         (value[key] as number) > RASTER_MASK_MAX_DIMENSION)
-    ) {
-      return `Raster mask source identity ${key} must be a supported positive integer`;
-    }
+    ) {}
   }
   if ((value.pixelWidth === undefined) !== (value.pixelHeight === undefined)) {

[Killed] ConditionalExpression
packages/scene/src/masks.ts:258:8
       return `Raster mask source identity ${key} must be a supported positive integer`;
     }
   }
-  if ((value.pixelWidth === undefined) !== (value.pixelHeight === undefined)) {
+  if ((true) !== (value.pixelHeight === undefined)) {
     return 'Raster mask source identity pixel dimensions must be provided together';
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality
