[Killed] EqualityOperator
packages/scene/src/masks.ts:258:45
       return `Raster mask source identity ${key} must be a supported positive integer`;
     }
   }
-  if ((value.pixelWidth === undefined) !== (value.pixelHeight === undefined)) {
+  if ((value.pixelWidth === undefined) !== (value.pixelHeight !== undefined)) {
     return 'Raster mask source identity pixel dimensions must be provided together';
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[NoCoverage] StringLiteral
packages/scene/src/masks.ts:259:12
     }
   }
   if ((value.pixelWidth === undefined) !== (value.pixelHeight === undefined)) {
-    return 'Raster mask source identity pixel dimensions must be provided together';
+    return "";
   }
   if (value.kind === 'source-metadata') {

[Killed] EqualityOperator
packages/scene/src/masks.ts:261:7
   if ((value.pixelWidth === undefined) !== (value.pixelHeight === undefined)) {
     return 'Raster mask source identity pixel dimensions must be provided together';
   }
-  if (value.kind === 'source-metadata') {
+  if (value.kind !== 'source-metadata') {
     if ('sha256' in value) {
       return 'Raster mask source identity contains a field from another identity kind';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:261:41
   if ((value.pixelWidth === undefined) !== (value.pixelHeight === undefined)) {
     return 'Raster mask source identity pixel dimensions must be provided together';
   }
-  if (value.kind === 'source-metadata') {
-    if ('sha256' in value) {
-      return 'Raster mask source identity contains a field from another identity kind';
-    }
-    if (
-      typeof value.locator !== 'string' ||
-      value.locator.length === 0 ||
-      value.locator.length > 8192
-    ) {
-      return 'Raster mask source identity locator must be a nonempty string';
-    }
-    return null;
-  }
+  if (value.kind === 'source-metadata') {}
   if (value.kind === 'content-sha256') {
     if ('locator' in value) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:262:28
     return 'Raster mask source identity pixel dimensions must be provided together';
   }
   if (value.kind === 'source-metadata') {
-    if ('sha256' in value) {
-      return 'Raster mask source identity contains a field from another identity kind';
-    }
+    if ('sha256' in value) {}
     if (
       typeof value.locator !== 'string' ||
killedBy: raster mask document boundary validation rejects 'metadata identity with digest fields'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:262:9
     return 'Raster mask source identity pixel dimensions must be provided together';
   }
   if (value.kind === 'source-metadata') {
-    if ('sha256' in value) {
+    if (false) {
       return 'Raster mask source identity contains a field from another identity kind';
     }
killedBy: raster mask document boundary validation rejects 'metadata identity with digest fields'
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:266:7
       return 'Raster mask source identity contains a field from another identity kind';
     }
     if (
-      typeof value.locator !== 'string' ||
-      value.locator.length === 0 ||
-      value.locator.length > 8192
+      (typeof value.locator !== 'string' || value.locator.length === 0) && value.locator.length > 8192
     ) {
       return 'Raster mask source identity locator must be a nonempty string';
killedBy: raster mask document boundary validation rejects untrusted identity.locator metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:266:7
       return 'Raster mask source identity contains a field from another identity kind';
     }
     if (
-      typeof value.locator !== 'string' ||
-      value.locator.length === 0 ||
-      value.locator.length > 8192
+      true
     ) {
       return 'Raster mask source identity locator must be a nonempty string';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:267:7
     }
     if (
       typeof value.locator !== 'string' ||
-      value.locator.length === 0 ||
+      false ||
       value.locator.length > 8192
     ) {
killedBy: raster mask document boundary validation rejects untrusted identity.locator metadata
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:267:7
     }
     if (
       typeof value.locator !== 'string' ||
-      value.locator.length === 0 ||
+      value.locator.length !== 0 ||
       value.locator.length > 8192
     ) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:268:7
     if (
       typeof value.locator !== 'string' ||
       value.locator.length === 0 ||
-      value.locator.length > 8192
+      value.locator.length <= 8192
     ) {
       return 'Raster mask source identity locator must be a nonempty string';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:268:7
     if (
       typeof value.locator !== 'string' ||
       value.locator.length === 0 ||
-      value.locator.length > 8192
+      false
     ) {
       return 'Raster mask source identity locator must be a nonempty string';

[Killed] BlockStatement
packages/scene/src/masks.ts:269:7
       typeof value.locator !== 'string' ||
       value.locator.length === 0 ||
       value.locator.length > 8192
-    ) {
-      return 'Raster mask source identity locator must be a nonempty string';
-    }
+    ) {}
     return null;
   }
killedBy: raster mask document boundary validation rejects untrusted identity.locator metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:274:7
     }
     return null;
   }
-  if (value.kind === 'content-sha256') {
+  if (false) {
     if ('locator' in value) {
       return 'Raster mask source identity contains a field from another identity kind';
killedBy: native raster masks preserves a verified source content checksum when the caller provides one
statusReason: expected undefined to deeply equal { kind: 'content-sha256', …(4) }

[Killed] BlockStatement
packages/scene/src/masks.ts:274:40
     }
     return null;
   }
-  if (value.kind === 'content-sha256') {
-    if ('locator' in value) {
-      return 'Raster mask source identity contains a field from another identity kind';
-    }
-    if (typeof value.sha256 !== 'string' || !SHA256_PATTERN.test(value.sha256)) {
-      return 'Raster mask source identity SHA-256 must be 64 lowercase hexadecimal characters';
-    }
-    return null;
-  }
+  if (value.kind === 'content-sha256') {}
   return 'Raster mask source identity kind is unsupported';
 }
killedBy: native raster masks preserves a verified source content checksum when the caller provides one
statusReason: expected undefined to deeply equal { kind: 'content-sha256', …(4) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:275:9
     return null;
   }
   if (value.kind === 'content-sha256') {
-    if ('locator' in value) {
+    if (true) {
       return 'Raster mask source identity contains a field from another identity kind';
     }
killedBy: native raster masks preserves a verified source content checksum when the caller provides one
statusReason: expected undefined to deeply equal { kind: 'content-sha256', …(4) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:275:9
     return null;
   }
   if (value.kind === 'content-sha256') {
-    if ('locator' in value) {
+    if (false) {
       return 'Raster mask source identity contains a field from another identity kind';
     }
killedBy: raster mask document boundary validation rejects 'content identity with locator fields'
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:276:14
   }
   if (value.kind === 'content-sha256') {
     if ('locator' in value) {
-      return 'Raster mask source identity contains a field from another identity kind';
+      return "";
     }
     if (typeof value.sha256 !== 'string' || !SHA256_PATTERN.test(value.sha256)) {
killedBy: raster mask document boundary validation rejects 'content identity with locator fields'
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:278:9
     if ('locator' in value) {
       return 'Raster mask source identity contains a field from another identity kind';
     }
-    if (typeof value.sha256 !== 'string' || !SHA256_PATTERN.test(value.sha256)) {
+    if (typeof value.sha256 !== 'string' && !SHA256_PATTERN.test(value.sha256)) {
       return 'Raster mask source identity SHA-256 must be 64 lowercase hexadecimal characters';
     }
killedBy: raster mask document boundary validation rejects malformed source identity descriptors from decoded JSON
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:278:9
     if ('locator' in value) {
       return 'Raster mask source identity contains a field from another identity kind';
     }
-    if (typeof value.sha256 !== 'string' || !SHA256_PATTERN.test(value.sha256)) {
+    if (typeof value.sha256 === 'string' || !SHA256_PATTERN.test(value.sha256)) {
       return 'Raster mask source identity SHA-256 must be 64 lowercase hexadecimal characters';
     }
killedBy: native raster masks preserves a verified source content checksum when the caller provides one
statusReason: expected undefined to deeply equal { kind: 'content-sha256', …(4) }

[Killed] StringLiteral
packages/scene/src/masks.ts:279:14
       return 'Raster mask source identity contains a field from another identity kind';
     }
     if (typeof value.sha256 !== 'string' || !SHA256_PATTERN.test(value.sha256)) {
-      return 'Raster mask source identity SHA-256 must be 64 lowercase hexadecimal characters';
+      return "";
     }
     return null;
killedBy: raster mask document boundary validation rejects malformed source identity descriptors from decoded JSON
statusReason: expected true to be false // Object.is equality

[NoCoverage] StringLiteral
packages/scene/src/masks.ts:283:10
     }
     return null;
   }
-  return 'Raster mask source identity kind is unsupported';
+  return "";
 }
 

[Killed] ConditionalExpression
packages/scene/src/masks.ts:287:7
 }
 
 function validateProvenance(value: unknown): string | null {
-  if (!isRecord(value)) return 'Raster mask provenance must be an object';
+  if (true) return 'Raster mask provenance must be an object';
   if (!PROVENANCE_METHODS.includes(value.method as (typeof PROVENANCE_METHODS)[number])) {
     return 'Raster mask provenance method is unsupported';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] BooleanLiteral
packages/scene/src/masks.ts:287:7
 }
 
 function validateProvenance(value: unknown): string | null {
-  if (!isRecord(value)) return 'Raster mask provenance must be an object';
+  if (isRecord(value)) return 'Raster mask provenance must be an object';
   if (!PROVENANCE_METHODS.includes(value.method as (typeof PROVENANCE_METHODS)[number])) {
     return 'Raster mask provenance method is unsupported';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] BooleanLiteral
packages/scene/src/masks.ts:288:7
 
 function validateProvenance(value: unknown): string | null {
   if (!isRecord(value)) return 'Raster mask provenance must be an object';
-  if (!PROVENANCE_METHODS.includes(value.method as (typeof PROVENANCE_METHODS)[number])) {
+  if (PROVENANCE_METHODS.includes(value.method as (typeof PROVENANCE_METHODS)[number])) {
     return 'Raster mask provenance method is unsupported';
   }
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] BlockStatement
packages/scene/src/masks.ts:288:90
 
 function validateProvenance(value: unknown): string | null {
   if (!isRecord(value)) return 'Raster mask provenance must be an object';
-  if (!PROVENANCE_METHODS.includes(value.method as (typeof PROVENANCE_METHODS)[number])) {
-    return 'Raster mask provenance method is unsupported';
-  }
+  if (!PROVENANCE_METHODS.includes(value.method as (typeof PROVENANCE_METHODS)[number])) {}
   if (!PROVENANCE_RUNTIMES.includes(value.runtime as (typeof PROVENANCE_RUNTIMES)[number])) {
     return 'Raster mask provenance runtime is unsupported';
killedBy: raster mask document boundary validation rejects untrusted provenance.method metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:291:7
   if (!PROVENANCE_METHODS.includes(value.method as (typeof PROVENANCE_METHODS)[number])) {
     return 'Raster mask provenance method is unsupported';
   }
-  if (!PROVENANCE_RUNTIMES.includes(value.runtime as (typeof PROVENANCE_RUNTIMES)[number])) {
+  if (true) {
     return 'Raster mask provenance runtime is unsupported';
   }
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:291:7
   if (!PROVENANCE_METHODS.includes(value.method as (typeof PROVENANCE_METHODS)[number])) {
     return 'Raster mask provenance method is unsupported';
   }
-  if (!PROVENANCE_RUNTIMES.includes(value.runtime as (typeof PROVENANCE_RUNTIMES)[number])) {
+  if (false) {
     return 'Raster mask provenance runtime is unsupported';
   }
killedBy: raster mask document boundary validation rejects untrusted provenance.runtime metadata
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:295:5
     return 'Raster mask provenance runtime is unsupported';
   }
   if (
-    typeof value.generatedAt !== 'number' ||
-    !Number.isFinite(value.generatedAt) ||
-    value.generatedAt < 0 ||
-    value.generatedAt > Number.MAX_SAFE_INTEGER
+    (typeof value.generatedAt !== 'number' || !Number.isFinite(value.generatedAt) || value.generatedAt < 0) && value.generatedAt > Number.MAX_SAFE_INTEGER
   ) {
     return 'Raster mask provenance generatedAt must be a supported nonnegative timestamp';
killedBy: raster mask document boundary validation rejects untrusted provenance.generatedAt metadata
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:295:5
     return 'Raster mask provenance runtime is unsupported';
   }
   if (
-    typeof value.generatedAt !== 'number' ||
-    !Number.isFinite(value.generatedAt) ||
-    value.generatedAt < 0 ||
+    (typeof value.generatedAt !== 'number' || !Number.isFinite(value.generatedAt)) && value.generatedAt < 0 ||
     value.generatedAt > Number.MAX_SAFE_INTEGER
   ) {
killedBy: raster mask document boundary validation rejects untrusted provenance.generatedAt metadata
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:296:5
   }
   if (
     typeof value.generatedAt !== 'number' ||
-    !Number.isFinite(value.generatedAt) ||
+    Number.isFinite(value.generatedAt) ||
     value.generatedAt < 0 ||
     value.generatedAt > Number.MAX_SAFE_INTEGER
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:297:5
   if (
     typeof value.generatedAt !== 'number' ||
     !Number.isFinite(value.generatedAt) ||
-    value.generatedAt < 0 ||
+    false ||
     value.generatedAt > Number.MAX_SAFE_INTEGER
   ) {
killedBy: raster mask document boundary validation rejects untrusted provenance.generatedAt metadata
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:297:5
   if (
     typeof value.generatedAt !== 'number' ||
     !Number.isFinite(value.generatedAt) ||
-    value.generatedAt < 0 ||
+    value.generatedAt >= 0 ||
     value.generatedAt > Number.MAX_SAFE_INTEGER
   ) {
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] EqualityOperator
packages/scene/src/masks.ts:298:5
     typeof value.generatedAt !== 'number' ||
     !Number.isFinite(value.generatedAt) ||
     value.generatedAt < 0 ||
-    value.generatedAt > Number.MAX_SAFE_INTEGER
+    value.generatedAt <= Number.MAX_SAFE_INTEGER
   ) {
     return 'Raster mask provenance generatedAt must be a supported nonnegative timestamp';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Survived] EqualityOperator
packages/scene/src/masks.ts:298:5
     typeof value.generatedAt !== 'number' ||
     !Number.isFinite(value.generatedAt) ||
     value.generatedAt < 0 ||
-    value.generatedAt > Number.MAX_SAFE_INTEGER
+    value.generatedAt >= Number.MAX_SAFE_INTEGER
   ) {
     return 'Raster mask provenance generatedAt must be a supported nonnegative timestamp';

[Killed] BlockStatement
packages/scene/src/masks.ts:299:5
     !Number.isFinite(value.generatedAt) ||
     value.generatedAt < 0 ||
     value.generatedAt > Number.MAX_SAFE_INTEGER
-  ) {
-    return 'Raster mask provenance generatedAt must be a supported nonnegative timestamp';
-  }
+  ) {}
   for (const key of ['modelId', 'modelVersion'] as const) {
     if (
killedBy: raster mask document boundary validation rejects untrusted provenance.generatedAt metadata
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:300:12
     value.generatedAt < 0 ||
     value.generatedAt > Number.MAX_SAFE_INTEGER
   ) {
-    return 'Raster mask provenance generatedAt must be a supported nonnegative timestamp';
+    return "";
   }
   for (const key of ['modelId', 'modelVersion'] as const) {
killedBy: raster mask document boundary validation rejects untrusted provenance.generatedAt metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:302:59
   ) {
     return 'Raster mask provenance generatedAt must be a supported nonnegative timestamp';
   }
-  for (const key of ['modelId', 'modelVersion'] as const) {
-    if (
-      value[key] !== undefined &&
-      (typeof value[key] !== 'string' || value[key].length === 0 || value[key].length > 1024)
-    ) {
-      return `Raster mask provenance ${key} must be a nonempty string`;
-    }
-  }
+  for (const key of ['modelId', 'modelVersion'] as const) {}
   if (
     value.modelChecksum !== undefined &&
killedBy: raster mask document boundary validation rejects untrusted provenance.modelId metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:304:7
   }
   for (const key of ['modelId', 'modelVersion'] as const) {
     if (
-      value[key] !== undefined &&
-      (typeof value[key] !== 'string' || value[key].length === 0 || value[key].length > 1024)
+      false
     ) {
       return `Raster mask provenance ${key} must be a nonempty string`;
killedBy: raster mask document boundary validation rejects untrusted provenance.modelId metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:304:7
   }
   for (const key of ['modelId', 'modelVersion'] as const) {
     if (
-      value[key] !== undefined &&
-      (typeof value[key] !== 'string' || value[key].length === 0 || value[key].length > 1024)
+      true
     ) {
       return `Raster mask provenance ${key} must be a nonempty string`;
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:305:8
   for (const key of ['modelId', 'modelVersion'] as const) {
     if (
       value[key] !== undefined &&
-      (typeof value[key] !== 'string' || value[key].length === 0 || value[key].length > 1024)
+      (false || value[key].length > 1024)
     ) {
       return `Raster mask provenance ${key} must be a nonempty string`;
killedBy: raster mask document boundary validation rejects untrusted provenance.modelId metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:305:8
   for (const key of ['modelId', 'modelVersion'] as const) {
     if (
       value[key] !== undefined &&
-      (typeof value[key] !== 'string' || value[key].length === 0 || value[key].length > 1024)
+      (false || value[key].length === 0 || value[key].length > 1024)
     ) {
       return `Raster mask provenance ${key} must be a nonempty string`;
killedBy: raster mask document boundary validation rejects untrusted provenance.modelId metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:306:7
     if (
       value[key] !== undefined &&
       (typeof value[key] !== 'string' || value[key].length === 0 || value[key].length > 1024)
-    ) {
-      return `Raster mask provenance ${key} must be a nonempty string`;
-    }
+    ) {}
   }
   if (
killedBy: raster mask document boundary validation rejects untrusted provenance.modelId metadata
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:311:5
     }
   }
   if (
-    value.modelChecksum !== undefined &&
-    (typeof value.modelChecksum !== 'string' || !SHA256_PATTERN.test(value.modelChecksum))
+    value.modelChecksum !== undefined || typeof value.modelChecksum !== 'string' || !SHA256_PATTERN.test(value.modelChecksum)
   ) {
     return 'Raster mask provenance modelChecksum must be a lowercase SHA-256 digest';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:311:5
     }
   }
   if (
-    value.modelChecksum !== undefined &&
-    (typeof value.modelChecksum !== 'string' || !SHA256_PATTERN.test(value.modelChecksum))
+    true
   ) {
     return 'Raster mask provenance modelChecksum must be a lowercase SHA-256 digest';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] BooleanLiteral
packages/scene/src/masks.ts:312:49
   }
   if (
     value.modelChecksum !== undefined &&
-    (typeof value.modelChecksum !== 'string' || !SHA256_PATTERN.test(value.modelChecksum))
+    (typeof value.modelChecksum !== 'string' || SHA256_PATTERN.test(value.modelChecksum))
   ) {
     return 'Raster mask provenance modelChecksum must be a lowercase SHA-256 digest';
killedBy: raster mask document boundary validation rejects untrusted provenance.modelChecksum metadata
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:312:6
   }
   if (
     value.modelChecksum !== undefined &&
-    (typeof value.modelChecksum !== 'string' || !SHA256_PATTERN.test(value.modelChecksum))
+    (typeof value.modelChecksum !== 'string' && !SHA256_PATTERN.test(value.modelChecksum))
   ) {
     return 'Raster mask provenance modelChecksum must be a lowercase SHA-256 digest';
killedBy: raster mask document boundary validation rejects untrusted provenance.modelChecksum metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:313:5
   if (
     value.modelChecksum !== undefined &&
     (typeof value.modelChecksum !== 'string' || !SHA256_PATTERN.test(value.modelChecksum))
-  ) {
-    return 'Raster mask provenance modelChecksum must be a lowercase SHA-256 digest';
-  }
+  ) {}
   if (
     value.confidence !== undefined &&
killedBy: raster mask document boundary validation rejects untrusted provenance.modelChecksum metadata
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:314:12
     value.modelChecksum !== undefined &&
     (typeof value.modelChecksum !== 'string' || !SHA256_PATTERN.test(value.modelChecksum))
   ) {
-    return 'Raster mask provenance modelChecksum must be a lowercase SHA-256 digest';
+    return "";
   }
   if (
killedBy: raster mask document boundary validation rejects untrusted provenance.modelChecksum metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:317:5
     return 'Raster mask provenance modelChecksum must be a lowercase SHA-256 digest';
   }
   if (
-    value.confidence !== undefined &&
-    (typeof value.confidence !== 'number' ||
-      !Number.isFinite(value.confidence) ||
-      value.confidence < 0 ||
-      value.confidence > 1)
+    false
   ) {
     return 'Raster mask provenance confidence must be between zero and one';
killedBy: raster mask document boundary validation rejects untrusted provenance.confidence metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:317:5
     return 'Raster mask provenance modelChecksum must be a lowercase SHA-256 digest';
   }
   if (
-    value.confidence !== undefined &&
-    (typeof value.confidence !== 'number' ||
-      !Number.isFinite(value.confidence) ||
-      value.confidence < 0 ||
-      value.confidence > 1)
+    true
   ) {
     return 'Raster mask provenance confidence must be between zero and one';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] EqualityOperator
packages/scene/src/masks.ts:318:6
   }
   if (
     value.confidence !== undefined &&
-    (typeof value.confidence !== 'number' ||
+    (typeof value.confidence === 'number' ||
       !Number.isFinite(value.confidence) ||
       value.confidence < 0 ||
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:318:6
   }
   if (
     value.confidence !== undefined &&
-    (typeof value.confidence !== 'number' ||
-      !Number.isFinite(value.confidence) ||
-      value.confidence < 0 ||
-      value.confidence > 1)
+    (true)
   ) {
     return 'Raster mask provenance confidence must be between zero and one';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] BooleanLiteral
packages/scene/src/masks.ts:319:7
   if (
     value.confidence !== undefined &&
     (typeof value.confidence !== 'number' ||
-      !Number.isFinite(value.confidence) ||
+      Number.isFinite(value.confidence) ||
       value.confidence < 0 ||
       value.confidence > 1)
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] EqualityOperator
packages/scene/src/masks.ts:320:7
     value.confidence !== undefined &&
     (typeof value.confidence !== 'number' ||
       !Number.isFinite(value.confidence) ||
-      value.confidence < 0 ||
+      value.confidence >= 0 ||
       value.confidence > 1)
   ) {
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }
