[Survived] ConditionalExpression
packages/scene/src/masks.ts:320:7
     value.confidence !== undefined &&
     (typeof value.confidence !== 'number' ||
       !Number.isFinite(value.confidence) ||
-      value.confidence < 0 ||
+      false ||
       value.confidence > 1)
   ) {

[Killed] ConditionalExpression
packages/scene/src/masks.ts:321:7
     (typeof value.confidence !== 'number' ||
       !Number.isFinite(value.confidence) ||
       value.confidence < 0 ||
-      value.confidence > 1)
+      false)
   ) {
     return 'Raster mask provenance confidence must be between zero and one';
killedBy: raster mask document boundary validation rejects untrusted provenance.confidence metadata
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:321:7
     (typeof value.confidence !== 'number' ||
       !Number.isFinite(value.confidence) ||
       value.confidence < 0 ||
-      value.confidence > 1)
+      value.confidence <= 1)
   ) {
     return 'Raster mask provenance confidence must be between zero and one';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] BlockStatement
packages/scene/src/masks.ts:322:5
       !Number.isFinite(value.confidence) ||
       value.confidence < 0 ||
       value.confidence > 1)
-  ) {
-    return 'Raster mask provenance confidence must be between zero and one';
-  }
+  ) {}
   if (value.decontaminate !== undefined && typeof value.decontaminate !== 'boolean') {
     return 'Raster mask provenance decontaminate must be boolean';
killedBy: raster mask document boundary validation rejects untrusted provenance.confidence metadata
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:325:7
   ) {
     return 'Raster mask provenance confidence must be between zero and one';
   }
-  if (value.decontaminate !== undefined && typeof value.decontaminate !== 'boolean') {
+  if (value.decontaminate === undefined && typeof value.decontaminate !== 'boolean') {
     return 'Raster mask provenance decontaminate must be boolean';
   }
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:325:7
   ) {
     return 'Raster mask provenance confidence must be between zero and one';
   }
-  if (value.decontaminate !== undefined && typeof value.decontaminate !== 'boolean') {
+  if (false) {
     return 'Raster mask provenance decontaminate must be boolean';
   }
killedBy: raster mask document boundary validation rejects untrusted provenance.decontaminate metadata
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:326:12
     return 'Raster mask provenance confidence must be between zero and one';
   }
   if (value.decontaminate !== undefined && typeof value.decontaminate !== 'boolean') {
-    return 'Raster mask provenance decontaminate must be boolean';
+    return "";
   }
   if (
killedBy: raster mask document boundary validation rejects untrusted provenance.decontaminate metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:329:5
     return 'Raster mask provenance decontaminate must be boolean';
   }
   if (
-    value.origin !== undefined &&
-    !PROVENANCE_ORIGINS.includes(value.origin as (typeof PROVENANCE_ORIGINS)[number])
+    false
   ) {
     return 'Raster mask provenance origin is unsupported';
killedBy: raster mask document boundary validation rejects untrusted provenance.origin metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:329:5
     return 'Raster mask provenance decontaminate must be boolean';
   }
   if (
-    value.origin !== undefined &&
-    !PROVENANCE_ORIGINS.includes(value.origin as (typeof PROVENANCE_ORIGINS)[number])
+    true
   ) {
     return 'Raster mask provenance origin is unsupported';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] BooleanLiteral
packages/scene/src/masks.ts:330:5
   }
   if (
     value.origin !== undefined &&
-    !PROVENANCE_ORIGINS.includes(value.origin as (typeof PROVENANCE_ORIGINS)[number])
+    PROVENANCE_ORIGINS.includes(value.origin as (typeof PROVENANCE_ORIGINS)[number])
   ) {
     return 'Raster mask provenance origin is unsupported';
killedBy: raster mask document boundary validation rejects untrusted provenance.origin metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:331:5
   if (
     value.origin !== undefined &&
     !PROVENANCE_ORIGINS.includes(value.origin as (typeof PROVENANCE_ORIGINS)[number])
-  ) {
-    return 'Raster mask provenance origin is unsupported';
-  }
+  ) {}
   return null;
 }
killedBy: raster mask document boundary validation rejects untrusted provenance.origin metadata
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:339:7
 
 /** Validate declared raster asset metadata without decoding PNG headers. */
 export function validateRasterMaskAsset(asset: RasterMaskAsset): string | null {
-  if (!isRecord(asset)) return 'Raster mask asset must be an object';
+  if (isRecord(asset)) return 'Raster mask asset must be an object';
   if (typeof asset.id !== 'string' || !ASSET_ID_PATTERN.test(asset.id)) {
     return 'Raster mask asset id must use the portable asset-id syntax';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:339:7
 
 /** Validate declared raster asset metadata without decoding PNG headers. */
 export function validateRasterMaskAsset(asset: RasterMaskAsset): string | null {
-  if (!isRecord(asset)) return 'Raster mask asset must be an object';
+  if (true) return 'Raster mask asset must be an object';
   if (typeof asset.id !== 'string' || !ASSET_ID_PATTERN.test(asset.id)) {
     return 'Raster mask asset id must use the portable asset-id syntax';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:340:7
 /** Validate declared raster asset metadata without decoding PNG headers. */
 export function validateRasterMaskAsset(asset: RasterMaskAsset): string | null {
   if (!isRecord(asset)) return 'Raster mask asset must be an object';
-  if (typeof asset.id !== 'string' || !ASSET_ID_PATTERN.test(asset.id)) {
+  if (true) {
     return 'Raster mask asset id must use the portable asset-id syntax';
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:340:39
 /** Validate declared raster asset metadata without decoding PNG headers. */
 export function validateRasterMaskAsset(asset: RasterMaskAsset): string | null {
   if (!isRecord(asset)) return 'Raster mask asset must be an object';
-  if (typeof asset.id !== 'string' || !ASSET_ID_PATTERN.test(asset.id)) {
+  if (typeof asset.id !== 'string' || ASSET_ID_PATTERN.test(asset.id)) {
     return 'Raster mask asset id must use the portable asset-id syntax';
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] StringLiteral
packages/scene/src/masks.ts:341:12
 export function validateRasterMaskAsset(asset: RasterMaskAsset): string | null {
   if (!isRecord(asset)) return 'Raster mask asset must be an object';
   if (typeof asset.id !== 'string' || !ASSET_ID_PATTERN.test(asset.id)) {
-    return 'Raster mask asset id must use the portable asset-id syntax';
+    return "";
   }
   if (

[Killed] LogicalOperator
packages/scene/src/masks.ts:344:5
     return 'Raster mask asset id must use the portable asset-id syntax';
   }
   if (
-    asset.checksum !== undefined &&
-    (typeof asset.checksum !== 'string' || !SHA256_PATTERN.test(asset.checksum))
+    asset.checksum !== undefined || typeof asset.checksum !== 'string' || !SHA256_PATTERN.test(asset.checksum)
   ) {
     return `Raster mask ${asset.id} checksum must be a lowercase SHA-256 digest`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:344:5
     return 'Raster mask asset id must use the portable asset-id syntax';
   }
   if (
-    asset.checksum !== undefined &&
-    (typeof asset.checksum !== 'string' || !SHA256_PATTERN.test(asset.checksum))
+    true
   ) {
     return `Raster mask ${asset.id} checksum must be a lowercase SHA-256 digest`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:345:6
   }
   if (
     asset.checksum !== undefined &&
-    (typeof asset.checksum !== 'string' || !SHA256_PATTERN.test(asset.checksum))
+    (typeof asset.checksum !== 'string' && !SHA256_PATTERN.test(asset.checksum))
   ) {
     return `Raster mask ${asset.id} checksum must be a lowercase SHA-256 digest`;
killedBy: raster mask document boundary validation rejects untrusted asset.checksum metadata
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:345:44
   }
   if (
     asset.checksum !== undefined &&
-    (typeof asset.checksum !== 'string' || !SHA256_PATTERN.test(asset.checksum))
+    (typeof asset.checksum !== 'string' || SHA256_PATTERN.test(asset.checksum))
   ) {
     return `Raster mask ${asset.id} checksum must be a lowercase SHA-256 digest`;
killedBy: raster mask document boundary validation rejects untrusted asset.checksum metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:346:5
   if (
     asset.checksum !== undefined &&
     (typeof asset.checksum !== 'string' || !SHA256_PATTERN.test(asset.checksum))
-  ) {
-    return `Raster mask ${asset.id} checksum must be a lowercase SHA-256 digest`;
-  }
+  ) {}
   if (
     asset.mimeType !== 'image/png' ||
killedBy: raster mask document boundary validation rejects untrusted asset.checksum metadata
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:350:5
     return `Raster mask ${asset.id} checksum must be a lowercase SHA-256 digest`;
   }
   if (
-    asset.mimeType !== 'image/png' ||
-    !PNG_DATA_URL_PATTERN.test(asset.dataUrl) ||
+    asset.mimeType !== 'image/png' && !PNG_DATA_URL_PATTERN.test(asset.dataUrl) ||
     asset.dataUrl === 'data:image/png;base64,'
   ) {
killedBy: raster mask document boundary validation rejects invalid PNG MIME
statusReason: expected 'Raster mask mask-1 byteLength must ma…' to match /PNG data URL/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:350:5
     return `Raster mask ${asset.id} checksum must be a lowercase SHA-256 digest`;
   }
   if (
-    asset.mimeType !== 'image/png' ||
-    !PNG_DATA_URL_PATTERN.test(asset.dataUrl) ||
-    asset.dataUrl === 'data:image/png;base64,'
+    true
   ) {
     return `Raster mask ${asset.id} must use a valid PNG data URL`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:351:5
   }
   if (
     asset.mimeType !== 'image/png' ||
-    !PNG_DATA_URL_PATTERN.test(asset.dataUrl) ||
+    PNG_DATA_URL_PATTERN.test(asset.dataUrl) ||
     asset.dataUrl === 'data:image/png;base64,'
   ) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:352:5
   if (
     asset.mimeType !== 'image/png' ||
     !PNG_DATA_URL_PATTERN.test(asset.dataUrl) ||
-    asset.dataUrl === 'data:image/png;base64,'
+    asset.dataUrl !== 'data:image/png;base64,'
   ) {
     return `Raster mask ${asset.id} must use a valid PNG data URL`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:352:5
   if (
     asset.mimeType !== 'image/png' ||
     !PNG_DATA_URL_PATTERN.test(asset.dataUrl) ||
-    asset.dataUrl === 'data:image/png;base64,'
+    false
   ) {
     return `Raster mask ${asset.id} must use a valid PNG data URL`;

[Killed] BlockStatement
packages/scene/src/masks.ts:353:5
     asset.mimeType !== 'image/png' ||
     !PNG_DATA_URL_PATTERN.test(asset.dataUrl) ||
     asset.dataUrl === 'data:image/png;base64,'
-  ) {
-    return `Raster mask ${asset.id} must use a valid PNG data URL`;
-  }
+  ) {}
   const payload = asset.dataUrl.slice(PNG_DATA_URL_PREFIX.length);
   const actualByteLength = decodedBase64Length(payload);
killedBy: raster mask document boundary validation rejects invalid PNG MIME
statusReason: expected 'Raster mask mask-1 byteLength must ma…' to match /PNG data URL/i

[Killed] MethodExpression
packages/scene/src/masks.ts:356:19
   ) {
     return `Raster mask ${asset.id} must use a valid PNG data URL`;
   }
-  const payload = asset.dataUrl.slice(PNG_DATA_URL_PREFIX.length);
+  const payload = asset.dataUrl;
   const actualByteLength = decodedBase64Length(payload);
   if (asset.byteLength > RASTER_MASK_MAX_ENCODED_BYTES) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:358:57
   }
   const payload = asset.dataUrl.slice(PNG_DATA_URL_PREFIX.length);
   const actualByteLength = decodedBase64Length(payload);
-  if (asset.byteLength > RASTER_MASK_MAX_ENCODED_BYTES) {
-    return `Raster mask ${asset.id} exceeds the encoded byte limit`;
-  }
+  if (asset.byteLength > RASTER_MASK_MAX_ENCODED_BYTES) {}
   if (!Number.isInteger(asset.byteLength) || asset.byteLength !== actualByteLength) {
     return `Raster mask ${asset.id} byteLength must match its decoded PNG payload`;
killedBy: raster mask document boundary validation rejects encoded byte limit
statusReason: expected 'Raster mask mask-1 byteLength must ma…' to match /encoded byte limit/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:358:7
   }
   const payload = asset.dataUrl.slice(PNG_DATA_URL_PREFIX.length);
   const actualByteLength = decodedBase64Length(payload);
-  if (asset.byteLength > RASTER_MASK_MAX_ENCODED_BYTES) {
+  if (true) {
     return `Raster mask ${asset.id} exceeds the encoded byte limit`;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:361:7
   if (asset.byteLength > RASTER_MASK_MAX_ENCODED_BYTES) {
     return `Raster mask ${asset.id} exceeds the encoded byte limit`;
   }
-  if (!Number.isInteger(asset.byteLength) || asset.byteLength !== actualByteLength) {
+  if (!Number.isInteger(asset.byteLength) && asset.byteLength !== actualByteLength) {
     return `Raster mask ${asset.id} byteLength must match its decoded PNG payload`;
   }
killedBy: raster mask document boundary validation rejects decoded length, IHDR type, and declared dimension mismatches
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:361:7
   if (asset.byteLength > RASTER_MASK_MAX_ENCODED_BYTES) {
     return `Raster mask ${asset.id} exceeds the encoded byte limit`;
   }
-  if (!Number.isInteger(asset.byteLength) || asset.byteLength !== actualByteLength) {
+  if (Number.isInteger(asset.byteLength) || asset.byteLength !== actualByteLength) {
     return `Raster mask ${asset.id} byteLength must match its decoded PNG payload`;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:362:12
     return `Raster mask ${asset.id} exceeds the encoded byte limit`;
   }
   if (!Number.isInteger(asset.byteLength) || asset.byteLength !== actualByteLength) {
-    return `Raster mask ${asset.id} byteLength must match its decoded PNG payload`;
+    return ``;
   }
   const png = validatePngStructure(payload);
killedBy: raster mask document boundary validation rejects decoded length, IHDR type, and declared dimension mismatches
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:365:7
     return `Raster mask ${asset.id} byteLength must match its decoded PNG payload`;
   }
   const png = validatePngStructure(payload);
-  if ('error' in png) return `Raster mask ${asset.id} ${png.error}`;
+  if (false) return `Raster mask ${asset.id} ${png.error}`;
   if (
     !Number.isInteger(asset.width) ||
killedBy: raster mask document boundary validation rejects structurally corrupt PNG mask payloads
statusReason: expected 'Raster mask case-0 declared dimension…' to match /IHDR.*(truncated|complete)|chunk bou…/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:365:7
     return `Raster mask ${asset.id} byteLength must match its decoded PNG payload`;
   }
   const png = validatePngStructure(payload);
-  if ('error' in png) return `Raster mask ${asset.id} ${png.error}`;
+  if (true) return `Raster mask ${asset.id} ${png.error}`;
   if (
     !Number.isInteger(asset.width) ||
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:367:5
   const png = validatePngStructure(payload);
   if ('error' in png) return `Raster mask ${asset.id} ${png.error}`;
   if (
-    !Number.isInteger(asset.width) ||
-    !Number.isInteger(asset.height) ||
-    asset.width <= 0 ||
-    asset.height <= 0
+    true
   ) {
     return `Raster mask ${asset.id} must declare positive dimensions`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:367:5
   const png = validatePngStructure(payload);
   if ('error' in png) return `Raster mask ${asset.id} ${png.error}`;
   if (
-    !Number.isInteger(asset.width) ||
-    !Number.isInteger(asset.height) ||
-    asset.width <= 0 ||
-    asset.height <= 0
+    false
   ) {
     return `Raster mask ${asset.id} must declare positive dimensions`;
killedBy: raster mask document boundary validation rejects zero width
statusReason: expected 'Raster mask mask-1 declared dimension…' to match /positive dimensions/i

[Killed] BooleanLiteral
packages/scene/src/masks.ts:368:5
   if ('error' in png) return `Raster mask ${asset.id} ${png.error}`;
   if (
     !Number.isInteger(asset.width) ||
-    !Number.isInteger(asset.height) ||
+    Number.isInteger(asset.height) ||
     asset.width <= 0 ||
     asset.height <= 0
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:369:5
   if (
     !Number.isInteger(asset.width) ||
     !Number.isInteger(asset.height) ||
-    asset.width <= 0 ||
+    false ||
     asset.height <= 0
   ) {
killedBy: raster mask document boundary validation rejects zero width
statusReason: expected 'Raster mask mask-1 declared dimension…' to match /positive dimensions/i

[Killed] EqualityOperator
packages/scene/src/masks.ts:369:5
   if (
     !Number.isInteger(asset.width) ||
     !Number.isInteger(asset.height) ||
-    asset.width <= 0 ||
+    asset.width < 0 ||
     asset.height <= 0
   ) {
killedBy: raster mask document boundary validation rejects zero width
statusReason: expected 'Raster mask mask-1 declared dimension…' to match /positive dimensions/i

[Killed] EqualityOperator
packages/scene/src/masks.ts:370:5
     !Number.isInteger(asset.width) ||
     !Number.isInteger(asset.height) ||
     asset.width <= 0 ||
-    asset.height <= 0
+    asset.height > 0
   ) {
     return `Raster mask ${asset.id} must declare positive dimensions`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:370:5
     !Number.isInteger(asset.width) ||
     !Number.isInteger(asset.height) ||
     asset.width <= 0 ||
-    asset.height <= 0
+    false
   ) {
     return `Raster mask ${asset.id} must declare positive dimensions`;

[Killed] BlockStatement
packages/scene/src/masks.ts:371:5
     !Number.isInteger(asset.height) ||
     asset.width <= 0 ||
     asset.height <= 0
-  ) {
-    return `Raster mask ${asset.id} must declare positive dimensions`;
-  }
+  ) {}
   if (asset.width * asset.height > RASTER_MASK_MAX_DECODED_PIXELS) {
     return `Raster mask ${asset.id} exceeds the decoded pixel limit`;
killedBy: raster mask document boundary validation rejects zero width
statusReason: expected 'Raster mask mask-1 declared dimension…' to match /positive dimensions/i

[Killed] StringLiteral
packages/scene/src/masks.ts:372:12
     asset.width <= 0 ||
     asset.height <= 0
   ) {
-    return `Raster mask ${asset.id} must declare positive dimensions`;
+    return ``;
   }
   if (asset.width * asset.height > RASTER_MASK_MAX_DECODED_PIXELS) {
killedBy: raster mask document boundary validation rejects zero width
statusReason: expected 'image-1: Raster mask source identity …' to match /positive dimensions/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:374:7
   ) {
     return `Raster mask ${asset.id} must declare positive dimensions`;
   }
-  if (asset.width * asset.height > RASTER_MASK_MAX_DECODED_PIXELS) {
+  if (true) {
     return `Raster mask ${asset.id} exceeds the decoded pixel limit`;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:374:7
   ) {
     return `Raster mask ${asset.id} must declare positive dimensions`;
   }
-  if (asset.width * asset.height > RASTER_MASK_MAX_DECODED_PIXELS) {
+  if (asset.width * asset.height >= RASTER_MASK_MAX_DECODED_PIXELS) {
     return `Raster mask ${asset.id} exceeds the decoded pixel limit`;
   }
killedBy: raster mask document boundary validation accepts the portable decoded-pixel boundary and rejects the next row
statusReason: expected 'Raster mask at-limit exceeds the deco…' to be null

[Killed] ConditionalExpression
packages/scene/src/masks.ts:377:7
   if (asset.width * asset.height > RASTER_MASK_MAX_DECODED_PIXELS) {
     return `Raster mask ${asset.id} exceeds the decoded pixel limit`;
   }
-  if (asset.width > RASTER_MASK_MAX_DIMENSION || asset.height > RASTER_MASK_MAX_DIMENSION) {
+  if (true) {
     return `Raster mask ${asset.id} exceeds the per-dimension limit of ${RASTER_MASK_MAX_DIMENSION}`;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:377:7
   if (asset.width * asset.height > RASTER_MASK_MAX_DECODED_PIXELS) {
     return `Raster mask ${asset.id} exceeds the decoded pixel limit`;
   }
-  if (asset.width > RASTER_MASK_MAX_DIMENSION || asset.height > RASTER_MASK_MAX_DIMENSION) {
+  if (asset.width > RASTER_MASK_MAX_DIMENSION && asset.height > RASTER_MASK_MAX_DIMENSION) {
     return `Raster mask ${asset.id} exceeds the per-dimension limit of ${RASTER_MASK_MAX_DIMENSION}`;
   }
killedBy: raster mask document boundary validation rejects dimension above limit
statusReason: expected 'Raster mask mask-1 declared dimension…' to match /dimension limit/i

[Killed] ConditionalExpression
packages/scene/src/masks.ts:380:7
   if (asset.width > RASTER_MASK_MAX_DIMENSION || asset.height > RASTER_MASK_MAX_DIMENSION) {
     return `Raster mask ${asset.id} exceeds the per-dimension limit of ${RASTER_MASK_MAX_DIMENSION}`;
   }
-  if (asset.width !== png.width || asset.height !== png.height) {
+  if (true) {
     return `Raster mask ${asset.id} declared dimensions must match its PNG IHDR`;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:380:36
   if (asset.width > RASTER_MASK_MAX_DIMENSION || asset.height > RASTER_MASK_MAX_DIMENSION) {
     return `Raster mask ${asset.id} exceeds the per-dimension limit of ${RASTER_MASK_MAX_DIMENSION}`;
   }
-  if (asset.width !== png.width || asset.height !== png.height) {
+  if (asset.width !== png.width || asset.height === png.height) {
     return `Raster mask ${asset.id} declared dimensions must match its PNG IHDR`;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] StringLiteral
packages/scene/src/masks.ts:381:12
     return `Raster mask ${asset.id} exceeds the per-dimension limit of ${RASTER_MASK_MAX_DIMENSION}`;
   }
   if (asset.width !== png.width || asset.height !== png.height) {
-    return `Raster mask ${asset.id} declared dimensions must match its PNG IHDR`;
+    return ``;
   }
   return null;

[Killed] LogicalOperator
packages/scene/src/masks.ts:397:7
     rasterMask?: RasterMaskData;
   },
 ): string | null {
-  if (mask.rasterMask && ('sourceNodeId' in mask || 'vectorMask' in mask)) {
+  if (mask.rasterMask || 'sourceNodeId' in mask || 'vectorMask' in mask) {
     return 'A raster mask source must be exclusive of structural source properties';
   }
killedBy: resolveMask returns mask when set on frame with valid child
statusReason: expected null not to be null

[Killed] ConditionalExpression
packages/scene/src/masks.ts:397:27
     rasterMask?: RasterMaskData;
   },
 ): string | null {
-  if (mask.rasterMask && ('sourceNodeId' in mask || 'vectorMask' in mask)) {
+  if (mask.rasterMask && (true)) {
     return 'A raster mask source must be exclusive of structural source properties';
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:402:37
   }
   // A sourceNodeId may accompany a vector mask as optional visual content;
   // vectorMask remains the sole geometry source in that compatible form.
-  const hasVectorGeometry = Boolean(mask.vectorMask && mask.vectorMask.points.length > 0);
+  const hasVectorGeometry = Boolean(mask.vectorMask || mask.vectorMask.points.length > 0);
   const structuralSourceCount = hasVectorGeometry ? 1 : Number(Boolean(mask.sourceNodeId));
   const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'points')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:402:37
   }
   // A sourceNodeId may accompany a vector mask as optional visual content;
   // vectorMask remains the sole geometry source in that compatible form.
-  const hasVectorGeometry = Boolean(mask.vectorMask && mask.vectorMask.points.length > 0);
+  const hasVectorGeometry = Boolean(false);
   const structuralSourceCount = hasVectorGeometry ? 1 : Number(Boolean(mask.sourceNodeId));
   const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
killedBy: vector masks resolves vector mask without sourceNodeId
statusReason: expected null not to be null

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:404:23
   // vectorMask remains the sole geometry source in that compatible form.
   const hasVectorGeometry = Boolean(mask.vectorMask && mask.vectorMask.points.length > 0);
   const structuralSourceCount = hasVectorGeometry ? 1 : Number(Boolean(mask.sourceNodeId));
-  const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
+  const sourceCount = structuralSourceCount - Number(Boolean(mask.rasterMask));
   if (sourceCount !== 1) return 'A mask must define exactly one meaningful source';
   if (mask.rasterMask) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality
