[Killed] ConditionalExpression
packages/scene/src/masks.ts:405:7
   const hasVectorGeometry = Boolean(mask.vectorMask && mask.vectorMask.points.length > 0);
   const structuralSourceCount = hasVectorGeometry ? 1 : Number(Boolean(mask.sourceNodeId));
   const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
-  if (sourceCount !== 1) return 'A mask must define exactly one meaningful source';
+  if (false) return 'A mask must define exactly one meaningful source';
   if (mask.rasterMask) {
     if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
killedBy: native raster masks requires exactly one meaningful mask source
statusReason: .toMatch() expects to receive a string, but got object

[Killed] ConditionalExpression
packages/scene/src/masks.ts:405:7
   const hasVectorGeometry = Boolean(mask.vectorMask && mask.vectorMask.points.length > 0);
   const structuralSourceCount = hasVectorGeometry ? 1 : Number(Boolean(mask.sourceNodeId));
   const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
-  if (sourceCount !== 1) return 'A mask must define exactly one meaningful source';
+  if (true) return 'A mask must define exactly one meaningful source';
   if (mask.rasterMask) {
     if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:406:7
   const structuralSourceCount = hasVectorGeometry ? 1 : Number(Boolean(mask.sourceNodeId));
   const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
   if (sourceCount !== 1) return 'A mask must define exactly one meaningful source';
-  if (mask.rasterMask) {
+  if (false) {
     if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
     if (
killedBy: native raster masks only attaches raster masks to image-filled shapes with a resolved asset
statusReason: .toMatch() expects to receive a string, but got object

[Killed] ConditionalExpression
packages/scene/src/masks.ts:406:7
   const structuralSourceCount = hasVectorGeometry ? 1 : Number(Boolean(mask.sourceNodeId));
   const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
   if (sourceCount !== 1) return 'A mask must define exactly one meaningful source';
-  if (mask.rasterMask) {
+  if (true) {
     if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
     if (
killedBy: vector masks distinguishes vector geometry from an optional visual source node
statusReason: expected 'A raster mask must use alpha mask type' to be null

[Killed] EqualityOperator
packages/scene/src/masks.ts:407:9
   const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
   if (sourceCount !== 1) return 'A mask must define exactly one meaningful source';
   if (mask.rasterMask) {
-    if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
+    if (mask.type === 'alpha') return 'A raster mask must use alpha mask type';
     if (
       mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:407:9
   const sourceCount = structuralSourceCount + Number(Boolean(mask.rasterMask));
   if (sourceCount !== 1) return 'A mask must define exactly one meaningful source';
   if (mask.rasterMask) {
-    if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
+    if (true) return 'A raster mask must use alpha mask type';
     if (
       mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:409:7
   if (mask.rasterMask) {
     if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
     if (
-      mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
-      mask.rasterMask.coordinateSpace !== 'legacy-preview-pixels'
+      false
     ) {
       return 'A raster mask must use a supported pixel coordinate space';
killedBy: raster mask document boundary validation rejects untrusted raster.coordinateSpace metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:409:7
   if (mask.rasterMask) {
     if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
     if (
-      mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
-      mask.rasterMask.coordinateSpace !== 'legacy-preview-pixels'
+      true
     ) {
       return 'A raster mask must use a supported pixel coordinate space';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:410:7
     if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
     if (
       mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
-      mask.rasterMask.coordinateSpace !== 'legacy-preview-pixels'
+      true
     ) {
       return 'A raster mask must use a supported pixel coordinate space';
killedBy: raster mask document boundary validation decodes legacy preview dimensions from PNG IHDR without claiming source-pixel precision
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:410:7
     if (mask.type !== 'alpha') return 'A raster mask must use alpha mask type';
     if (
       mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
-      mask.rasterMask.coordinateSpace !== 'legacy-preview-pixels'
+      mask.rasterMask.coordinateSpace === 'legacy-preview-pixels'
     ) {
       return 'A raster mask must use a supported pixel coordinate space';
killedBy: raster mask document boundary validation rejects untrusted raster.coordinateSpace metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:411:7
     if (
       mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
       mask.rasterMask.coordinateSpace !== 'legacy-preview-pixels'
-    ) {
-      return 'A raster mask must use a supported pixel coordinate space';
-    }
+    ) {}
     if (
       mask.rasterMask.coordinateSpace === 'legacy-preview-pixels' &&
killedBy: raster mask document boundary validation rejects untrusted raster.coordinateSpace metadata
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:412:14
       mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
       mask.rasterMask.coordinateSpace !== 'legacy-preview-pixels'
     ) {
-      return 'A raster mask must use a supported pixel coordinate space';
+      return "";
     }
     if (
killedBy: raster mask document boundary validation rejects untrusted raster.coordinateSpace metadata
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:415:7
       return 'A raster mask must use a supported pixel coordinate space';
     }
     if (
-      mask.rasterMask.coordinateSpace === 'legacy-preview-pixels' &&
+      mask.rasterMask.coordinateSpace !== 'legacy-preview-pixels' &&
       (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
         mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:415:7
       return 'A raster mask must use a supported pixel coordinate space';
     }
     if (
-      mask.rasterMask.coordinateSpace === 'legacy-preview-pixels' &&
-      (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
-        mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
+      true
     ) {
       return 'A legacy preview raster mask must retain preview provenance and staleness';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:416:8
     }
     if (
       mask.rasterMask.coordinateSpace === 'legacy-preview-pixels' &&
-      (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
+      (mask.rasterMask.staleReason === 'legacy-preview-resolution' ||
         mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
     ) {
killedBy: raster mask document boundary validation decodes legacy preview dimensions from PNG IHDR without claiming source-pixel precision
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:416:8
     }
     if (
       mask.rasterMask.coordinateSpace === 'legacy-preview-pixels' &&
-      (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
-        mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
+      (true)
     ) {
       return 'A legacy preview raster mask must retain preview provenance and staleness';
killedBy: raster mask document boundary validation decodes legacy preview dimensions from PNG IHDR without claiming source-pixel precision
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:417:9
     if (
       mask.rasterMask.coordinateSpace === 'legacy-preview-pixels' &&
       (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
-        mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
+        mask.rasterMask.provenance?.origin === 'legacy-background-removal-preview')
     ) {
       return 'A legacy preview raster mask must retain preview provenance and staleness';
killedBy: raster mask document boundary validation decodes legacy preview dimensions from PNG IHDR without claiming source-pixel precision
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:417:9
     if (
       mask.rasterMask.coordinateSpace === 'legacy-preview-pixels' &&
       (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
-        mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
+        false)
     ) {
       return 'A legacy preview raster mask must retain preview provenance and staleness';

[NoCoverage] BlockStatement
packages/scene/src/masks.ts:418:7
       mask.rasterMask.coordinateSpace === 'legacy-preview-pixels' &&
       (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
         mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
-    ) {
-      return 'A legacy preview raster mask must retain preview provenance and staleness';
-    }
+    ) {}
     if (
       mask.rasterMask.coordinateSpace === 'source-image-pixels' &&

[NoCoverage] StringLiteral
packages/scene/src/masks.ts:419:14
       (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
         mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
     ) {
-      return 'A legacy preview raster mask must retain preview provenance and staleness';
+      return "";
     }
     if (

[Killed] EqualityOperator
packages/scene/src/masks.ts:422:7
       return 'A legacy preview raster mask must retain preview provenance and staleness';
     }
     if (
-      mask.rasterMask.coordinateSpace === 'source-image-pixels' &&
+      mask.rasterMask.coordinateSpace !== 'source-image-pixels' &&
       (mask.rasterMask.staleReason === 'legacy-preview-resolution' ||
         mask.rasterMask.provenance?.origin === 'legacy-background-removal-preview')
killedBy: raster mask document boundary validation rejects legacy-preview status on an exact source-pixel mask
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:422:7
       return 'A legacy preview raster mask must retain preview provenance and staleness';
     }
     if (
-      mask.rasterMask.coordinateSpace === 'source-image-pixels' &&
-      (mask.rasterMask.staleReason === 'legacy-preview-resolution' ||
-        mask.rasterMask.provenance?.origin === 'legacy-background-removal-preview')
+      true
     ) {
       return 'Legacy preview status requires the legacy preview coordinate space';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:423:8
     }
     if (
       mask.rasterMask.coordinateSpace === 'source-image-pixels' &&
-      (mask.rasterMask.staleReason === 'legacy-preview-resolution' ||
+      (mask.rasterMask.staleReason !== 'legacy-preview-resolution' ||
         mask.rasterMask.provenance?.origin === 'legacy-background-removal-preview')
     ) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:423:8
     }
     if (
       mask.rasterMask.coordinateSpace === 'source-image-pixels' &&
-      (mask.rasterMask.staleReason === 'legacy-preview-resolution' ||
-        mask.rasterMask.provenance?.origin === 'legacy-background-removal-preview')
+      (true)
     ) {
       return 'Legacy preview status requires the legacy preview coordinate space';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] OptionalChaining
packages/scene/src/masks.ts:424:9
     if (
       mask.rasterMask.coordinateSpace === 'source-image-pixels' &&
       (mask.rasterMask.staleReason === 'legacy-preview-resolution' ||
-        mask.rasterMask.provenance?.origin === 'legacy-background-removal-preview')
+        mask.rasterMask.provenance.origin === 'legacy-background-removal-preview')
     ) {
       return 'Legacy preview status requires the legacy preview coordinate space';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'origin')

[Killed] EqualityOperator
packages/scene/src/masks.ts:424:9
     if (
       mask.rasterMask.coordinateSpace === 'source-image-pixels' &&
       (mask.rasterMask.staleReason === 'legacy-preview-resolution' ||
-        mask.rasterMask.provenance?.origin === 'legacy-background-removal-preview')
+        mask.rasterMask.provenance?.origin !== 'legacy-background-removal-preview')
     ) {
       return 'Legacy preview status requires the legacy preview coordinate space';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:425:7
       mask.rasterMask.coordinateSpace === 'source-image-pixels' &&
       (mask.rasterMask.staleReason === 'legacy-preview-resolution' ||
         mask.rasterMask.provenance?.origin === 'legacy-background-removal-preview')
-    ) {
-      return 'Legacy preview status requires the legacy preview coordinate space';
-    }
+    ) {}
     if (
       typeof mask.rasterMask.assetId !== 'string' ||
killedBy: raster mask document boundary validation rejects legacy-preview status on an exact source-pixel mask
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:429:7
       return 'Legacy preview status requires the legacy preview coordinate space';
     }
     if (
-      typeof mask.rasterMask.assetId !== 'string' ||
-      !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
-      !mask.rasterMask.sourceIdentity
+      true
     ) {
       return 'A raster mask must identify its asset and source identity';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:429:7
       return 'Legacy preview status requires the legacy preview coordinate space';
     }
     if (
-      typeof mask.rasterMask.assetId !== 'string' ||
+      typeof mask.rasterMask.assetId === 'string' ||
       !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
       !mask.rasterMask.sourceIdentity
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:430:7
     }
     if (
       typeof mask.rasterMask.assetId !== 'string' ||
-      !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
+      ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
       !mask.rasterMask.sourceIdentity
     ) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:431:7
     if (
       typeof mask.rasterMask.assetId !== 'string' ||
       !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
-      !mask.rasterMask.sourceIdentity
+      mask.rasterMask.sourceIdentity
     ) {
       return 'A raster mask must identify its asset and source identity';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Survived] BlockStatement
packages/scene/src/masks.ts:432:7
       typeof mask.rasterMask.assetId !== 'string' ||
       !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
       !mask.rasterMask.sourceIdentity
-    ) {
-      return 'A raster mask must identify its asset and source identity';
-    }
+    ) {}
     const identityError = validateSourceIdentity(mask.rasterMask.sourceIdentity);
     if (identityError) return identityError;

[Survived] StringLiteral
packages/scene/src/masks.ts:433:14
       !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
       !mask.rasterMask.sourceIdentity
     ) {
-      return 'A raster mask must identify its asset and source identity';
+      return "";
     }
     const identityError = validateSourceIdentity(mask.rasterMask.sourceIdentity);

[Killed] ConditionalExpression
packages/scene/src/masks.ts:436:9
       return 'A raster mask must identify its asset and source identity';
     }
     const identityError = validateSourceIdentity(mask.rasterMask.sourceIdentity);
-    if (identityError) return identityError;
+    if (false) return identityError;
     if (
       mask.rasterMask.editRevision !== undefined &&
killedBy: raster mask document boundary validation rejects untrusted identity.revision metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:436:9
       return 'A raster mask must identify its asset and source identity';
     }
     const identityError = validateSourceIdentity(mask.rasterMask.sourceIdentity);
-    if (identityError) return identityError;
+    if (true) return identityError;
     if (
       mask.rasterMask.editRevision !== undefined &&
killedBy: native raster masks only attaches raster masks to image-filled shapes with a resolved asset
statusReason: .toMatch() expects to receive a string, but got object

[Killed] LogicalOperator
packages/scene/src/masks.ts:438:7
     const identityError = validateSourceIdentity(mask.rasterMask.sourceIdentity);
     if (identityError) return identityError;
     if (
-      mask.rasterMask.editRevision !== undefined &&
-      !isSafeNonnegativeInteger(mask.rasterMask.editRevision)
+      mask.rasterMask.editRevision !== undefined || !isSafeNonnegativeInteger(mask.rasterMask.editRevision)
     ) {
       return 'A raster mask edit revision must be a safe nonnegative integer';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:438:7
     const identityError = validateSourceIdentity(mask.rasterMask.sourceIdentity);
     if (identityError) return identityError;
     if (
-      mask.rasterMask.editRevision !== undefined &&
+      mask.rasterMask.editRevision === undefined &&
       !isSafeNonnegativeInteger(mask.rasterMask.editRevision)
     ) {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:439:7
     if (identityError) return identityError;
     if (
       mask.rasterMask.editRevision !== undefined &&
-      !isSafeNonnegativeInteger(mask.rasterMask.editRevision)
+      isSafeNonnegativeInteger(mask.rasterMask.editRevision)
     ) {
       return 'A raster mask edit revision must be a safe nonnegative integer';
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { Object (visible, inverted, ...) } to match object { Object (visible, inverted, ...) }

[Killed] BlockStatement
packages/scene/src/masks.ts:440:7
     if (
       mask.rasterMask.editRevision !== undefined &&
       !isSafeNonnegativeInteger(mask.rasterMask.editRevision)
-    ) {
-      return 'A raster mask edit revision must be a safe nonnegative integer';
-    }
+    ) {}
     if (
       mask.rasterMask.staleReason !== undefined &&
killedBy: raster mask document boundary validation rejects untrusted raster.editRevision metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:444:7
       return 'A raster mask edit revision must be a safe nonnegative integer';
     }
     if (
-      mask.rasterMask.staleReason !== undefined &&
-      !STALE_REASONS.includes(mask.rasterMask.staleReason)
+      false
     ) {
       return 'A raster mask stale reason is unsupported';
killedBy: raster mask document boundary validation rejects untrusted raster.staleReason metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:444:7
       return 'A raster mask edit revision must be a safe nonnegative integer';
     }
     if (
-      mask.rasterMask.staleReason !== undefined &&
-      !STALE_REASONS.includes(mask.rasterMask.staleReason)
+      true
     ) {
       return 'A raster mask stale reason is unsupported';
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:445:7
     }
     if (
       mask.rasterMask.staleReason !== undefined &&
-      !STALE_REASONS.includes(mask.rasterMask.staleReason)
+      STALE_REASONS.includes(mask.rasterMask.staleReason)
     ) {
       return 'A raster mask stale reason is unsupported';
killedBy: raster mask document boundary validation rejects untrusted raster.staleReason metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:446:7
     if (
       mask.rasterMask.staleReason !== undefined &&
       !STALE_REASONS.includes(mask.rasterMask.staleReason)
-    ) {
-      return 'A raster mask stale reason is unsupported';
-    }
+    ) {}
     if (mask.rasterMask.provenance !== undefined) {
       const provenanceError = validateProvenance(mask.rasterMask.provenance);
killedBy: raster mask document boundary validation rejects untrusted raster.staleReason metadata
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:447:14
       mask.rasterMask.staleReason !== undefined &&
       !STALE_REASONS.includes(mask.rasterMask.staleReason)
     ) {
-      return 'A raster mask stale reason is unsupported';
+      return "";
     }
     if (mask.rasterMask.provenance !== undefined) {
killedBy: raster mask document boundary validation rejects untrusted raster.staleReason metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:449:51
     ) {
       return 'A raster mask stale reason is unsupported';
     }
-    if (mask.rasterMask.provenance !== undefined) {
-      const provenanceError = validateProvenance(mask.rasterMask.provenance);
-      if (provenanceError) return provenanceError;
-    }
+    if (mask.rasterMask.provenance !== undefined) {}
     if (doc && !getOwnRasterMaskAsset(doc, mask.rasterMask.assetId)) {
       return `Missing raster mask asset ${mask.rasterMask.assetId}`;
killedBy: raster mask document boundary validation rejects untrusted raster.provenance metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:449:9
     ) {
       return 'A raster mask stale reason is unsupported';
     }
-    if (mask.rasterMask.provenance !== undefined) {
+    if (true) {
       const provenanceError = validateProvenance(mask.rasterMask.provenance);
       if (provenanceError) return provenanceError;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:451:11
     }
     if (mask.rasterMask.provenance !== undefined) {
       const provenanceError = validateProvenance(mask.rasterMask.provenance);
-      if (provenanceError) return provenanceError;
+      if (false) return provenanceError;
     }
     if (doc && !getOwnRasterMaskAsset(doc, mask.rasterMask.assetId)) {
killedBy: raster mask document boundary validation rejects untrusted raster.provenance metadata
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:451:11
     }
     if (mask.rasterMask.provenance !== undefined) {
       const provenanceError = validateProvenance(mask.rasterMask.provenance);
-      if (provenanceError) return provenanceError;
+      if (true) return provenanceError;
     }
     if (doc && !getOwnRasterMaskAsset(doc, mask.rasterMask.assetId)) {

[Killed] BooleanLiteral
packages/scene/src/masks.ts:453:16
       const provenanceError = validateProvenance(mask.rasterMask.provenance);
       if (provenanceError) return provenanceError;
     }
-    if (doc && !getOwnRasterMaskAsset(doc, mask.rasterMask.assetId)) {
+    if (doc && getOwnRasterMaskAsset(doc, mask.rasterMask.assetId)) {
       return `Missing raster mask asset ${mask.rasterMask.assetId}`;
     }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:453:9
       const provenanceError = validateProvenance(mask.rasterMask.provenance);
       if (provenanceError) return provenanceError;
     }
-    if (doc && !getOwnRasterMaskAsset(doc, mask.rasterMask.assetId)) {
+    if (doc || !getOwnRasterMaskAsset(doc, mask.rasterMask.assetId)) {
       return `Missing raster mask asset ${mask.rasterMask.assetId}`;
     }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:454:14
       if (provenanceError) return provenanceError;
     }
     if (doc && !getOwnRasterMaskAsset(doc, mask.rasterMask.assetId)) {
-      return `Missing raster mask asset ${mask.rasterMask.assetId}`;
+      return ``;
     }
   }
killedBy: native raster masks only attaches raster masks to image-filled shapes with a resolved asset
statusReason: expected '' to match /missing/i

[Killed] BlockStatement
packages/scene/src/masks.ts:462:45
 
 function knownIdentityDimensions(
   identity: RasterMaskSourceIdentity,
-): { width: number; height: number } | null {
-  return identity.pixelWidth !== undefined && identity.pixelHeight !== undefined
-    ? { width: identity.pixelWidth, height: identity.pixelHeight }
-    : null;
-}
+): { width: number; height: number } | null {}
 
 function knownOrientedSourceDimensions(
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:463:10
 function knownIdentityDimensions(
   identity: RasterMaskSourceIdentity,
 ): { width: number; height: number } | null {
-  return identity.pixelWidth !== undefined && identity.pixelHeight !== undefined
+  return false
     ? { width: identity.pixelWidth, height: identity.pixelHeight }
     : null;
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality
