[Killed] EqualityOperator
packages/scene/src/masks.ts:463:47
 function knownIdentityDimensions(
   identity: RasterMaskSourceIdentity,
 ): { width: number; height: number } | null {
-  return identity.pixelWidth !== undefined && identity.pixelHeight !== undefined
+  return identity.pixelWidth !== undefined && identity.pixelHeight === undefined
     ? { width: identity.pixelWidth, height: identity.pixelHeight }
     : null;
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
packages/scene/src/masks.ts:464:7
   identity: RasterMaskSourceIdentity,
 ): { width: number; height: number } | null {
   return identity.pixelWidth !== undefined && identity.pixelHeight !== undefined
-    ? { width: identity.pixelWidth, height: identity.pixelHeight }
+    ? {}
     : null;
 }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:471:45
 function knownOrientedSourceDimensions(
   doc: Document,
   node: SceneNode,
-): { width: number; height: number } | null {
-  const image = resolvedImageFill(doc, node);
-  return image &&
-    Number.isInteger(image.imageWidth) &&
-    Number.isInteger(image.imageHeight) &&
-    image.imageWidth! > 0 &&
-    image.imageHeight! > 0
-    ? { width: image.imageWidth!, height: image.imageHeight! }
-    : null;
-}
+): { width: number; height: number } | null {}
 
 function validateSourcePixelDimensions(
killedBy: raster mask document boundary validation rejects exact source-pixel masks that do not match known oriented source dimensions
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:473:10
   node: SceneNode,
 ): { width: number; height: number } | null {
   const image = resolvedImageFill(doc, node);
-  return image &&
-    Number.isInteger(image.imageWidth) &&
-    Number.isInteger(image.imageHeight) &&
-    image.imageWidth! > 0 &&
-    image.imageHeight! > 0
+  return false
     ? { width: image.imageWidth!, height: image.imageHeight! }
     : null;
killedBy: raster mask document boundary validation rejects exact source-pixel masks that do not match known oriented source dimensions
statusReason: expected true to be false // Object.is equality

[Survived] LogicalOperator
packages/scene/src/masks.ts:473:10
   node: SceneNode,
 ): { width: number; height: number } | null {
   const image = resolvedImageFill(doc, node);
-  return image &&
-    Number.isInteger(image.imageWidth) &&
-    Number.isInteger(image.imageHeight) &&
-    image.imageWidth! > 0 &&
+  return image && Number.isInteger(image.imageWidth) && Number.isInteger(image.imageHeight) || image.imageWidth! > 0 &&
     image.imageHeight! > 0
     ? { width: image.imageWidth!, height: image.imageHeight! }

[Killed] EqualityOperator
packages/scene/src/masks.ts:476:5
   return image &&
     Number.isInteger(image.imageWidth) &&
     Number.isInteger(image.imageHeight) &&
-    image.imageWidth! > 0 &&
+    image.imageWidth! <= 0 &&
     image.imageHeight! > 0
     ? { width: image.imageWidth!, height: image.imageHeight! }
killedBy: raster mask document boundary validation rejects exact source-pixel masks that do not match known oriented source dimensions
statusReason: expected true to be false // Object.is equality

[Survived] EqualityOperator
packages/scene/src/masks.ts:476:5
   return image &&
     Number.isInteger(image.imageWidth) &&
     Number.isInteger(image.imageHeight) &&
-    image.imageWidth! > 0 &&
+    image.imageWidth! >= 0 &&
     image.imageHeight! > 0
     ? { width: image.imageWidth!, height: image.imageHeight! }

[Killed] EqualityOperator
packages/scene/src/masks.ts:477:5
     Number.isInteger(image.imageWidth) &&
     Number.isInteger(image.imageHeight) &&
     image.imageWidth! > 0 &&
-    image.imageHeight! > 0
+    image.imageHeight! <= 0
     ? { width: image.imageWidth!, height: image.imageHeight! }
     : null;
killedBy: raster mask document boundary validation rejects exact source-pixel masks that do not match known oriented source dimensions
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:477:5
     Number.isInteger(image.imageWidth) &&
     Number.isInteger(image.imageHeight) &&
     image.imageWidth! > 0 &&
-    image.imageHeight! > 0
+    true
     ? { width: image.imageWidth!, height: image.imageHeight! }
     : null;

[Killed] BlockStatement
packages/scene/src/masks.ts:487:18
   node: SceneNode,
   rasterMask: RasterMaskData,
   asset: RasterMaskAsset,
-): string | null {
-  if (rasterMask.coordinateSpace !== 'source-image-pixels') return null;
-  const identityDimensions = knownIdentityDimensions(rasterMask.sourceIdentity);
-  if (
-    identityDimensions &&
-    (asset.width !== identityDimensions.width || asset.height !== identityDimensions.height)
-  ) {
-    return `${node.id}: Raster mask source identity dimensions must match its asset dimensions`;
-  }
-  const sourceDimensions = knownOrientedSourceDimensions(doc, node);
-  if (
-    sourceDimensions &&
-    (asset.width !== sourceDimensions.width || asset.height !== sourceDimensions.height)
-  ) {
-    return `${node.id}: Raster mask dimensions must match the oriented source dimensions`;
-  }
-  return null;
-}
+): string | null {}
 
 /** Validate every mask source and document-owned raster payload. */
killedBy: native raster masks rejects source-pixel assets that differ from known oriented source dimensions
statusReason: expected { …(8) } to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:488:7
   rasterMask: RasterMaskData,
   asset: RasterMaskAsset,
 ): string | null {
-  if (rasterMask.coordinateSpace !== 'source-image-pixels') return null;
+  if (true) return null;
   const identityDimensions = knownIdentityDimensions(rasterMask.sourceIdentity);
   if (
killedBy: native raster masks rejects source-pixel assets that differ from known oriented source dimensions
statusReason: expected { …(8) } to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:488:7
   rasterMask: RasterMaskData,
   asset: RasterMaskAsset,
 ): string | null {
-  if (rasterMask.coordinateSpace !== 'source-image-pixels') return null;
+  if (rasterMask.coordinateSpace === 'source-image-pixels') return null;
   const identityDimensions = knownIdentityDimensions(rasterMask.sourceIdentity);
   if (
killedBy: native raster masks rejects source-pixel assets that differ from known oriented source dimensions
statusReason: expected { …(8) } to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:491:5
   if (rasterMask.coordinateSpace !== 'source-image-pixels') return null;
   const identityDimensions = knownIdentityDimensions(rasterMask.sourceIdentity);
   if (
-    identityDimensions &&
-    (asset.width !== identityDimensions.width || asset.height !== identityDimensions.height)
+    false
   ) {
     return `${node.id}: Raster mask source identity dimensions must match its asset dimensions`;
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:491:5
   if (rasterMask.coordinateSpace !== 'source-image-pixels') return null;
   const identityDimensions = knownIdentityDimensions(rasterMask.sourceIdentity);
   if (
-    identityDimensions &&
-    (asset.width !== identityDimensions.width || asset.height !== identityDimensions.height)
+    identityDimensions || asset.width !== identityDimensions.width || asset.height !== identityDimensions.height
   ) {
     return `${node.id}: Raster mask source identity dimensions must match its asset dimensions`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:492:6
   const identityDimensions = knownIdentityDimensions(rasterMask.sourceIdentity);
   if (
     identityDimensions &&
-    (asset.width !== identityDimensions.width || asset.height !== identityDimensions.height)
+    (true)
   ) {
     return `${node.id}: Raster mask source identity dimensions must match its asset dimensions`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:492:6
   const identityDimensions = knownIdentityDimensions(rasterMask.sourceIdentity);
   if (
     identityDimensions &&
-    (asset.width !== identityDimensions.width || asset.height !== identityDimensions.height)
+    (asset.width === identityDimensions.width || asset.height !== identityDimensions.height)
   ) {
     return `${node.id}: Raster mask source identity dimensions must match its asset dimensions`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:493:5
   if (
     identityDimensions &&
     (asset.width !== identityDimensions.width || asset.height !== identityDimensions.height)
-  ) {
-    return `${node.id}: Raster mask source identity dimensions must match its asset dimensions`;
-  }
+  ) {}
   const sourceDimensions = knownOrientedSourceDimensions(doc, node);
   if (
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:494:12
     identityDimensions &&
     (asset.width !== identityDimensions.width || asset.height !== identityDimensions.height)
   ) {
-    return `${node.id}: Raster mask source identity dimensions must match its asset dimensions`;
+    return ``;
   }
   const sourceDimensions = knownOrientedSourceDimensions(doc, node);
killedBy: native raster masks rejects source-pixel assets that differ from known oriented source dimensions
statusReason: expected { …(8) } to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:498:5
   }
   const sourceDimensions = knownOrientedSourceDimensions(doc, node);
   if (
-    sourceDimensions &&
-    (asset.width !== sourceDimensions.width || asset.height !== sourceDimensions.height)
+    false
   ) {
     return `${node.id}: Raster mask dimensions must match the oriented source dimensions`;
killedBy: raster mask document boundary validation rejects exact source-pixel masks that do not match known oriented source dimensions
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:498:5
   }
   const sourceDimensions = knownOrientedSourceDimensions(doc, node);
   if (
-    sourceDimensions &&
-    (asset.width !== sourceDimensions.width || asset.height !== sourceDimensions.height)
+    true
   ) {
     return `${node.id}: Raster mask dimensions must match the oriented source dimensions`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:499:6
   const sourceDimensions = knownOrientedSourceDimensions(doc, node);
   if (
     sourceDimensions &&
-    (asset.width !== sourceDimensions.width || asset.height !== sourceDimensions.height)
+    (asset.width === sourceDimensions.width || asset.height !== sourceDimensions.height)
   ) {
     return `${node.id}: Raster mask dimensions must match the oriented source dimensions`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:499:6
   const sourceDimensions = knownOrientedSourceDimensions(doc, node);
   if (
     sourceDimensions &&
-    (asset.width !== sourceDimensions.width || asset.height !== sourceDimensions.height)
+    (true)
   ) {
     return `${node.id}: Raster mask dimensions must match the oriented source dimensions`;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:500:5
   if (
     sourceDimensions &&
     (asset.width !== sourceDimensions.width || asset.height !== sourceDimensions.height)
-  ) {
-    return `${node.id}: Raster mask dimensions must match the oriented source dimensions`;
-  }
+  ) {}
   return null;
 }
killedBy: raster mask document boundary validation rejects exact source-pixel masks that do not match known oriented source dimensions
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:511:8
   for (const [tableKey, asset] of Object.entries(doc.rasterMaskAssets ?? {}) as [
     string,
     unknown,
-  ][]) {
-    const error = validateRasterMaskAsset(asset as RasterMaskAsset);
-    if (error) return error;
-    if ((asset as RasterMaskAsset).id !== tableKey) {
-      return `Raster mask asset table key ${tableKey} must match asset id`;
-    }
-  }
+  ][]) {}
   for (const nodeValue of Object.values(doc.nodes) as unknown[]) {
     if (!isRecord(nodeValue)) return 'Document node must be an object';
killedBy: raster mask document boundary validation rejects untrusted asset.id metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:513:9
     unknown,
   ][]) {
     const error = validateRasterMaskAsset(asset as RasterMaskAsset);
-    if (error) return error;
+    if (false) return error;
     if ((asset as RasterMaskAsset).id !== tableKey) {
       return `Raster mask asset table key ${tableKey} must match asset id`;
killedBy: raster mask document boundary validation rejects untrusted asset.checksum metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:513:9
     unknown,
   ][]) {
     const error = validateRasterMaskAsset(asset as RasterMaskAsset);
-    if (error) return error;
+    if (true) return error;
     if ((asset as RasterMaskAsset).id !== tableKey) {
       return `Raster mask asset table key ${tableKey} must match asset id`;
killedBy: raster mask document boundary validation rejects untrusted asset.id metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:514:9
   ][]) {
     const error = validateRasterMaskAsset(asset as RasterMaskAsset);
     if (error) return error;
-    if ((asset as RasterMaskAsset).id !== tableKey) {
+    if (false) {
       return `Raster mask asset table key ${tableKey} must match asset id`;
     }
killedBy: raster mask document boundary validation rejects untrusted asset.id metadata
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:514:53
   ][]) {
     const error = validateRasterMaskAsset(asset as RasterMaskAsset);
     if (error) return error;
-    if ((asset as RasterMaskAsset).id !== tableKey) {
-      return `Raster mask asset table key ${tableKey} must match asset id`;
-    }
+    if ((asset as RasterMaskAsset).id !== tableKey) {}
   }
   for (const nodeValue of Object.values(doc.nodes) as unknown[]) {
killedBy: raster mask document boundary validation rejects untrusted asset.id metadata
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:515:14
     const error = validateRasterMaskAsset(asset as RasterMaskAsset);
     if (error) return error;
     if ((asset as RasterMaskAsset).id !== tableKey) {
-      return `Raster mask asset table key ${tableKey} must match asset id`;
+      return ``;
     }
   }
killedBy: raster mask document boundary validation rejects untrusted asset.id metadata
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:519:9
     }
   }
   for (const nodeValue of Object.values(doc.nodes) as unknown[]) {
-    if (!isRecord(nodeValue)) return 'Document node must be an object';
+    if (true) return 'Document node must be an object';
     const node = nodeValue as unknown as SceneNode;
     if ('fills' in nodeValue && nodeValue.fills !== undefined && !Array.isArray(nodeValue.fills)) {
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:519:9
     }
   }
   for (const nodeValue of Object.values(doc.nodes) as unknown[]) {
-    if (!isRecord(nodeValue)) return 'Document node must be an object';
+    if (isRecord(nodeValue)) return 'Document node must be an object';
     const node = nodeValue as unknown as SceneNode;
     if ('fills' in nodeValue && nodeValue.fills !== undefined && !Array.isArray(nodeValue.fills)) {
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:521:9
   for (const nodeValue of Object.values(doc.nodes) as unknown[]) {
     if (!isRecord(nodeValue)) return 'Document node must be an object';
     const node = nodeValue as unknown as SceneNode;
-    if ('fills' in nodeValue && nodeValue.fills !== undefined && !Array.isArray(nodeValue.fills)) {
+    if (true) {
       return `${String(nodeValue.id)}: fills must be an array`;
     }
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:521:9
   for (const nodeValue of Object.values(doc.nodes) as unknown[]) {
     if (!isRecord(nodeValue)) return 'Document node must be an object';
     const node = nodeValue as unknown as SceneNode;
-    if ('fills' in nodeValue && nodeValue.fills !== undefined && !Array.isArray(nodeValue.fills)) {
+    if (true && !Array.isArray(nodeValue.fills)) {
       return `${String(nodeValue.id)}: fills must be an array`;
     }
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:524:35
     if ('fills' in nodeValue && nodeValue.fills !== undefined && !Array.isArray(nodeValue.fills)) {
       return `${String(nodeValue.id)}: fills must be an array`;
     }
-    if (!('mask' in nodeValue) || nodeValue.mask === undefined) continue;
+    if (!('mask' in nodeValue) || nodeValue.mask !== undefined) continue;
     if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
     if ('vectorMask' in node.mask) {
killedBy: raster mask document boundary validation rejects an inherited toString asset reference during decode
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:524:9
     if ('fills' in nodeValue && nodeValue.fills !== undefined && !Array.isArray(nodeValue.fills)) {
       return `${String(nodeValue.id)}: fills must be an array`;
     }
-    if (!('mask' in nodeValue) || nodeValue.mask === undefined) continue;
+    if (true) continue;
     if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
     if ('vectorMask' in node.mask) {
killedBy: raster mask document boundary validation rejects an inherited toString asset reference during decode
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:525:9
       return `${String(nodeValue.id)}: fills must be an array`;
     }
     if (!('mask' in nodeValue) || nodeValue.mask === undefined) continue;
-    if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
+    if (isRecord(node.mask)) return `${node.id}: Mask must be an object`;
     if ('vectorMask' in node.mask) {
       if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:525:9
       return `${String(nodeValue.id)}: fills must be an array`;
     }
     if (!('mask' in nodeValue) || nodeValue.mask === undefined) continue;
-    if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
+    if (true) return `${node.id}: Mask must be an object`;
     if ('vectorMask' in node.mask) {
       if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:526:9
     }
     if (!('mask' in nodeValue) || nodeValue.mask === undefined) continue;
     if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
-    if ('vectorMask' in node.mask) {
+    if (true) {
       if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
       if (!Array.isArray(node.mask.vectorMask.points)) {
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
packages/scene/src/masks.ts:526:36
     }
     if (!('mask' in nodeValue) || nodeValue.mask === undefined) continue;
     if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
-    if ('vectorMask' in node.mask) {
-      if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
-      if (!Array.isArray(node.mask.vectorMask.points)) {
-        return `${node.id}: vectorMask.points must be an array`;
-      }
-    }
+    if ('vectorMask' in node.mask) {}
     if ('rasterMask' in node.mask && !isRecord(node.mask.rasterMask)) {
       return `${node.id}: rasterMask must be an object`;

[Survived] ConditionalExpression
packages/scene/src/masks.ts:527:11
     if (!('mask' in nodeValue) || nodeValue.mask === undefined) continue;
     if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
     if ('vectorMask' in node.mask) {
-      if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
+      if (true) return `${node.id}: vectorMask must be an object`;
       if (!Array.isArray(node.mask.vectorMask.points)) {
         return `${node.id}: vectorMask.points must be an array`;

[Survived] BooleanLiteral
packages/scene/src/masks.ts:527:11
     if (!('mask' in nodeValue) || nodeValue.mask === undefined) continue;
     if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
     if ('vectorMask' in node.mask) {
-      if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
+      if (isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
       if (!Array.isArray(node.mask.vectorMask.points)) {
         return `${node.id}: vectorMask.points must be an array`;

[Survived] ConditionalExpression
packages/scene/src/masks.ts:528:11
     if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
     if ('vectorMask' in node.mask) {
       if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
-      if (!Array.isArray(node.mask.vectorMask.points)) {
+      if (false) {
         return `${node.id}: vectorMask.points must be an array`;
       }

[Survived] BlockStatement
packages/scene/src/masks.ts:528:56
     if (!isRecord(node.mask)) return `${node.id}: Mask must be an object`;
     if ('vectorMask' in node.mask) {
       if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
-      if (!Array.isArray(node.mask.vectorMask.points)) {
-        return `${node.id}: vectorMask.points must be an array`;
-      }
+      if (!Array.isArray(node.mask.vectorMask.points)) {}
     }
     if ('rasterMask' in node.mask && !isRecord(node.mask.rasterMask)) {

[Killed] StringLiteral
packages/scene/src/masks.ts:529:16
     if ('vectorMask' in node.mask) {
       if (!isRecord(node.mask.vectorMask)) return `${node.id}: vectorMask must be an object`;
       if (!Array.isArray(node.mask.vectorMask.points)) {
-        return `${node.id}: vectorMask.points must be an array`;
+        return ``;
       }
     }
killedBy: raster mask document boundary validation returns a decode error without throwing for nested malformed empty vector mask
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
packages/scene/src/masks.ts:532:38
         return `${node.id}: vectorMask.points must be an array`;
       }
     }
-    if ('rasterMask' in node.mask && !isRecord(node.mask.rasterMask)) {
+    if ('rasterMask' in node.mask && isRecord(node.mask.rasterMask)) {
       return `${node.id}: rasterMask must be an object`;
     }
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:532:9
         return `${node.id}: vectorMask.points must be an array`;
       }
     }
-    if ('rasterMask' in node.mask && !isRecord(node.mask.rasterMask)) {
+    if ('rasterMask' in node.mask || !isRecord(node.mask.rasterMask)) {
       return `${node.id}: rasterMask must be an object`;
     }
killedBy: DocumentCodec repairs dangling and unsupported clipping relationships without losing children
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
packages/scene/src/masks.ts:533:14
       }
     }
     if ('rasterMask' in node.mask && !isRecord(node.mask.rasterMask)) {
-      return `${node.id}: rasterMask must be an object`;
+      return ``;
     }
     const error = validateMaskSource(doc, node.mask);
killedBy: raster mask document boundary validation returns a decode error without throwing for nested malformed primitive raster mask
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:536:9
       return `${node.id}: rasterMask must be an object`;
     }
     const error = validateMaskSource(doc, node.mask);
-    if (error) return `${node.id}: ${error}`;
+    if (false) return `${node.id}: ${error}`;
     if (node.mask.rasterMask && !isImageShape(doc, node)) {
       return `${node.id}: Raster masks may only attach to image-filled shape nodes`;
killedBy: raster mask document boundary validation rejects an inherited toString asset reference during decode
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:536:9
       return `${node.id}: rasterMask must be an object`;
     }
     const error = validateMaskSource(doc, node.mask);
-    if (error) return `${node.id}: ${error}`;
+    if (true) return `${node.id}: ${error}`;
     if (node.mask.rasterMask && !isImageShape(doc, node)) {
       return `${node.id}: Raster masks may only attach to image-filled shape nodes`;
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:537:33
     }
     const error = validateMaskSource(doc, node.mask);
     if (error) return `${node.id}: ${error}`;
-    if (node.mask.rasterMask && !isImageShape(doc, node)) {
+    if (node.mask.rasterMask && isImageShape(doc, node)) {
       return `${node.id}: Raster masks may only attach to image-filled shape nodes`;
     }
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:537:9
     }
     const error = validateMaskSource(doc, node.mask);
     if (error) return `${node.id}: ${error}`;
-    if (node.mask.rasterMask && !isImageShape(doc, node)) {
+    if (true) {
       return `${node.id}: Raster masks may only attach to image-filled shape nodes`;
     }
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected false to be true // Object.is equality
