[Killed] BlockStatement
packages/scene/src/masks.ts:540:31
     if (node.mask.rasterMask && !isImageShape(doc, node)) {
       return `${node.id}: Raster masks may only attach to image-filled shape nodes`;
     }
-    if (node.mask.rasterMask) {
-      const asset = getOwnRasterMaskAsset(doc, node.mask.rasterMask.assetId);
-      if (asset) {
-        const dimensionError = validateSourcePixelDimensions(
-          doc,
-          node,
-          node.mask.rasterMask,
-          asset,
-        );
-        if (dimensionError) return dimensionError;
-      }
-    }
+    if (node.mask.rasterMask) {}
   }
   return null;
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:540:9
     if (node.mask.rasterMask && !isImageShape(doc, node)) {
       return `${node.id}: Raster masks may only attach to image-filled shape nodes`;
     }
-    if (node.mask.rasterMask) {
+    if (false) {
       const asset = getOwnRasterMaskAsset(doc, node.mask.rasterMask.assetId);
       if (asset) {
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:542:11
     }
     if (node.mask.rasterMask) {
       const asset = getOwnRasterMaskAsset(doc, node.mask.rasterMask.assetId);
-      if (asset) {
+      if (false) {
         const dimensionError = validateSourcePixelDimensions(
           doc,
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:542:18
     }
     if (node.mask.rasterMask) {
       const asset = getOwnRasterMaskAsset(doc, node.mask.rasterMask.assetId);
-      if (asset) {
-        const dimensionError = validateSourcePixelDimensions(
-          doc,
-          node,
-          node.mask.rasterMask,
-          asset,
-        );
-        if (dimensionError) return dimensionError;
-      }
+      if (asset) {}
     }
   }
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:549:13
           node.mask.rasterMask,
           asset,
         );
-        if (dimensionError) return dimensionError;
+        if (false) return dimensionError;
       }
     }
killedBy: raster mask document boundary validation rejects source identities whose dimensions disagree with the source-space asset
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:549:13
           node.mask.rasterMask,
           asset,
         );
-        if (dimensionError) return dimensionError;
+        if (true) return dimensionError;
       }
     }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:560:7
 
 /** Return the effective mask for a container or eligible image leaf. */
 export function resolveMask(node: SceneNode, doc?: Pick<Document, 'paints'>): Mask | null {
-  if (!node.mask || node.mask.visible === false) return null;
+  if (false) return null;
   if (node.kind === 'shape' && node.mask.rasterMask && isImageShape(doc ?? {}, node)) {
     return validateMaskSource(undefined, node.mask) ? null : node.mask;
killedBy: vector masks rejects an empty vector mask because it has no meaningful geometry
statusReason: Cannot read properties of undefined (reading 'rasterMask')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:560:7
 
 /** Return the effective mask for a container or eligible image leaf. */
 export function resolveMask(node: SceneNode, doc?: Pick<Document, 'paints'>): Mask | null {
-  if (!node.mask || node.mask.visible === false) return null;
+  if (true) return null;
   if (node.kind === 'shape' && node.mask.rasterMask && isImageShape(doc ?? {}, node)) {
     return validateMaskSource(undefined, node.mask) ? null : node.mask;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected null to deeply equal { type: 'alpha', visible: true, …(1) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:561:7
 /** Return the effective mask for a container or eligible image leaf. */
 export function resolveMask(node: SceneNode, doc?: Pick<Document, 'paints'>): Mask | null {
   if (!node.mask || node.mask.visible === false) return null;
-  if (node.kind === 'shape' && node.mask.rasterMask && isImageShape(doc ?? {}, node)) {
+  if (true) {
     return validateMaskSource(undefined, node.mask) ? null : node.mask;
   }
killedBy: resolveMask returns null when mask source node is no longer a child
statusReason: expected { type: 'clip', …(2) } to be null

[Killed] ConditionalExpression
packages/scene/src/masks.ts:561:7
 /** Return the effective mask for a container or eligible image leaf. */
 export function resolveMask(node: SceneNode, doc?: Pick<Document, 'paints'>): Mask | null {
   if (!node.mask || node.mask.visible === false) return null;
-  if (node.kind === 'shape' && node.mask.rasterMask && isImageShape(doc ?? {}, node)) {
+  if (false) {
     return validateMaskSource(undefined, node.mask) ? null : node.mask;
   }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected null to deeply equal { type: 'alpha', visible: true, …(1) }

[Killed] EqualityOperator
packages/scene/src/masks.ts:564:7
   if (node.kind === 'shape' && node.mask.rasterMask && isImageShape(doc ?? {}, node)) {
     return validateMaskSource(undefined, node.mask) ? null : node.mask;
   }
-  if (node.kind !== 'frame' && node.kind !== 'group' && node.kind !== 'adjustment') return null;
+  if (node.kind === 'frame' && node.kind !== 'group' && node.kind !== 'adjustment') return null;
   const container = node as SceneNode & { children?: string[] };
   if (validateMaskSource(undefined, node.mask)) return null;
killedBy: resolveMask returns mask when set on frame with valid child
statusReason: expected null not to be null

[Killed] ConditionalExpression
packages/scene/src/masks.ts:564:32
   if (node.kind === 'shape' && node.mask.rasterMask && isImageShape(doc ?? {}, node)) {
     return validateMaskSource(undefined, node.mask) ? null : node.mask;
   }
-  if (node.kind !== 'frame' && node.kind !== 'group' && node.kind !== 'adjustment') return null;
+  if (node.kind !== 'frame' && true && node.kind !== 'adjustment') return null;
   const container = node as SceneNode & { children?: string[] };
   if (validateMaskSource(undefined, node.mask)) return null;
killedBy: resolveMask returns mask for groups with mask
statusReason: expected null not to be null

[Killed] ConditionalExpression
packages/scene/src/masks.ts:566:7
   }
   if (node.kind !== 'frame' && node.kind !== 'group' && node.kind !== 'adjustment') return null;
   const container = node as SceneNode & { children?: string[] };
-  if (validateMaskSource(undefined, node.mask)) return null;
+  if (true) return null;
   // Vector masks don't require a sourceNodeId
   if (node.mask.vectorMask && node.mask.vectorMask.points.length > 0) {
killedBy: resolveMask returns mask when set on frame with valid child
statusReason: expected null not to be null

[Survived] ConditionalExpression
packages/scene/src/masks.ts:566:7
   }
   if (node.kind !== 'frame' && node.kind !== 'group' && node.kind !== 'adjustment') return null;
   const container = node as SceneNode & { children?: string[] };
-  if (validateMaskSource(undefined, node.mask)) return null;
+  if (false) return null;
   // Vector masks don't require a sourceNodeId
   if (node.mask.vectorMask && node.mask.vectorMask.points.length > 0) {

[Killed] EqualityOperator
packages/scene/src/masks.ts:568:31
   const container = node as SceneNode & { children?: string[] };
   if (validateMaskSource(undefined, node.mask)) return null;
   // Vector masks don't require a sourceNodeId
-  if (node.mask.vectorMask && node.mask.vectorMask.points.length > 0) {
+  if (node.mask.vectorMask && node.mask.vectorMask.points.length <= 0) {
     return node.mask;
   }
killedBy: vector masks resolves vector mask without sourceNodeId
statusReason: expected null not to be null

[Killed] LogicalOperator
packages/scene/src/masks.ts:568:7
   const container = node as SceneNode & { children?: string[] };
   if (validateMaskSource(undefined, node.mask)) return null;
   // Vector masks don't require a sourceNodeId
-  if (node.mask.vectorMask && node.mask.vectorMask.points.length > 0) {
+  if (node.mask.vectorMask || node.mask.vectorMask.points.length > 0) {
     return node.mask;
   }
killedBy: resolveMask returns mask when set on frame with valid child
statusReason: Cannot read properties of undefined (reading 'points')

[Killed] BlockStatement
packages/scene/src/masks.ts:572:31
     return node.mask;
   }
   // For frames and groups with sourceNodeId, the mask source must be a child.
-  if (node.mask.sourceNodeId) {
-    if (
-      node.kind !== 'adjustment' &&
-      container.children &&
-      !container.children.includes(node.mask.sourceNodeId)
-    ) {
-      return null;
-    }
-    return node.mask;
-  }
+  if (node.mask.sourceNodeId) {}
   // Mask has neither vectorMask nor sourceNodeId — incomplete
   return null;
killedBy: resolveMask returns mask when set on frame with valid child
statusReason: expected null not to be null

[Killed] ConditionalExpression
packages/scene/src/masks.ts:572:7
     return node.mask;
   }
   // For frames and groups with sourceNodeId, the mask source must be a child.
-  if (node.mask.sourceNodeId) {
+  if (false) {
     if (
       node.kind !== 'adjustment' &&
killedBy: resolveMask returns mask when set on frame with valid child
statusReason: expected null not to be null

[Killed] ConditionalExpression
packages/scene/src/masks.ts:574:7
   // For frames and groups with sourceNodeId, the mask source must be a child.
   if (node.mask.sourceNodeId) {
     if (
-      node.kind !== 'adjustment' &&
-      container.children &&
-      !container.children.includes(node.mask.sourceNodeId)
+      false
     ) {
       return null;
killedBy: resolveMask returns null when mask source node is no longer a child
statusReason: expected { type: 'clip', …(2) } to be null

[Killed] EqualityOperator
packages/scene/src/masks.ts:574:7
   // For frames and groups with sourceNodeId, the mask source must be a child.
   if (node.mask.sourceNodeId) {
     if (
-      node.kind !== 'adjustment' &&
+      node.kind === 'adjustment' &&
       container.children &&
       !container.children.includes(node.mask.sourceNodeId)
killedBy: resolveMask returns null when mask source node is no longer a child
statusReason: expected { type: 'clip', …(2) } to be null

[Killed] BooleanLiteral
packages/scene/src/masks.ts:576:7
     if (
       node.kind !== 'adjustment' &&
       container.children &&
-      !container.children.includes(node.mask.sourceNodeId)
+      container.children.includes(node.mask.sourceNodeId)
     ) {
       return null;
killedBy: resolveMask returns mask when set on frame with valid child
statusReason: expected null not to be null

[Killed] BlockStatement
packages/scene/src/masks.ts:577:7
       node.kind !== 'adjustment' &&
       container.children &&
       !container.children.includes(node.mask.sourceNodeId)
-    ) {
-      return null;
-    }
+    ) {}
     return node.mask;
   }
killedBy: resolveMask returns null when mask source node is no longer a child
statusReason: expected { type: 'clip', …(2) } to be null

[Killed] BlockStatement
packages/scene/src/masks.ts:590:27
 export function resolveRasterMaskAsset(
   doc: Pick<Document, 'paints' | 'rasterMaskAssets'>,
   node: SceneNode,
-): RasterMaskAsset | null {
-  const mask = node.mask;
-  if (
-    !mask?.rasterMask ||
-    mask.type !== 'alpha' ||
-    mask.visible === false ||
-    'sourceNodeId' in mask ||
-    'vectorMask' in mask ||
-    !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
-    !isImageShape(doc, node)
-  ) {
-    return null;
-  }
-  return getOwnRasterMaskAsset(doc, mask.rasterMask.assetId) ?? null;
-}
+): RasterMaskAsset | null {}
 
 /** True if the container has an active (visible, valid) mask. */
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected undefined to deeply equal { id: 'mask-1', …(5) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:593:5
 ): RasterMaskAsset | null {
   const mask = node.mask;
   if (
-    !mask?.rasterMask ||
-    mask.type !== 'alpha' ||
-    mask.visible === false ||
-    'sourceNodeId' in mask ||
-    'vectorMask' in mask ||
-    !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
-    !isImageShape(doc, node)
+    false
   ) {
     return null;
killedBy: native raster masks rejects raster masks for a missing paint reference
statusReason: expected { id: 'mask-1', …(5) } to be null

[Killed] BooleanLiteral
packages/scene/src/masks.ts:593:5
 ): RasterMaskAsset | null {
   const mask = node.mask;
   if (
-    !mask?.rasterMask ||
+    mask?.rasterMask ||
     mask.type !== 'alpha' ||
     mask.visible === false ||
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected null to deeply equal { id: 'mask-1', …(5) }

[Killed] EqualityOperator
packages/scene/src/masks.ts:594:5
   const mask = node.mask;
   if (
     !mask?.rasterMask ||
-    mask.type !== 'alpha' ||
+    mask.type === 'alpha' ||
     mask.visible === false ||
     'sourceNodeId' in mask ||
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected null to deeply equal { id: 'mask-1', …(5) }

[Survived] ConditionalExpression
packages/scene/src/masks.ts:594:5
   const mask = node.mask;
   if (
     !mask?.rasterMask ||
-    mask.type !== 'alpha' ||
+    false ||
     mask.visible === false ||
     'sourceNodeId' in mask ||

[Killed] EqualityOperator
packages/scene/src/masks.ts:595:5
   if (
     !mask?.rasterMask ||
     mask.type !== 'alpha' ||
-    mask.visible === false ||
+    mask.visible !== false ||
     'sourceNodeId' in mask ||
     'vectorMask' in mask ||
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected null to deeply equal { id: 'mask-1', …(5) }

[Killed] BooleanLiteral
packages/scene/src/masks.ts:595:22
   if (
     !mask?.rasterMask ||
     mask.type !== 'alpha' ||
-    mask.visible === false ||
+    mask.visible === true ||
     'sourceNodeId' in mask ||
     'vectorMask' in mask ||
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected null to deeply equal { id: 'mask-1', …(5) }

[Survived] StringLiteral
packages/scene/src/masks.ts:597:5
     mask.type !== 'alpha' ||
     mask.visible === false ||
     'sourceNodeId' in mask ||
-    'vectorMask' in mask ||
+    "" in mask ||
     !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
     !isImageShape(doc, node)

[Killed] BooleanLiteral
packages/scene/src/masks.ts:598:5
     mask.visible === false ||
     'sourceNodeId' in mask ||
     'vectorMask' in mask ||
-    !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
+    ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
     !isImageShape(doc, node)
   ) {
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected null to deeply equal { id: 'mask-1', …(5) }

[Killed] BooleanLiteral
packages/scene/src/masks.ts:599:5
     'sourceNodeId' in mask ||
     'vectorMask' in mask ||
     !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
-    !isImageShape(doc, node)
+    isImageShape(doc, node)
   ) {
     return null;
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected null to deeply equal { id: 'mask-1', …(5) }

[Killed] BlockStatement
packages/scene/src/masks.ts:600:5
     'vectorMask' in mask ||
     !ASSET_ID_PATTERN.test(mask.rasterMask.assetId) ||
     !isImageShape(doc, node)
-  ) {
-    return null;
-  }
+  ) {}
   return getOwnRasterMaskAsset(doc, mask.rasterMask.assetId) ?? null;
 }
killedBy: native raster masks rejects raster masks for a missing paint reference
statusReason: expected { id: 'mask-1', …(5) } to be null

[Killed] LogicalOperator
packages/scene/src/masks.ts:603:10
   ) {
     return null;
   }
-  return getOwnRasterMaskAsset(doc, mask.rasterMask.assetId) ?? null;
+  return getOwnRasterMaskAsset(doc, mask.rasterMask.assetId) && null;
 }
 
killedBy: native raster masks uses effective paintRefs consistently for raster mask eligibility and identity
statusReason: expected null to deeply equal { id: 'mask-1', …(5) }

[Killed] BlockStatement
packages/scene/src/masks.ts:607:84
 }
 
 /** True if the container has an active (visible, valid) mask. */
-export function isMasked(node: SceneNode, doc?: Pick<Document, 'paints'>): boolean {
-  return resolveMask(node, doc) !== null;
-}
+export function isMasked(node: SceneNode, doc?: Pick<Document, 'paints'>): boolean {}
 
 /** Return the effective mask type for a container, or null if no active mask. */
killedBy: isMasked returns false for unmasked container
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:608:10
 
 /** True if the container has an active (visible, valid) mask. */
 export function isMasked(node: SceneNode, doc?: Pick<Document, 'paints'>): boolean {
-  return resolveMask(node, doc) !== null;
+  return false;
 }
 
killedBy: isMasked returns true for masked container
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:608:10
 
 /** True if the container has an active (visible, valid) mask. */
 export function isMasked(node: SceneNode, doc?: Pick<Document, 'paints'>): boolean {
-  return resolveMask(node, doc) !== null;
+  return true;
 }
 
killedBy: isMasked returns false for unmasked container
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:612:99
 }
 
 /** Return the effective mask type for a container, or null if no active mask. */
-export function resolveMaskType(node: SceneNode, doc?: Pick<Document, 'paints'>): MaskType | null {
-  const mask = resolveMask(node, doc);
-  return mask ? mask.type : null;
-}
+export function resolveMaskType(node: SceneNode, doc?: Pick<Document, 'paints'>): MaskType | null {}
 
 // ── Find / Validate ─────────────────────────────────────────────────────────
killedBy: resolveMaskType returns null for unmasked container
statusReason: expected undefined to be null

[Killed] BlockStatement
packages/scene/src/masks.ts:622:85
 /**
  * Find all container node IDs whose mask references the given sourceNodeId.
  */
-export function findNodesUsingMaskSource(doc: Document, sourceId: NodeId): NodeId[] {
-  const result: NodeId[] = [];
-  for (const [id, node] of Object.entries(doc.nodes)) {
-    const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId === sourceId) {
-      result.push(id as NodeId);
-    }
-  }
-  return result;
-}
+export function findNodesUsingMaskSource(doc: Document, sourceId: NodeId): NodeId[] {}
 
 /**
killedBy: findNodesUsingMaskSource returns empty array when no masks use source
statusReason: expected undefined to deeply equal []

[Killed] ArrayDeclaration
packages/scene/src/masks.ts:623:28
  * Find all container node IDs whose mask references the given sourceNodeId.
  */
 export function findNodesUsingMaskSource(doc: Document, sourceId: NodeId): NodeId[] {
-  const result: NodeId[] = [];
+  const result: NodeId[] = ["Stryker was here"];
   for (const [id, node] of Object.entries(doc.nodes)) {
     const n = node as SceneNode & { mask?: Mask };
killedBy: findNodesUsingMaskSource returns empty array when no masks use source
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
packages/scene/src/masks.ts:624:55
  */
 export function findNodesUsingMaskSource(doc: Document, sourceId: NodeId): NodeId[] {
   const result: NodeId[] = [];
-  for (const [id, node] of Object.entries(doc.nodes)) {
-    const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId === sourceId) {
-      result.push(id as NodeId);
-    }
-  }
+  for (const [id, node] of Object.entries(doc.nodes)) {}
   return result;
 }
killedBy: findNodesUsingMaskSource returns node IDs that reference the source
statusReason: expected [] to deeply equal [ 'f1' ]

[Killed] ConditionalExpression
packages/scene/src/masks.ts:626:9
   const result: NodeId[] = [];
   for (const [id, node] of Object.entries(doc.nodes)) {
     const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId === sourceId) {
+    if (false) {
       result.push(id as NodeId);
     }
killedBy: findNodesUsingMaskSource returns node IDs that reference the source
statusReason: expected [] to deeply equal [ 'f1' ]

[Killed] OptionalChaining
packages/scene/src/masks.ts:626:9
   const result: NodeId[] = [];
   for (const [id, node] of Object.entries(doc.nodes)) {
     const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId === sourceId) {
+    if (n.mask.sourceNodeId === sourceId) {
       result.push(id as NodeId);
     }
killedBy: findNodesUsingMaskSource returns empty array when no masks use source
statusReason: Cannot read properties of undefined (reading 'sourceNodeId')

[Killed] BlockStatement
packages/scene/src/masks.ts:636:72
 /**
  * Check if a node is used as a mask source by any container.
  */
-export function isMaskSource(doc: Document, sourceId: NodeId): boolean {
-  return findNodesUsingMaskSource(doc, sourceId).length > 0;
-}
+export function isMaskSource(doc: Document, sourceId: NodeId): boolean {}
 
 /**
killedBy: isMaskSource returns true when node is used as mask
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:637:10
  * Check if a node is used as a mask source by any container.
  */
 export function isMaskSource(doc: Document, sourceId: NodeId): boolean {
-  return findNodesUsingMaskSource(doc, sourceId).length > 0;
+  return findNodesUsingMaskSource(doc, sourceId).length <= 0;
 }
 
killedBy: isMaskSource returns true when node is used as mask
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:637:10
  * Check if a node is used as a mask source by any container.
  */
 export function isMaskSource(doc: Document, sourceId: NodeId): boolean {
-  return findNodesUsingMaskSource(doc, sourceId).length > 0;
+  return false;
 }
 
killedBy: isMaskSource returns true when node is used as mask
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:644:56
  * Validate that no mask references point to non-existent nodes.
  * Returns list of container NodeIds with dangling mask references.
  */
-export function validateMasks(doc: Document): NodeId[] {
-  const dangling: NodeId[] = [];
-  for (const [id, node] of Object.entries(doc.nodes)) {
-    const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId && !doc.nodes[n.mask.sourceNodeId]) {
-      dangling.push(id as NodeId);
-    } else if (n.mask && validateMaskSource(doc, n.mask)) {
-      dangling.push(id as NodeId);
-    }
-  }
-  return dangling;
-}
+export function validateMasks(doc: Document): NodeId[] {}
 
 /**
killedBy: validateMasks returns empty for clean document
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
packages/scene/src/masks.ts:646:55
  */
 export function validateMasks(doc: Document): NodeId[] {
   const dangling: NodeId[] = [];
-  for (const [id, node] of Object.entries(doc.nodes)) {
-    const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId && !doc.nodes[n.mask.sourceNodeId]) {
-      dangling.push(id as NodeId);
-    } else if (n.mask && validateMaskSource(doc, n.mask)) {
-      dangling.push(id as NodeId);
-    }
-  }
+  for (const [id, node] of Object.entries(doc.nodes)) {}
   return dangling;
 }
killedBy: validateMasks finds dangling mask reference
statusReason: expected [] to deeply equal [ 'f1' ]

[Killed] BooleanLiteral
packages/scene/src/masks.ts:648:33
   const dangling: NodeId[] = [];
   for (const [id, node] of Object.entries(doc.nodes)) {
     const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId && !doc.nodes[n.mask.sourceNodeId]) {
+    if (n.mask?.sourceNodeId && doc.nodes[n.mask.sourceNodeId]) {
       dangling.push(id as NodeId);
     } else if (n.mask && validateMaskSource(doc, n.mask)) {
killedBy: validateMasks returns empty for clean document
statusReason: expected [ 'f1' ] to deeply equal []

[Killed] BlockStatement
packages/scene/src/masks.ts:648:66
   const dangling: NodeId[] = [];
   for (const [id, node] of Object.entries(doc.nodes)) {
     const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId && !doc.nodes[n.mask.sourceNodeId]) {
-      dangling.push(id as NodeId);
-    } else if (n.mask && validateMaskSource(doc, n.mask)) {
+    if (n.mask?.sourceNodeId && !doc.nodes[n.mask.sourceNodeId]) {} else if (n.mask && validateMaskSource(doc, n.mask)) {
       dangling.push(id as NodeId);
     }
killedBy: validateMasks finds dangling mask reference
statusReason: expected [] to deeply equal [ 'f1' ]

[Killed] LogicalOperator
packages/scene/src/masks.ts:650:16
     const n = node as SceneNode & { mask?: Mask };
     if (n.mask?.sourceNodeId && !doc.nodes[n.mask.sourceNodeId]) {
       dangling.push(id as NodeId);
-    } else if (n.mask && validateMaskSource(doc, n.mask)) {
+    } else if (n.mask || validateMaskSource(doc, n.mask)) {
       dangling.push(id as NodeId);
     }
killedBy: validateMasks returns empty for clean document
statusReason: Cannot read properties of undefined (reading 'rasterMask')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:650:16
     const n = node as SceneNode & { mask?: Mask };
     if (n.mask?.sourceNodeId && !doc.nodes[n.mask.sourceNodeId]) {
       dangling.push(id as NodeId);
-    } else if (n.mask && validateMaskSource(doc, n.mask)) {
+    } else if (true) {
       dangling.push(id as NodeId);
     }
killedBy: validateMasks returns empty for clean document
statusReason: expected [ 'n1', 'f1' ] to deeply equal []

[Killed] BlockStatement
packages/scene/src/masks.ts:661:76
  * Remove mask references to the given source node from all container nodes.
  * Returns a new Document with the masks cleared.
  */
-export function clearMaskSource(doc: Document, sourceId: NodeId): Document {
-  let nodes = { ...doc.nodes };
-  for (const [id, node] of Object.entries(nodes)) {
-    const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId === sourceId) {
-      const { mask: _unused, ...rest } = n;
-      nodes = { ...nodes, [id]: rest as SceneNode };
-    }
-  }
-  return { ...doc, nodes };
-}
+export function clearMaskSource(doc: Document, sourceId: NodeId): Document {}
 
 // ── Helpers ─────────────────────────────────────────────────────────────────
killedBy: clearMaskSource removes mask from nodes referencing source
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] BlockStatement
packages/scene/src/masks.ts:663:51
  */
 export function clearMaskSource(doc: Document, sourceId: NodeId): Document {
   let nodes = { ...doc.nodes };
-  for (const [id, node] of Object.entries(nodes)) {
-    const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId === sourceId) {
-      const { mask: _unused, ...rest } = n;
-      nodes = { ...nodes, [id]: rest as SceneNode };
-    }
-  }
+  for (const [id, node] of Object.entries(nodes)) {}
   return { ...doc, nodes };
 }
killedBy: clearMaskSource removes mask from nodes referencing source
statusReason: expected { type: 'clip', …(2) } to be undefined

[Killed] EqualityOperator
packages/scene/src/masks.ts:665:9
   let nodes = { ...doc.nodes };
   for (const [id, node] of Object.entries(nodes)) {
     const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId === sourceId) {
+    if (n.mask?.sourceNodeId !== sourceId) {
       const { mask: _unused, ...rest } = n;
       nodes = { ...nodes, [id]: rest as SceneNode };
killedBy: clearMaskSource removes mask from nodes referencing source
statusReason: expected { type: 'clip', …(2) } to be undefined

[Killed] ObjectLiteral
packages/scene/src/masks.ts:667:15
     const n = node as SceneNode & { mask?: Mask };
     if (n.mask?.sourceNodeId === sourceId) {
       const { mask: _unused, ...rest } = n;
-      nodes = { ...nodes, [id]: rest as SceneNode };
+      nodes = {};
     }
   }
killedBy: clearMaskSource removes mask from nodes referencing source
statusReason: Cannot read properties of undefined (reading 'mask')

[Killed] ObjectLiteral
packages/scene/src/masks.ts:670:10
       nodes = { ...nodes, [id]: rest as SceneNode };
     }
   }
-  return { ...doc, nodes };
+  return {};
 }
 
killedBy: clearMaskSource removes mask from nodes referencing source
statusReason: Cannot read properties of undefined (reading 'f1')
