[Killed] BlockStatement
packages/scene/src/masks.ts:675:100
 
 // ── Helpers ─────────────────────────────────────────────────────────────────
 
-function isContainerNode(node: SceneNode): node is SceneNode & { mask?: Mask; children: string[] } {
-  return node.kind === 'frame' || node.kind === 'group' || node.kind === 'adjustment';
-}
+function isContainerNode(node: SceneNode): node is SceneNode & { mask?: Mask; children: string[] } {}
 
 function resolvedImageFill(doc: Pick<Document, 'paints'>, node: SceneNode) {
killedBy: canNodeHaveMask returns true for frame
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:676:60
 // ── Helpers ─────────────────────────────────────────────────────────────────
 
 function isContainerNode(node: SceneNode): node is SceneNode & { mask?: Mask; children: string[] } {
-  return node.kind === 'frame' || node.kind === 'group' || node.kind === 'adjustment';
+  return node.kind === 'frame' || node.kind === 'group' || node.kind !== 'adjustment';
 }
 
killedBy: canNodeHaveMask returns false for shape
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:676:10
 // ── Helpers ─────────────────────────────────────────────────────────────────
 
 function isContainerNode(node: SceneNode): node is SceneNode & { mask?: Mask; children: string[] } {
-  return node.kind === 'frame' || node.kind === 'group' || node.kind === 'adjustment';
+  return node.kind === 'frame' && node.kind === 'group' || node.kind === 'adjustment';
 }
 
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: expected undefined to be defined

[Killed] BlockStatement
packages/scene/src/masks.ts:679:76
   return node.kind === 'frame' || node.kind === 'group' || node.kind === 'adjustment';
 }
 
-function resolvedImageFill(doc: Pick<Document, 'paints'>, node: SceneNode) {
-  if (node.kind !== 'shape') return undefined;
-  return resolveNodePaints(node as unknown as Parameters<typeof resolveNodePaints>[0], doc).find(
-    (fill) => fill.type === 'image' && fill.image,
-  )?.image;
-}
+function resolvedImageFill(doc: Pick<Document, 'paints'>, node: SceneNode) {}
 
 function isImageShape(doc: Pick<Document, 'paints'>, node: SceneNode): node is ShapeNode {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:680:7
 }
 
 function resolvedImageFill(doc: Pick<Document, 'paints'>, node: SceneNode) {
-  if (node.kind !== 'shape') return undefined;
+  if (node.kind === 'shape') return undefined;
   return resolveNodePaints(node as unknown as Parameters<typeof resolveNodePaints>[0], doc).find(
     (fill) => fill.type === 'image' && fill.image,
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:680:7
 }
 
 function resolvedImageFill(doc: Pick<Document, 'paints'>, node: SceneNode) {
-  if (node.kind !== 'shape') return undefined;
+  if (true) return undefined;
   return resolveNodePaints(node as unknown as Parameters<typeof resolveNodePaints>[0], doc).find(
     (fill) => fill.type === 'image' && fill.image,
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] OptionalChaining
packages/scene/src/masks.ts:681:10
 
 function resolvedImageFill(doc: Pick<Document, 'paints'>, node: SceneNode) {
   if (node.kind !== 'shape') return undefined;
-  return resolveNodePaints(node as unknown as Parameters<typeof resolveNodePaints>[0], doc).find(
-    (fill) => fill.type === 'image' && fill.image,
-  )?.image;
+  return resolveNodePaints(node as unknown as Parameters<typeof resolveNodePaints>[0], doc).find(fill => fill.type === 'image' && fill.image).image;
 }
 
killedBy: canNodeHaveMask returns false for shape
statusReason: Cannot read properties of undefined (reading 'image')

[Killed] ArrowFunction
packages/scene/src/masks.ts:682:5
 function resolvedImageFill(doc: Pick<Document, 'paints'>, node: SceneNode) {
   if (node.kind !== 'shape') return undefined;
   return resolveNodePaints(node as unknown as Parameters<typeof resolveNodePaints>[0], doc).find(
-    (fill) => fill.type === 'image' && fill.image,
+    () => undefined,
   )?.image;
 }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:682:15
 function resolvedImageFill(doc: Pick<Document, 'paints'>, node: SceneNode) {
   if (node.kind !== 'shape') return undefined;
   return resolveNodePaints(node as unknown as Parameters<typeof resolveNodePaints>[0], doc).find(
-    (fill) => fill.type === 'image' && fill.image,
+    (fill) => false,
   )?.image;
 }
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:686:90
   )?.image;
 }
 
-function isImageShape(doc: Pick<Document, 'paints'>, node: SceneNode): node is ShapeNode {
-  return node.kind === 'shape' && Boolean(resolvedImageFill(doc, node));
-}
+function isImageShape(doc: Pick<Document, 'paints'>, node: SceneNode): node is ShapeNode {}
 
 /**
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:687:10
 }
 
 function isImageShape(doc: Pick<Document, 'paints'>, node: SceneNode): node is ShapeNode {
-  return node.kind === 'shape' && Boolean(resolvedImageFill(doc, node));
+  return false;
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:687:10
 }
 
 function isImageShape(doc: Pick<Document, 'paints'>, node: SceneNode): node is ShapeNode {
-  return node.kind === 'shape' && Boolean(resolvedImageFill(doc, node));
+  return node.kind !== 'shape' && Boolean(resolvedImageFill(doc, node));
 }
 
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:695:56
  * be several megabytes. Keep a deterministic compact locator in the identity
  * descriptor; the image fill remains the authoritative full source.
  */
-function compactSourceLocator(locator: string): string {
-  if (locator.length <= 8192) return locator;
-  let first = 0x811c9dc5;
-  let second = 0x9e3779b9;
-  for (let index = 0; index < locator.length; index++) {
-    const code = locator.charCodeAt(index);
-    first = Math.imul(first ^ code, 0x01000193);
-    second = Math.imul(second ^ code, 0x85ebca6b);
-  }
-  const prefixEnd = locator.indexOf(',');
-  const mediaType = prefixEnd > 0 ? locator.slice(0, Math.min(prefixEnd, 96)) : 'embedded-source';
-  const digest = `${(first >>> 0).toString(16).padStart(8, '0')}${(second >>> 0)
-    .toString(16)
-    .padStart(8, '0')}`;
-  return `${mediaType};length=${locator.length};fingerprint=${digest}`;
-}
+function compactSourceLocator(locator: string): string {}
 
 /**
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:696:7
  * descriptor; the image fill remains the authoritative full source.
  */
 function compactSourceLocator(locator: string): string {
-  if (locator.length <= 8192) return locator;
+  if (locator.length > 8192) return locator;
   let first = 0x811c9dc5;
   let second = 0x9e3779b9;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { type: 'alpha', visible: true, …(1) } to deeply equal { type: 'alpha', visible: true, …(1) }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:696:7
  * descriptor; the image fill remains the authoritative full source.
  */
 function compactSourceLocator(locator: string): string {
-  if (locator.length <= 8192) return locator;
+  if (false) return locator;
   let first = 0x811c9dc5;
   let second = 0x9e3779b9;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { type: 'alpha', visible: true, …(1) } to deeply equal { type: 'alpha', visible: true, …(1) }

[NoCoverage] UpdateOperator
packages/scene/src/masks.ts:699:47
   if (locator.length <= 8192) return locator;
   let first = 0x811c9dc5;
   let second = 0x9e3779b9;
-  for (let index = 0; index < locator.length; index++) {
+  for (let index = 0; index < locator.length; index--) {
     const code = locator.charCodeAt(index);
     first = Math.imul(first ^ code, 0x01000193);

[NoCoverage] BlockStatement
packages/scene/src/masks.ts:699:56
   if (locator.length <= 8192) return locator;
   let first = 0x811c9dc5;
   let second = 0x9e3779b9;
-  for (let index = 0; index < locator.length; index++) {
-    const code = locator.charCodeAt(index);
-    first = Math.imul(first ^ code, 0x01000193);
-    second = Math.imul(second ^ code, 0x85ebca6b);
-  }
+  for (let index = 0; index < locator.length; index++) {}
   const prefixEnd = locator.indexOf(',');
   const mediaType = prefixEnd > 0 ? locator.slice(0, Math.min(prefixEnd, 96)) : 'embedded-source';

[NoCoverage] ConditionalExpression
packages/scene/src/masks.ts:705:21
     second = Math.imul(second ^ code, 0x85ebca6b);
   }
   const prefixEnd = locator.indexOf(',');
-  const mediaType = prefixEnd > 0 ? locator.slice(0, Math.min(prefixEnd, 96)) : 'embedded-source';
+  const mediaType = true ? locator.slice(0, Math.min(prefixEnd, 96)) : 'embedded-source';
   const digest = `${(first >>> 0).toString(16).padStart(8, '0')}${(second >>> 0)
     .toString(16)

[NoCoverage] EqualityOperator
packages/scene/src/masks.ts:705:21
     second = Math.imul(second ^ code, 0x85ebca6b);
   }
   const prefixEnd = locator.indexOf(',');
-  const mediaType = prefixEnd > 0 ? locator.slice(0, Math.min(prefixEnd, 96)) : 'embedded-source';
+  const mediaType = prefixEnd >= 0 ? locator.slice(0, Math.min(prefixEnd, 96)) : 'embedded-source';
   const digest = `${(first >>> 0).toString(16).padStart(8, '0')}${(second >>> 0)
     .toString(16)

[Killed] BlockStatement
packages/scene/src/masks.ts:716:91
  * Returns true if the node can own a mask. Containers own structural masks;
  * image-filled ShapeNodes own source-pixel raster alpha masks.
  */
-export function canNodeHaveMask(node: SceneNode, doc?: Pick<Document, 'paints'>): boolean {
-  return isContainerNode(node) || isImageShape(doc ?? {}, node);
-}
+export function canNodeHaveMask(node: SceneNode, doc?: Pick<Document, 'paints'>): boolean {}
 
 // ── CRUD Operations ─────────────────────────────────────────────────────────
killedBy: canNodeHaveMask returns true for frame
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:717:10
  * image-filled ShapeNodes own source-pixel raster alpha masks.
  */
 export function canNodeHaveMask(node: SceneNode, doc?: Pick<Document, 'paints'>): boolean {
-  return isContainerNode(node) || isImageShape(doc ?? {}, node);
+  return isContainerNode(node) && isImageShape(doc ?? {}, node);
 }
 
killedBy: canNodeHaveMask returns true for frame
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:717:10
  * image-filled ShapeNodes own source-pixel raster alpha masks.
  */
 export function canNodeHaveMask(node: SceneNode, doc?: Pick<Document, 'paints'>): boolean {
-  return isContainerNode(node) || isImageShape(doc ?? {}, node);
+  return false;
 }
 
killedBy: canNodeHaveMask returns true for frame
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
packages/scene/src/masks.ts:722:38
 
 // ── CRUD Operations ─────────────────────────────────────────────────────────
 
-const VALID_MASK_TYPES: MaskType[] = ['clip', 'alpha', 'luminance'];
+const VALID_MASK_TYPES: MaskType[] = [];
 
 function imageSourceIdentity(
killedBy: addMask adds a clip mask to a frame
statusReason: expected undefined to be defined

[Killed] BlockStatement
packages/scene/src/masks.ts:728:29
   doc: Pick<Document, 'paints'>,
   node: ShapeNode,
   revision: number,
-): RasterMaskSourceIdentity {
-  const image = resolvedImageFill(doc, node);
-  return {
-    kind: 'source-metadata',
-    locator: compactSourceLocator(image?.src ?? node.id),
-    ...(image?.imageWidth !== undefined ? { pixelWidth: image.imageWidth } : {}),
-    ...(image?.imageHeight !== undefined ? { pixelHeight: image.imageHeight } : {}),
-    revision,
-  };
-}
+): RasterMaskSourceIdentity {}
 
 function rasterAssetsEqual(left: RasterMaskAsset, right: RasterMaskAsset): boolean {
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:732:35
   const image = resolvedImageFill(doc, node);
   return {
     kind: 'source-metadata',
-    locator: compactSourceLocator(image?.src ?? node.id),
+    locator: compactSourceLocator(image?.src && node.id),
     ...(image?.imageWidth !== undefined ? { pixelWidth: image.imageWidth } : {}),
     ...(image?.imageHeight !== undefined ? { pixelHeight: image.imageHeight } : {}),
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { type: 'alpha', visible: true, …(1) } to deeply equal { type: 'alpha', visible: true, …(1) }

[Survived] OptionalChaining
packages/scene/src/masks.ts:732:35
   const image = resolvedImageFill(doc, node);
   return {
     kind: 'source-metadata',
-    locator: compactSourceLocator(image?.src ?? node.id),
+    locator: compactSourceLocator(image.src ?? node.id),
     ...(image?.imageWidth !== undefined ? { pixelWidth: image.imageWidth } : {}),
     ...(image?.imageHeight !== undefined ? { pixelHeight: image.imageHeight } : {}),

[Killed] ConditionalExpression
packages/scene/src/masks.ts:733:9
   return {
     kind: 'source-metadata',
     locator: compactSourceLocator(image?.src ?? node.id),
-    ...(image?.imageWidth !== undefined ? { pixelWidth: image.imageWidth } : {}),
+    ...(false ? { pixelWidth: image.imageWidth } : {}),
     ...(image?.imageHeight !== undefined ? { pixelHeight: image.imageHeight } : {}),
     revision,
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:733:9
   return {
     kind: 'source-metadata',
     locator: compactSourceLocator(image?.src ?? node.id),
-    ...(image?.imageWidth !== undefined ? { pixelWidth: image.imageWidth } : {}),
+    ...(image?.imageWidth === undefined ? { pixelWidth: image.imageWidth } : {}),
     ...(image?.imageHeight !== undefined ? { pixelHeight: image.imageHeight } : {}),
     revision,
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:734:9
     kind: 'source-metadata',
     locator: compactSourceLocator(image?.src ?? node.id),
     ...(image?.imageWidth !== undefined ? { pixelWidth: image.imageWidth } : {}),
-    ...(image?.imageHeight !== undefined ? { pixelHeight: image.imageHeight } : {}),
+    ...(image?.imageHeight === undefined ? { pixelHeight: image.imageHeight } : {}),
     revision,
   };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:734:9
     kind: 'source-metadata',
     locator: compactSourceLocator(image?.src ?? node.id),
     ...(image?.imageWidth !== undefined ? { pixelWidth: image.imageWidth } : {}),
-    ...(image?.imageHeight !== undefined ? { pixelHeight: image.imageHeight } : {}),
+    ...(false ? { pixelHeight: image.imageHeight } : {}),
     revision,
   };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:739:84
   };
 }
 
-function rasterAssetsEqual(left: RasterMaskAsset, right: RasterMaskAsset): boolean {
-  return (
-    left.id === right.id &&
-    left.mimeType === right.mimeType &&
-    left.dataUrl === right.dataUrl &&
-    left.width === right.width &&
-    left.height === right.height &&
-    left.byteLength === right.byteLength &&
-    left.checksum === right.checksum
-  );
-}
+function rasterAssetsEqual(left: RasterMaskAsset, right: RasterMaskAsset): boolean {}
 
 function isRasterAssetReferenced(doc: Document, assetId: string, exceptNodeId?: NodeId): boolean {
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:741:5
 
 function rasterAssetsEqual(left: RasterMaskAsset, right: RasterMaskAsset): boolean {
   return (
-    left.id === right.id &&
-    left.mimeType === right.mimeType &&
-    left.dataUrl === right.dataUrl &&
-    left.width === right.width &&
-    left.height === right.height &&
-    left.byteLength === right.byteLength &&
-    left.checksum === right.checksum
+    false
   );
 }
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:741:5
 
 function rasterAssetsEqual(left: RasterMaskAsset, right: RasterMaskAsset): boolean {
   return (
-    left.id === right.id &&
+    left.id !== right.id &&
     left.mimeType === right.mimeType &&
     left.dataUrl === right.dataUrl &&
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:742:5
 function rasterAssetsEqual(left: RasterMaskAsset, right: RasterMaskAsset): boolean {
   return (
     left.id === right.id &&
-    left.mimeType === right.mimeType &&
+    left.mimeType !== right.mimeType &&
     left.dataUrl === right.dataUrl &&
     left.width === right.width &&
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:742:5
 function rasterAssetsEqual(left: RasterMaskAsset, right: RasterMaskAsset): boolean {
   return (
     left.id === right.id &&
-    left.mimeType === right.mimeType &&
+    true &&
     left.dataUrl === right.dataUrl &&
     left.width === right.width &&

[Killed] EqualityOperator
packages/scene/src/masks.ts:743:5
   return (
     left.id === right.id &&
     left.mimeType === right.mimeType &&
-    left.dataUrl === right.dataUrl &&
+    left.dataUrl !== right.dataUrl &&
     left.width === right.width &&
     left.height === right.height &&
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:743:5
   return (
     left.id === right.id &&
     left.mimeType === right.mimeType &&
-    left.dataUrl === right.dataUrl &&
+    true &&
     left.width === right.width &&
     left.height === right.height &&

[Killed] EqualityOperator
packages/scene/src/masks.ts:744:5
     left.id === right.id &&
     left.mimeType === right.mimeType &&
     left.dataUrl === right.dataUrl &&
-    left.width === right.width &&
+    left.width !== right.width &&
     left.height === right.height &&
     left.byteLength === right.byteLength &&
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:744:5
     left.id === right.id &&
     left.mimeType === right.mimeType &&
     left.dataUrl === right.dataUrl &&
-    left.width === right.width &&
+    true &&
     left.height === right.height &&
     left.byteLength === right.byteLength &&

[Killed] EqualityOperator
packages/scene/src/masks.ts:745:5
     left.mimeType === right.mimeType &&
     left.dataUrl === right.dataUrl &&
     left.width === right.width &&
-    left.height === right.height &&
+    left.height !== right.height &&
     left.byteLength === right.byteLength &&
     left.checksum === right.checksum
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:745:5
     left.mimeType === right.mimeType &&
     left.dataUrl === right.dataUrl &&
     left.width === right.width &&
-    left.height === right.height &&
+    true &&
     left.byteLength === right.byteLength &&
     left.checksum === right.checksum

[Killed] EqualityOperator
packages/scene/src/masks.ts:746:5
     left.dataUrl === right.dataUrl &&
     left.width === right.width &&
     left.height === right.height &&
-    left.byteLength === right.byteLength &&
+    left.byteLength !== right.byteLength &&
     left.checksum === right.checksum
   );
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:746:5
     left.dataUrl === right.dataUrl &&
     left.width === right.width &&
     left.height === right.height &&
-    left.byteLength === right.byteLength &&
+    true &&
     left.checksum === right.checksum
   );

[Killed] EqualityOperator
packages/scene/src/masks.ts:747:5
     left.width === right.width &&
     left.height === right.height &&
     left.byteLength === right.byteLength &&
-    left.checksum === right.checksum
+    left.checksum !== right.checksum
   );
 }
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'shared-mask' // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:747:5
     left.width === right.width &&
     left.height === right.height &&
     left.byteLength === right.byteLength &&
-    left.checksum === right.checksum
+    true
   );
 }

[Killed] BlockStatement
packages/scene/src/masks.ts:751:98
   );
 }
 
-function isRasterAssetReferenced(doc: Document, assetId: string, exceptNodeId?: NodeId): boolean {
-  return Object.values(doc.nodes).some(
-    (node) => node.id !== exceptNodeId && node.mask?.rasterMask?.assetId === assetId,
-  );
-}
+function isRasterAssetReferenced(doc: Document, assetId: string, exceptNodeId?: NodeId): boolean {}
 
 function withoutUnreferencedAsset(doc: Document, assetId: string): Document {
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be defined

[Killed] MethodExpression
packages/scene/src/masks.ts:752:10
 }
 
 function isRasterAssetReferenced(doc: Document, assetId: string, exceptNodeId?: NodeId): boolean {
-  return Object.values(doc.nodes).some(
-    (node) => node.id !== exceptNodeId && node.mask?.rasterMask?.assetId === assetId,
-  );
+  return Object.values(doc.nodes).every(node => node.id !== exceptNodeId && node.mask?.rasterMask?.assetId === assetId);
 }
 
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be defined

[Killed] EqualityOperator
packages/scene/src/masks.ts:753:43
 
 function isRasterAssetReferenced(doc: Document, assetId: string, exceptNodeId?: NodeId): boolean {
   return Object.values(doc.nodes).some(
-    (node) => node.id !== exceptNodeId && node.mask?.rasterMask?.assetId === assetId,
+    (node) => node.id !== exceptNodeId && node.mask?.rasterMask?.assetId !== assetId,
   );
 }
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected { id: 'shared-mask', …(5) } to be undefined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:753:15
 
 function isRasterAssetReferenced(doc: Document, assetId: string, exceptNodeId?: NodeId): boolean {
   return Object.values(doc.nodes).some(
-    (node) => node.id !== exceptNodeId && node.mask?.rasterMask?.assetId === assetId,
+    (node) => false,
   );
 }
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be defined

[Killed] BlockStatement
packages/scene/src/masks.ts:757:77
   );
 }
 
-function withoutUnreferencedAsset(doc: Document, assetId: string): Document {
-  if (isRasterAssetReferenced(doc, assetId) || !getOwnRasterMaskAsset(doc, assetId)) return doc;
-  const rasterMaskAssets = { ...doc.rasterMaskAssets };
-  delete rasterMaskAssets[assetId];
-  return {
-    ...doc,
-    rasterMaskAssets: Object.keys(rasterMaskAssets).length > 0 ? rasterMaskAssets : undefined,
-  };
-}
+function withoutUnreferencedAsset(doc: Document, assetId: string): Document {}
 
 /**
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] LogicalOperator
packages/scene/src/masks.ts:758:7
 }
 
 function withoutUnreferencedAsset(doc: Document, assetId: string): Document {
-  if (isRasterAssetReferenced(doc, assetId) || !getOwnRasterMaskAsset(doc, assetId)) return doc;
+  if (isRasterAssetReferenced(doc, assetId) && !getOwnRasterMaskAsset(doc, assetId)) return doc;
   const rasterMaskAssets = { ...doc.rasterMaskAssets };
   delete rasterMaskAssets[assetId];
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:758:48
 }
 
 function withoutUnreferencedAsset(doc: Document, assetId: string): Document {
-  if (isRasterAssetReferenced(doc, assetId) || !getOwnRasterMaskAsset(doc, assetId)) return doc;
+  if (isRasterAssetReferenced(doc, assetId) || getOwnRasterMaskAsset(doc, assetId)) return doc;
   const rasterMaskAssets = { ...doc.rasterMaskAssets };
   delete rasterMaskAssets[assetId];
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected { id: 'shared-mask', …(5) } to be undefined

[Killed] EqualityOperator
packages/scene/src/masks.ts:763:23
   delete rasterMaskAssets[assetId];
   return {
     ...doc,
-    rasterMaskAssets: Object.keys(rasterMaskAssets).length > 0 ? rasterMaskAssets : undefined,
+    rasterMaskAssets: Object.keys(rasterMaskAssets).length <= 0 ? rasterMaskAssets : undefined,
   };
 }
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:763:23
   delete rasterMaskAssets[assetId];
   return {
     ...doc,
-    rasterMaskAssets: Object.keys(rasterMaskAssets).length > 0 ? rasterMaskAssets : undefined,
+    rasterMaskAssets: false ? rasterMaskAssets : undefined,
   };
 }
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:778:16
   rasterMask?: Partial<Omit<RasterMaskData, 'assetId' | 'coordinateSpace'>>,
 ): Document {
   const node = doc.nodes[nodeId];
-  if (!node || !isImageShape(doc, node) || validateRasterMaskAsset(asset)) return doc;
+  if (!node || isImageShape(doc, node) || validateRasterMaskAsset(asset)) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:778:7
   rasterMask?: Partial<Omit<RasterMaskData, 'assetId' | 'coordinateSpace'>>,
 ): Document {
   const node = doc.nodes[nodeId];
-  if (!node || !isImageShape(doc, node) || validateRasterMaskAsset(asset)) return doc;
+  if (false) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
killedBy: native raster masks only attaches raster masks to image-filled shapes with a resolved asset
statusReason: expected { …(8) } to be { …(7) } // Object.is equality
