[Killed] ConditionalExpression
packages/scene/src/masks.ts:780:7
   const node = doc.nodes[nodeId];
   if (!node || !isImageShape(doc, node) || validateRasterMaskAsset(asset)) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
-  if (existing && !rasterAssetsEqual(existing, asset)) return doc;
+  if (true) return doc;
 
   const revision = rasterMask?.sourceIdentity?.revision ?? 1;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:780:7
   const node = doc.nodes[nodeId];
   if (!node || !isImageShape(doc, node) || validateRasterMaskAsset(asset)) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
-  if (existing && !rasterAssetsEqual(existing, asset)) return doc;
+  if (existing || !rasterAssetsEqual(existing, asset)) return doc;
 
   const revision = rasterMask?.sourceIdentity?.revision ?? 1;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
packages/scene/src/masks.ts:782:20
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
 
-  const revision = rasterMask?.sourceIdentity?.revision ?? 1;
+  const revision = rasterMask.sourceIdentity?.revision ?? 1;
   const maskData: RasterMaskData = {
     assetId: asset.id,
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'sourceIdentity')

[Killed] LogicalOperator
packages/scene/src/masks.ts:782:20
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
 
-  const revision = rasterMask?.sourceIdentity?.revision ?? 1;
+  const revision = rasterMask?.sourceIdentity?.revision && 1;
   const maskData: RasterMaskData = {
     assetId: asset.id,
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:786:21
   const maskData: RasterMaskData = {
     assetId: asset.id,
     coordinateSpace: 'source-image-pixels',
-    sourceIdentity: rasterMask?.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
+    sourceIdentity: rasterMask?.sourceIdentity && imageSourceIdentity(doc, node, revision),
     ...(rasterMask?.editRevision !== undefined ? { editRevision: rasterMask.editRevision } : {}),
     ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] OptionalChaining
packages/scene/src/masks.ts:786:21
   const maskData: RasterMaskData = {
     assetId: asset.id,
     coordinateSpace: 'source-image-pixels',
-    sourceIdentity: rasterMask?.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
+    sourceIdentity: rasterMask.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
     ...(rasterMask?.editRevision !== undefined ? { editRevision: rasterMask.editRevision } : {}),
     ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'sourceIdentity')

[Killed] EqualityOperator
packages/scene/src/masks.ts:787:9
     assetId: asset.id,
     coordinateSpace: 'source-image-pixels',
     sourceIdentity: rasterMask?.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
-    ...(rasterMask?.editRevision !== undefined ? { editRevision: rasterMask.editRevision } : {}),
+    ...(rasterMask?.editRevision === undefined ? { editRevision: rasterMask.editRevision } : {}),
     ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
     ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'editRevision')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:787:9
     assetId: asset.id,
     coordinateSpace: 'source-image-pixels',
     sourceIdentity: rasterMask?.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
-    ...(rasterMask?.editRevision !== undefined ? { editRevision: rasterMask.editRevision } : {}),
+    ...(false ? { editRevision: rasterMask.editRevision } : {}),
     ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
     ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { type: 'alpha', visible: false, …(8) } to match object { Object (visible, inverted, ...) }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
packages/scene/src/masks.ts:788:9
     coordinateSpace: 'source-image-pixels',
     sourceIdentity: rasterMask?.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
     ...(rasterMask?.editRevision !== undefined ? { editRevision: rasterMask.editRevision } : {}),
-    ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
+    ...(rasterMask?.staleReason === undefined ? { staleReason: rasterMask.staleReason } : {}),
     ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
   };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'staleReason')

[Killed] OptionalChaining
packages/scene/src/masks.ts:788:9
     coordinateSpace: 'source-image-pixels',
     sourceIdentity: rasterMask?.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
     ...(rasterMask?.editRevision !== undefined ? { editRevision: rasterMask.editRevision } : {}),
-    ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
+    ...(rasterMask.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
     ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
   };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'staleReason')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:789:9
     sourceIdentity: rasterMask?.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
     ...(rasterMask?.editRevision !== undefined ? { editRevision: rasterMask.editRevision } : {}),
     ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
-    ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
+    ...(true ? { provenance: rasterMask.provenance } : {}),
   };
   const mask: Mask = { type: 'alpha', visible: true, rasterMask: maskData };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'provenance')

[Killed] EqualityOperator
packages/scene/src/masks.ts:789:9
     sourceIdentity: rasterMask?.sourceIdentity ?? imageSourceIdentity(doc, node, revision),
     ...(rasterMask?.editRevision !== undefined ? { editRevision: rasterMask.editRevision } : {}),
     ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
-    ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
+    ...(rasterMask?.provenance === undefined ? { provenance: rasterMask.provenance } : {}),
   };
   const mask: Mask = { type: 'alpha', visible: true, rasterMask: maskData };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'provenance')

[Killed] BooleanLiteral
packages/scene/src/masks.ts:791:48
     ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
     ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
   };
-  const mask: Mask = { type: 'alpha', visible: true, rasterMask: maskData };
+  const mask: Mask = { type: 'alpha', visible: false, rasterMask: maskData };
   const candidate = {
     ...doc,
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { type: 'alpha', visible: false, …(1) } to deeply equal { type: 'alpha', visible: true, …(1) }

[Killed] StringLiteral
packages/scene/src/masks.ts:791:30
     ...(rasterMask?.staleReason !== undefined ? { staleReason: rasterMask.staleReason } : {}),
     ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
   };
-  const mask: Mask = { type: 'alpha', visible: true, rasterMask: maskData };
+  const mask: Mask = { type: "", visible: true, rasterMask: maskData };
   const candidate = {
     ...doc,
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ObjectLiteral
packages/scene/src/masks.ts:792:21
     ...(rasterMask?.provenance !== undefined ? { provenance: rasterMask.provenance } : {}),
   };
   const mask: Mask = { type: 'alpha', visible: true, rasterMask: maskData };
-  const candidate = {
-    ...doc,
-    rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
-  };
+  const candidate = {};
   if (
     validateMaskSource(candidate, mask) ||
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ObjectLiteral
packages/scene/src/masks.ts:794:23
   const mask: Mask = { type: 'alpha', visible: true, rasterMask: maskData };
   const candidate = {
     ...doc,
-    rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
+    rasterMaskAssets: {},
   };
   if (
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:797:5
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
   };
   if (
-    validateMaskSource(candidate, mask) ||
-    validateSourcePixelDimensions(candidate, node, maskData, asset)
+    true
   ) {
     return doc;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected { …(7) } not to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:797:5
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
   };
   if (
-    validateMaskSource(candidate, mask) ||
-    validateSourcePixelDimensions(candidate, node, maskData, asset)
+    false
   ) {
     return doc;
killedBy: native raster masks rejects source-pixel assets that differ from known oriented source dimensions
statusReason: expected { …(8) } to be { …(7) } // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:799:5
   if (
     validateMaskSource(candidate, mask) ||
     validateSourcePixelDimensions(candidate, node, maskData, asset)
-  ) {
-    return doc;
-  }
+  ) {}
 
   const updated: Document = {
killedBy: native raster masks rejects source-pixel assets that differ from known oriented source dimensions
statusReason: expected { …(8) } to be { …(7) } // Object.is equality

[Killed] ObjectLiteral
packages/scene/src/masks.ts:805:38
 
   const updated: Document = {
     ...doc,
-    nodes: { ...doc.nodes, [nodeId]: { ...node, mask } },
+    nodes: { ...doc.nodes, [nodeId]: {} },
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
   };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected undefined to deeply equal { type: 'alpha', visible: true, …(1) }

[Killed] ObjectLiteral
packages/scene/src/masks.ts:805:12
 
   const updated: Document = {
     ...doc,
-    nodes: { ...doc.nodes, [nodeId]: { ...node, mask } },
+    nodes: {},
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
   };
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected undefined to deeply equal { type: 'alpha', visible: true, …(1) }

[Killed] ObjectLiteral
packages/scene/src/masks.ts:806:23
   const updated: Document = {
     ...doc,
     nodes: { ...doc.nodes, [nodeId]: { ...node, mask } },
-    rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
+    rasterMaskAssets: {},
   };
   const priorAssetId = node.mask?.rasterMask?.assetId;
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: expected undefined to be 1 // Object.is equality

[Killed] OptionalChaining
packages/scene/src/masks.ts:808:24
     nodes: { ...doc.nodes, [nodeId]: { ...node, mask } },
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
   };
-  const priorAssetId = node.mask?.rasterMask?.assetId;
+  const priorAssetId = node.mask.rasterMask?.assetId;
   return priorAssetId && priorAssetId !== asset.id
     ? withoutUnreferencedAsset(updated, priorAssetId)
killedBy: native raster masks attaches a source-pixel raster alpha mask to an image shape
statusReason: Cannot read properties of undefined (reading 'rasterMask')

[Survived] OptionalChaining
packages/scene/src/masks.ts:808:24
     nodes: { ...doc.nodes, [nodeId]: { ...node, mask } },
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
   };
-  const priorAssetId = node.mask?.rasterMask?.assetId;
+  const priorAssetId = node.mask?.rasterMask.assetId;
   return priorAssetId && priorAssetId !== asset.id
     ? withoutUnreferencedAsset(updated, priorAssetId)

[Killed] EqualityOperator
packages/scene/src/masks.ts:809:26
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
   };
   const priorAssetId = node.mask?.rasterMask?.assetId;
-  return priorAssetId && priorAssetId !== asset.id
+  return priorAssetId && priorAssetId === asset.id
     ? withoutUnreferencedAsset(updated, priorAssetId)
     : updated;
killedBy: native raster masks garbage-collects an unshared prior asset when add replaces a raster mask
statusReason: expected { id: 'old-mask', …(5) } to be undefined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:809:10
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
   };
   const priorAssetId = node.mask?.rasterMask?.assetId;
-  return priorAssetId && priorAssetId !== asset.id
+  return false
     ? withoutUnreferencedAsset(updated, priorAssetId)
     : updated;
killedBy: native raster masks garbage-collects an unshared prior asset when add replaces a raster mask
statusReason: expected { id: 'old-mask', …(5) } to be undefined

[Survived] OptionalChaining
packages/scene/src/masks.ts:821:23
   asset: RasterMaskAsset,
 ): Document {
   const node = doc.nodes[nodeId];
-  const currentMask = node?.mask;
+  const currentMask = node.mask;
   const current = currentMask?.rasterMask;
   if (!node || !currentMask || !current || !isImageShape(doc, node)) return doc;

[Survived] OptionalChaining
packages/scene/src/masks.ts:822:19
 ): Document {
   const node = doc.nodes[nodeId];
   const currentMask = node?.mask;
-  const current = currentMask?.rasterMask;
+  const current = currentMask.rasterMask;
   if (!node || !currentMask || !current || !isImageShape(doc, node)) return doc;
   if (validateRasterMaskAsset(asset)) return doc;

[Killed] BooleanLiteral
packages/scene/src/masks.ts:823:32
   const node = doc.nodes[nodeId];
   const currentMask = node?.mask;
   const current = currentMask?.rasterMask;
-  if (!node || !currentMask || !current || !isImageShape(doc, node)) return doc;
+  if (!node || !currentMask || current || !isImageShape(doc, node)) return doc;
   if (validateRasterMaskAsset(asset)) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected 'shared-mask' to be 'edited-mask' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:823:7
   const node = doc.nodes[nodeId];
   const currentMask = node?.mask;
   const current = currentMask?.rasterMask;
-  if (!node || !currentMask || !current || !isImageShape(doc, node)) return doc;
+  if (true) return doc;
   if (validateRasterMaskAsset(asset)) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected 'shared-mask' to be 'edited-mask' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:824:7
   const currentMask = node?.mask;
   const current = currentMask?.rasterMask;
   if (!node || !currentMask || !current || !isImageShape(doc, node)) return doc;
-  if (validateRasterMaskAsset(asset)) return doc;
+  if (true) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected 'shared-mask' to be 'edited-mask' // Object.is equality

[Survived] ConditionalExpression
packages/scene/src/masks.ts:824:7
   const currentMask = node?.mask;
   const current = currentMask?.rasterMask;
   if (!node || !currentMask || !current || !isImageShape(doc, node)) return doc;
-  if (validateRasterMaskAsset(asset)) return doc;
+  if (false) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;

[Killed] ConditionalExpression
packages/scene/src/masks.ts:827:7
   if (validateRasterMaskAsset(asset)) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
-  if (current.assetId === asset.id && existing && rasterAssetsEqual(existing, asset)) return doc;
+  if (false) return doc;
   if (validateSourcePixelDimensions(doc, node, current, asset)) return doc;
   const currentEditRevision = current.editRevision ?? 0;
killedBy: native raster masks preserves identity and revision for an exact raster asset update no-op
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:827:7
   if (validateRasterMaskAsset(asset)) return doc;
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
-  if (current.assetId === asset.id && existing && rasterAssetsEqual(existing, asset)) return doc;
+  if (current.assetId === asset.id && existing || rasterAssetsEqual(existing, asset)) return doc;
   if (validateSourcePixelDimensions(doc, node, current, asset)) return doc;
   const currentEditRevision = current.editRevision ?? 0;
killedBy: native raster masks rejects source-pixel assets that differ from known oriented source dimensions
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:828:7
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
   if (current.assetId === asset.id && existing && rasterAssetsEqual(existing, asset)) return doc;
-  if (validateSourcePixelDimensions(doc, node, current, asset)) return doc;
+  if (true) return doc;
   const currentEditRevision = current.editRevision ?? 0;
   if (
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected 'shared-mask' to be 'edited-mask' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:828:7
   const existing = getOwnRasterMaskAsset(doc, asset.id);
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
   if (current.assetId === asset.id && existing && rasterAssetsEqual(existing, asset)) return doc;
-  if (validateSourcePixelDimensions(doc, node, current, asset)) return doc;
+  if (false) return doc;
   const currentEditRevision = current.editRevision ?? 0;
   if (
killedBy: native raster masks rejects source-pixel assets that differ from known oriented source dimensions
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:829:31
   if (existing && !rasterAssetsEqual(existing, asset)) return doc;
   if (current.assetId === asset.id && existing && rasterAssetsEqual(existing, asset)) return doc;
   if (validateSourcePixelDimensions(doc, node, current, asset)) return doc;
-  const currentEditRevision = current.editRevision ?? 0;
+  const currentEditRevision = current.editRevision && 0;
   if (
     !isSafeNonnegativeInteger(currentEditRevision) ||
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected 'shared-mask' to be 'edited-mask' // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:831:5
   if (validateSourcePixelDimensions(doc, node, current, asset)) return doc;
   const currentEditRevision = current.editRevision ?? 0;
   if (
-    !isSafeNonnegativeInteger(currentEditRevision) ||
-    currentEditRevision === Number.MAX_SAFE_INTEGER
+    !isSafeNonnegativeInteger(currentEditRevision) && currentEditRevision === Number.MAX_SAFE_INTEGER
   ) {
     return doc;
killedBy: native raster masks rejects edits after the safe edit revision is exhausted
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:831:5
   if (validateSourcePixelDimensions(doc, node, current, asset)) return doc;
   const currentEditRevision = current.editRevision ?? 0;
   if (
-    !isSafeNonnegativeInteger(currentEditRevision) ||
-    currentEditRevision === Number.MAX_SAFE_INTEGER
+    true
   ) {
     return doc;
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected 'shared-mask' to be 'edited-mask' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:832:5
   const currentEditRevision = current.editRevision ?? 0;
   if (
     !isSafeNonnegativeInteger(currentEditRevision) ||
-    currentEditRevision === Number.MAX_SAFE_INTEGER
+    false
   ) {
     return doc;
killedBy: native raster masks rejects edits after the safe edit revision is exhausted
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:832:5
   const currentEditRevision = current.editRevision ?? 0;
   if (
     !isSafeNonnegativeInteger(currentEditRevision) ||
-    currentEditRevision === Number.MAX_SAFE_INTEGER
+    currentEditRevision !== Number.MAX_SAFE_INTEGER
   ) {
     return doc;
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected 'shared-mask' to be 'edited-mask' // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:833:5
   if (
     !isSafeNonnegativeInteger(currentEditRevision) ||
     currentEditRevision === Number.MAX_SAFE_INTEGER
-  ) {
-    return doc;
-  }
+  ) {}
   const updated: Document = {
     ...doc,
killedBy: native raster masks rejects edits after the safe edit revision is exhausted
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] ObjectLiteral
packages/scene/src/masks.ts:840:17
     ...doc,
     nodes: {
       ...doc.nodes,
-      [nodeId]: {
-        ...node,
-        mask: {
-          ...currentMask,
-          rasterMask: {
-            ...current,
-            assetId: asset.id,
-            editRevision: currentEditRevision + 1,
-          },
-        },
-      },
+      [nodeId]: {},
     },
     rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be 'edited-mask' // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:847:27
           rasterMask: {
             ...current,
             assetId: asset.id,
-            editRevision: currentEditRevision + 1,
+            editRevision: currentEditRevision - 1,
           },
         },
killedBy: native raster masks preserves mask presentation and source metadata when replacing an asset
statusReason: expected { type: 'alpha', visible: false, …(8) } to match object { Object (visible, inverted, ...) }
(2 matching properties omitted from actual)

[Killed] ObjectLiteral
packages/scene/src/masks.ts:852:23
         },
       },
     },
-    rasterMaskAssets: { ...doc.rasterMaskAssets, [asset.id]: asset },
+    rasterMaskAssets: {},
   };
   return withoutUnreferencedAsset(updated, current.assetId);
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected undefined to be defined

[Killed] BlockStatement
packages/scene/src/masks.ts:858:80
 }
 
 /** Remove one node's raster mask and garbage-collect its unshared asset. */
-export function removeRasterMaskAsset(doc: Document, nodeId: NodeId): Document {
-  const node = doc.nodes[nodeId];
-  const assetId = node?.mask?.rasterMask?.assetId;
-  if (!node || !assetId) return doc;
-  const { mask: _removed, ...rest } = node;
-  const updated: Document = {
-    ...doc,
-    nodes: { ...doc.nodes, [nodeId]: rest as SceneNode },
-  };
-  return withoutUnreferencedAsset(updated, assetId);
-}
+export function removeRasterMaskAsset(doc: Document, nodeId: NodeId): Document {}
 
 /**
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: Cannot read properties of undefined (reading 'nodes')

[Survived] OptionalChaining
packages/scene/src/masks.ts:860:19
 /** Remove one node's raster mask and garbage-collect its unshared asset. */
 export function removeRasterMaskAsset(doc: Document, nodeId: NodeId): Document {
   const node = doc.nodes[nodeId];
-  const assetId = node?.mask?.rasterMask?.assetId;
+  const assetId = node?.mask?.rasterMask.assetId;
   if (!node || !assetId) return doc;
   const { mask: _removed, ...rest } = node;

[Survived] OptionalChaining
packages/scene/src/masks.ts:860:19
 /** Remove one node's raster mask and garbage-collect its unshared asset. */
 export function removeRasterMaskAsset(doc: Document, nodeId: NodeId): Document {
   const node = doc.nodes[nodeId];
-  const assetId = node?.mask?.rasterMask?.assetId;
+  const assetId = node.mask?.rasterMask?.assetId;
   if (!node || !assetId) return doc;
   const { mask: _removed, ...rest } = node;

[Killed] BooleanLiteral
packages/scene/src/masks.ts:861:7
 export function removeRasterMaskAsset(doc: Document, nodeId: NodeId): Document {
   const node = doc.nodes[nodeId];
   const assetId = node?.mask?.rasterMask?.assetId;
-  if (!node || !assetId) return doc;
+  if (node || !assetId) return doc;
   const { mask: _removed, ...rest } = node;
   const updated: Document = {
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected { type: 'alpha', visible: true, …(1) } to be undefined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:861:16
 export function removeRasterMaskAsset(doc: Document, nodeId: NodeId): Document {
   const node = doc.nodes[nodeId];
   const assetId = node?.mask?.rasterMask?.assetId;
-  if (!node || !assetId) return doc;
+  if (!node || assetId) return doc;
   const { mask: _removed, ...rest } = node;
   const updated: Document = {
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: expected { type: 'alpha', visible: true, …(1) } to be undefined

[Killed] ObjectLiteral
packages/scene/src/masks.ts:863:29
   const assetId = node?.mask?.rasterMask?.assetId;
   if (!node || !assetId) return doc;
   const { mask: _removed, ...rest } = node;
-  const updated: Document = {
-    ...doc,
-    nodes: { ...doc.nodes, [nodeId]: rest as SceneNode },
-  };
+  const updated: Document = {};
   return withoutUnreferencedAsset(updated, assetId);
 }
killedBy: native raster masks updates shared assets copy-on-write and removes only unreferenced payloads
statusReason: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
packages/scene/src/masks.ts:880:30
  *         Empty array when no cycles exist.
  */
 export function detectMaskCycles(doc: Document): NodeId[][] {
-  const cycles: NodeId[][] = [];
+  const cycles: NodeId[][] = ["Stryker was here"];
   const visited = new Set<NodeId>();
   const inStack = new Set<NodeId>();
killedBy: clipping-mask transform preservation creates a clipping group from root-level sibling nodes
statusReason: expected undefined to be 'mask' // Object.is equality
