[Killed] ConditionalExpression
packages/scene/src/masks.ts:886:9
   const path: NodeId[] = [];
 
   function visit(nid: NodeId): void {
-    if (inStack.has(nid)) {
+    if (false) {
       // Found a cycle — extract the path from the start of the cycle
       const cycleStart = path.indexOf(nid);
killedBy: cycle detection detects self-referencing mask
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
packages/scene/src/masks.ts:886:9
   const path: NodeId[] = [];
 
   function visit(nid: NodeId): void {
-    if (inStack.has(nid)) {
+    if (true) {
       // Found a cycle — extract the path from the start of the cycle
       const cycleStart = path.indexOf(nid);
killedBy: cycle detection detects self-referencing mask
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
packages/scene/src/masks.ts:889:11
     if (inStack.has(nid)) {
       // Found a cycle — extract the path from the start of the cycle
       const cycleStart = path.indexOf(nid);
-      if (cycleStart >= 0) {
+      if (cycleStart < 0) {
         cycles.push([...path.slice(cycleStart), nid]);
       }
killedBy: cycle detection detects self-referencing mask
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
packages/scene/src/masks.ts:889:28
     if (inStack.has(nid)) {
       // Found a cycle — extract the path from the start of the cycle
       const cycleStart = path.indexOf(nid);
-      if (cycleStart >= 0) {
-        cycles.push([...path.slice(cycleStart), nid]);
-      }
+      if (cycleStart >= 0) {}
       return;
     }
killedBy: cycle detection detects self-referencing mask
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
packages/scene/src/masks.ts:890:25
       // Found a cycle — extract the path from the start of the cycle
       const cycleStart = path.indexOf(nid);
       if (cycleStart >= 0) {
-        cycles.push([...path.slice(cycleStart), nid]);
+        cycles.push([...path, nid]);
       }
       return;

[Killed] ConditionalExpression
packages/scene/src/masks.ts:894:9
       }
       return;
     }
-    if (visited.has(nid)) return;
+    if (true) return;
 
     visited.add(nid);
killedBy: cycle detection detects self-referencing mask
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
packages/scene/src/masks.ts:894:9
       }
       return;
     }
-    if (visited.has(nid)) return;
+    if (false) return;
 
     visited.add(nid);

[Killed] LogicalOperator
packages/scene/src/masks.ts:902:9
 
     const node = doc.nodes[nid];
     const n = node as SceneNode & { mask?: Mask; children?: NodeId[] };
-    if (n.mask?.sourceNodeId && n.mask.visible !== false) {
+    if (n.mask?.sourceNodeId || n.mask.visible !== false) {
       const srcId = n.mask.sourceNodeId;
       const srcNode = doc.nodes[srcId];
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: Cannot read properties of undefined (reading 'visible')

[Killed] OptionalChaining
packages/scene/src/masks.ts:902:9
 
     const node = doc.nodes[nid];
     const n = node as SceneNode & { mask?: Mask; children?: NodeId[] };
-    if (n.mask?.sourceNodeId && n.mask.visible !== false) {
+    if (n.mask.sourceNodeId && n.mask.visible !== false) {
       const srcId = n.mask.sourceNodeId;
       const srcNode = doc.nodes[srcId];
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: Cannot read properties of undefined (reading 'sourceNodeId')

[Survived] LogicalOperator
packages/scene/src/masks.ts:906:11
       const srcId = n.mask.sourceNodeId;
       const srcNode = doc.nodes[srcId];
       // Follow mask source if the source is itself a container (nested masks)
-      if (srcNode && isContainerNode(srcNode)) {
+      if (srcNode || isContainerNode(srcNode)) {
         visit(srcId);
       }

[Survived] ConditionalExpression
packages/scene/src/masks.ts:906:11
       const srcId = n.mask.sourceNodeId;
       const srcNode = doc.nodes[srcId];
       // Follow mask source if the source is itself a container (nested masks)
-      if (srcNode && isContainerNode(srcNode)) {
+      if (true) {
         visit(srcId);
       }

[Killed] ConditionalExpression
packages/scene/src/masks.ts:911:9
       }
     }
     // Also check children recursively for their own masks
-    if (n.children) {
+    if (true) {
       for (const childId of n.children) {
         visit(childId);
killedBy: clipping-mask transform preservation creates a clipping group from root-level sibling nodes
statusReason: n.children is not iterable

[Survived] ConditionalExpression
packages/scene/src/masks.ts:911:9
       }
     }
     // Also check children recursively for their own masks
-    if (n.children) {
+    if (false) {
       for (const childId of n.children) {
         visit(childId);

[Survived] BlockStatement
packages/scene/src/masks.ts:912:41
     }
     // Also check children recursively for their own masks
     if (n.children) {
-      for (const childId of n.children) {
-        visit(childId);
-      }
+      for (const childId of n.children) {}
     }
 

[Killed] BlockStatement
packages/scene/src/masks.ts:921:45
     inStack.delete(nid);
   }
 
-  for (const nid of Object.keys(doc.nodes)) {
-    if (!visited.has(nid as NodeId)) {
-      visit(nid as NodeId);
-    }
-  }
+  for (const nid of Object.keys(doc.nodes)) {}
 
   return cycles;
killedBy: cycle detection detects self-referencing mask
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
packages/scene/src/masks.ts:922:9
   }
 
   for (const nid of Object.keys(doc.nodes)) {
-    if (!visited.has(nid as NodeId)) {
+    if (visited.has(nid as NodeId)) {
       visit(nid as NodeId);
     }
killedBy: cycle detection detects self-referencing mask
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
packages/scene/src/masks.ts:922:38
   }
 
   for (const nid of Object.keys(doc.nodes)) {
-    if (!visited.has(nid as NodeId)) {
-      visit(nid as NodeId);
-    }
+    if (!visited.has(nid as NodeId)) {}
   }
 
killedBy: cycle detection detects self-referencing mask
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
packages/scene/src/masks.ts:959:7
   },
 ): Document {
   const container = doc.nodes[containerId];
-  if (!container) return doc;
+  if (true) return doc;
   if (!isContainerNode(container)) return doc;
   if (!VALID_MASK_TYPES.includes(type)) return doc;
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:959:7
   },
 ): Document {
   const container = doc.nodes[containerId];
-  if (!container) return doc;
+  if (container) return doc;
   if (!isContainerNode(container)) return doc;
   if (!VALID_MASK_TYPES.includes(type)) return doc;
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:960:7
 ): Document {
   const container = doc.nodes[containerId];
   if (!container) return doc;
-  if (!isContainerNode(container)) return doc;
+  if (isContainerNode(container)) return doc;
   if (!VALID_MASK_TYPES.includes(type)) return doc;
 
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:960:7
 ): Document {
   const container = doc.nodes[containerId];
   if (!container) return doc;
-  if (!isContainerNode(container)) return doc;
+  if (false) return doc;
   if (!VALID_MASK_TYPES.includes(type)) return doc;
 
killedBy: cycle detection addMask rejects masks that would create a cycle
statusReason: expected { …(10) } to be { …(10) } // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:961:7
   const container = doc.nodes[containerId];
   if (!container) return doc;
   if (!isContainerNode(container)) return doc;
-  if (!VALID_MASK_TYPES.includes(type)) return doc;
+  if (VALID_MASK_TYPES.includes(type)) return doc;
 
   // Structural masks need a node source, vector geometry, or both. When both
killedBy: clipping-mask transform preservation creates a clipping group from root-level sibling nodes
statusReason: expected undefined to be 'mask' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:961:7
   const container = doc.nodes[containerId];
   if (!container) return doc;
   if (!isContainerNode(container)) return doc;
-  if (!VALID_MASK_TYPES.includes(type)) return doc;
+  if (false) return doc;
 
   // Structural masks need a node source, vector geometry, or both. When both
killedBy: addMask rejects invalid mask type
statusReason: expected { Object (type, visible, ...) } to be undefined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:965:46
 
   // Structural masks need a node source, vector geometry, or both. When both
   // are present, vector geometry is meaningful and the node is visual content.
-  if (!sourceNodeId && (!opts?.vectorMask || opts.vectorMask.points.length === 0)) return doc;
+  if (!sourceNodeId && (!opts?.vectorMask || false)) return doc;
 
   // Source must exist if specified
killedBy: vector masks rejects an empty vector mask because it has no meaningful geometry
statusReason: expected { type: 'clip', visible: true, …(1) } to be undefined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:965:25
 
   // Structural masks need a node source, vector geometry, or both. When both
   // are present, vector geometry is meaningful and the node is visual content.
-  if (!sourceNodeId && (!opts?.vectorMask || opts.vectorMask.points.length === 0)) return doc;
+  if (!sourceNodeId && (opts?.vectorMask || opts.vectorMask.points.length === 0)) return doc;
 
   // Source must exist if specified
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: expected undefined to be defined

[Killed] LogicalOperator
packages/scene/src/masks.ts:968:7
   if (!sourceNodeId && (!opts?.vectorMask || opts.vectorMask.points.length === 0)) return doc;
 
   // Source must exist if specified
-  if (sourceNodeId && !doc.nodes[sourceNodeId]) return doc;
+  if (sourceNodeId || !doc.nodes[sourceNodeId]) return doc;
 
   // Source must be a child of the container (frames and groups only)
killedBy: clipping-mask transform preservation creates a clipping group from root-level sibling nodes
statusReason: expected undefined to be 'mask' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:968:7
   if (!sourceNodeId && (!opts?.vectorMask || opts.vectorMask.points.length === 0)) return doc;
 
   // Source must exist if specified
-  if (sourceNodeId && !doc.nodes[sourceNodeId]) return doc;
+  if (false) return doc;
 
   // Source must be a child of the container (frames and groups only)
killedBy: addMask rejects when source does not exist
statusReason: Cannot read properties of undefined (reading 'mask')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:971:7
   if (sourceNodeId && !doc.nodes[sourceNodeId]) return doc;
 
   // Source must be a child of the container (frames and groups only)
-  if (sourceNodeId && container.kind !== 'adjustment') {
+  if (false) {
     const children = container.children;
     if (children && !children.includes(sourceNodeId)) return doc;
killedBy: addMask rejects when source is not a child
statusReason: expected { type: 'clip', visible: true, …(1) } to be undefined

[Killed] EqualityOperator
packages/scene/src/masks.ts:971:23
   if (sourceNodeId && !doc.nodes[sourceNodeId]) return doc;
 
   // Source must be a child of the container (frames and groups only)
-  if (sourceNodeId && container.kind !== 'adjustment') {
+  if (sourceNodeId && container.kind === 'adjustment') {
     const children = container.children;
     if (children && !children.includes(sourceNodeId)) return doc;
killedBy: addMask rejects when source is not a child
statusReason: expected { type: 'clip', visible: true, …(1) } to be undefined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:973:9
   // Source must be a child of the container (frames and groups only)
   if (sourceNodeId && container.kind !== 'adjustment') {
     const children = container.children;
-    if (children && !children.includes(sourceNodeId)) return doc;
+    if (true) return doc;
   }
 
killedBy: addMask adds a clip mask to a frame
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:973:21
   // Source must be a child of the container (frames and groups only)
   if (sourceNodeId && container.kind !== 'adjustment') {
     const children = container.children;
-    if (children && !children.includes(sourceNodeId)) return doc;
+    if (children && children.includes(sourceNodeId)) return doc;
   }
 
killedBy: addMask adds a clip mask to a frame
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
packages/scene/src/masks.ts:976:24
     if (children && !children.includes(sourceNodeId)) return doc;
   }
 
-  const presentation = {
-    type,
-    visible: opts?.visible ?? true,
-    ...(opts?.inverted ? { inverted: true } : {}),
-    ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
-    ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
-    ...(opts?.linked === false ? { linked: false } : {}),
-    ...(opts?.transform ? { transform: opts.transform } : {}),
-    ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
-    ...(opts?.fillRule ? { fillRule: opts.fillRule } : {}),
-  };
+  const presentation = {};
   const vectorMask = opts?.vectorMask?.points.length ? opts.vectorMask : undefined;
   const cleaned: Mask = vectorMask
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: expected undefined to be 'clip' // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:978:14
 
   const presentation = {
     type,
-    visible: opts?.visible ?? true,
+    visible: opts?.visible && true,
     ...(opts?.inverted ? { inverted: true } : {}),
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
killedBy: addMask adds a clip mask to a frame
statusReason: expected undefined to be true // Object.is equality

[Killed] OptionalChaining
packages/scene/src/masks.ts:978:14
 
   const presentation = {
     type,
-    visible: opts?.visible ?? true,
+    visible: opts.visible ?? true,
     ...(opts?.inverted ? { inverted: true } : {}),
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot read properties of undefined (reading 'visible')

[Killed] OptionalChaining
packages/scene/src/masks.ts:979:9
   const presentation = {
     type,
     visible: opts?.visible ?? true,
-    ...(opts?.inverted ? { inverted: true } : {}),
+    ...(opts.inverted ? { inverted: true } : {}),
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
killedBy: Page operations duplicatePage remaps clipping mask references within the copied subtree
statusReason: Cannot read properties of undefined (reading 'inverted')

[Killed] BooleanLiteral
packages/scene/src/masks.ts:979:38
   const presentation = {
     type,
     visible: opts?.visible ?? true,
-    ...(opts?.inverted ? { inverted: true } : {}),
+    ...(opts?.inverted ? { inverted: false } : {}),
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
killedBy: addMask accepts optional parameters (inverted, feather, density)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:980:9
     type,
     visible: opts?.visible ?? true,
     ...(opts?.inverted ? { inverted: true } : {}),
-    ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
+    ...(true ? { feather: opts.feather } : {}),
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
     ...(opts?.linked === false ? { linked: false } : {}),
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot read properties of undefined (reading 'feather')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:980:9
     type,
     visible: opts?.visible ?? true,
     ...(opts?.inverted ? { inverted: true } : {}),
-    ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
+    ...(true && opts.feather > 0 ? { feather: opts.feather } : {}),
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
     ...(opts?.linked === false ? { linked: false } : {}),
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot read properties of undefined (reading 'feather')

[Killed] EqualityOperator
packages/scene/src/masks.ts:981:40
     visible: opts?.visible ?? true,
     ...(opts?.inverted ? { inverted: true } : {}),
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
-    ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
+    ...(opts?.density !== undefined && opts.density >= 1 ? { density: opts.density } : {}),
     ...(opts?.linked === false ? { linked: false } : {}),
     ...(opts?.transform ? { transform: opts.transform } : {}),
killedBy: addMask accepts optional parameters (inverted, feather, density)
statusReason: expected undefined to be 0.8 // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:981:9
     visible: opts?.visible ?? true,
     ...(opts?.inverted ? { inverted: true } : {}),
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
-    ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
+    ...(false ? { density: opts.density } : {}),
     ...(opts?.linked === false ? { linked: false } : {}),
     ...(opts?.transform ? { transform: opts.transform } : {}),
killedBy: addMask accepts optional parameters (inverted, feather, density)
statusReason: expected undefined to be 0.8 // Object.is equality

[Killed] OptionalChaining
packages/scene/src/masks.ts:982:9
     ...(opts?.inverted ? { inverted: true } : {}),
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
-    ...(opts?.linked === false ? { linked: false } : {}),
+    ...(opts.linked === false ? { linked: false } : {}),
     ...(opts?.transform ? { transform: opts.transform } : {}),
     ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot read properties of undefined (reading 'linked')

[NoCoverage] BooleanLiteral
packages/scene/src/masks.ts:982:44
     ...(opts?.inverted ? { inverted: true } : {}),
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
-    ...(opts?.linked === false ? { linked: false } : {}),
+    ...(opts?.linked === false ? { linked: true } : {}),
     ...(opts?.transform ? { transform: opts.transform } : {}),
     ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),

[Killed] OptionalChaining
packages/scene/src/masks.ts:983:9
     ...(opts?.feather !== undefined && opts.feather > 0 ? { feather: opts.feather } : {}),
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
     ...(opts?.linked === false ? { linked: false } : {}),
-    ...(opts?.transform ? { transform: opts.transform } : {}),
+    ...(opts.transform ? { transform: opts.transform } : {}),
     ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
     ...(opts?.fillRule ? { fillRule: opts.fillRule } : {}),
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot read properties of undefined (reading 'transform')

[Killed] BooleanLiteral
packages/scene/src/masks.ts:984:50
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
     ...(opts?.linked === false ? { linked: false } : {}),
     ...(opts?.transform ? { transform: opts.transform } : {}),
-    ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
+    ...(opts?.hideMaskSource ? { hideMaskSource: false } : {}),
     ...(opts?.fillRule ? { fillRule: opts.fillRule } : {}),
   };
killedBy: hideMaskSource sets hideMaskSource to true via addMask opts
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
packages/scene/src/masks.ts:984:9
     ...(opts?.density !== undefined && opts.density < 1 ? { density: opts.density } : {}),
     ...(opts?.linked === false ? { linked: false } : {}),
     ...(opts?.transform ? { transform: opts.transform } : {}),
-    ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
+    ...(opts.hideMaskSource ? { hideMaskSource: true } : {}),
     ...(opts?.fillRule ? { fillRule: opts.fillRule } : {}),
   };
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot read properties of undefined (reading 'hideMaskSource')

[Killed] OptionalChaining
packages/scene/src/masks.ts:985:9
     ...(opts?.linked === false ? { linked: false } : {}),
     ...(opts?.transform ? { transform: opts.transform } : {}),
     ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
-    ...(opts?.fillRule ? { fillRule: opts.fillRule } : {}),
+    ...(opts.fillRule ? { fillRule: opts.fillRule } : {}),
   };
   const vectorMask = opts?.vectorMask?.points.length ? opts.vectorMask : undefined;
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot read properties of undefined (reading 'fillRule')

[NoCoverage] ObjectLiteral
packages/scene/src/masks.ts:985:26
     ...(opts?.linked === false ? { linked: false } : {}),
     ...(opts?.transform ? { transform: opts.transform } : {}),
     ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
-    ...(opts?.fillRule ? { fillRule: opts.fillRule } : {}),
+    ...(opts?.fillRule ? {} : {}),
   };
   const vectorMask = opts?.vectorMask?.points.length ? opts.vectorMask : undefined;

[Killed] OptionalChaining
packages/scene/src/masks.ts:987:22
     ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
     ...(opts?.fillRule ? { fillRule: opts.fillRule } : {}),
   };
-  const vectorMask = opts?.vectorMask?.points.length ? opts.vectorMask : undefined;
+  const vectorMask = opts?.vectorMask.points.length ? opts.vectorMask : undefined;
   const cleaned: Mask = vectorMask
     ? sourceNodeId
killedBy: addMask accepts optional parameters (inverted, feather, density)
statusReason: Cannot read properties of undefined (reading 'points')

[Killed] OptionalChaining
packages/scene/src/masks.ts:987:22
     ...(opts?.hideMaskSource ? { hideMaskSource: true } : {}),
     ...(opts?.fillRule ? { fillRule: opts.fillRule } : {}),
   };
-  const vectorMask = opts?.vectorMask?.points.length ? opts.vectorMask : undefined;
+  const vectorMask = opts.vectorMask?.points.length ? opts.vectorMask : undefined;
   const cleaned: Mask = vectorMask
     ? sourceNodeId
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot read properties of undefined (reading 'vectorMask')

[Killed] ObjectLiteral
packages/scene/src/masks.ts:995:19
     : { ...presentation, sourceNodeId: sourceNodeId! };
 
   // Check for cycles before adding the mask
-  const testDoc = {
-    ...doc,
-    nodes: {
-      ...doc.nodes,
-      [containerId]: { ...container, mask: cleaned } as SceneNode,
-    },
-  };
+  const testDoc = {};
   const cycles = detectMaskCycles(testDoc);
   if (cycles.length > 0) {
killedBy: addMask adds a clip mask to a frame
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
packages/scene/src/masks.ts:1003:7
     },
   };
   const cycles = detectMaskCycles(testDoc);
-  if (cycles.length > 0) {
+  if (cycles.length >= 0) {
     return doc; // Reject masks that would create cycles
   }
killedBy: addMask adds a clip mask to a frame
statusReason: expected undefined to be defined

[Killed] EqualityOperator
packages/scene/src/masks.ts:1003:7
     },
   };
   const cycles = detectMaskCycles(testDoc);
-  if (cycles.length > 0) {
+  if (cycles.length <= 0) {
     return doc; // Reject masks that would create cycles
   }
killedBy: vector masks adds mask with vector path data (no sourceNodeId)
statusReason: expected undefined to be defined

[Killed] BlockStatement
packages/scene/src/masks.ts:1021:74
  *
  * @returns A new document with the mask removed, or the same document if no mask existed.
  */
-export function removeMask(doc: Document, containerId: NodeId): Document {
-  const container = doc.nodes[containerId];
-  if (!container) return doc;
-  if (!container.mask) return doc;
-
-  if (container.mask.rasterMask) return removeRasterMaskAsset(doc, containerId);
-  if (!isContainerNode(container)) return doc;
-
-  const { mask: _unused, ...rest } = container;
-  const nodes = {
-    ...doc.nodes,
-    [containerId]: rest as SceneNode,
-  };
-
-  return { ...doc, nodes };
-}
+export function removeMask(doc: Document, containerId: NodeId): Document {}
 
 /**
killedBy: removeMask removes an existing mask
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1024:7
 export function removeMask(doc: Document, containerId: NodeId): Document {
   const container = doc.nodes[containerId];
   if (!container) return doc;
-  if (!container.mask) return doc;
+  if (true) return doc;
 
   if (container.mask.rasterMask) return removeRasterMaskAsset(doc, containerId);
killedBy: removeMask removes an existing mask
statusReason: expected { type: 'clip', …(2) } to be undefined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1024:7
 export function removeMask(doc: Document, containerId: NodeId): Document {
   const container = doc.nodes[containerId];
   if (!container) return doc;
-  if (!container.mask) return doc;
+  if (false) return doc;
 
   if (container.mask.rasterMask) return removeRasterMaskAsset(doc, containerId);
killedBy: removeMask is idempotent (no mask to remove)
statusReason: Cannot read properties of undefined (reading 'rasterMask')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1026:7
   if (!container) return doc;
   if (!container.mask) return doc;
 
-  if (container.mask.rasterMask) return removeRasterMaskAsset(doc, containerId);
+  if (true) return removeRasterMaskAsset(doc, containerId);
   if (!isContainerNode(container)) return doc;
 
killedBy: removeMask removes an existing mask
statusReason: expected { type: 'clip', …(2) } to be undefined

[Survived] ConditionalExpression
packages/scene/src/masks.ts:1026:7
   if (!container) return doc;
   if (!container.mask) return doc;
 
-  if (container.mask.rasterMask) return removeRasterMaskAsset(doc, containerId);
+  if (false) return removeRasterMaskAsset(doc, containerId);
   if (!isContainerNode(container)) return doc;
 

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1027:7
   if (!container.mask) return doc;
 
   if (container.mask.rasterMask) return removeRasterMaskAsset(doc, containerId);
-  if (!isContainerNode(container)) return doc;
+  if (isContainerNode(container)) return doc;
 
   const { mask: _unused, ...rest } = container;
killedBy: removeMask removes an existing mask
statusReason: expected { type: 'clip', …(2) } to be undefined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1027:7
   if (!container.mask) return doc;
 
   if (container.mask.rasterMask) return removeRasterMaskAsset(doc, containerId);
-  if (!isContainerNode(container)) return doc;
+  if (true) return doc;
 
   const { mask: _unused, ...rest } = container;
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected { type: 'clip', visible: true, …(1) } to be undefined

[Killed] ObjectLiteral
packages/scene/src/masks.ts:1035:10
     [containerId]: rest as SceneNode,
   };
 
-  return { ...doc, nodes };
+  return {};
 }
 
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: Cannot read properties of undefined (reading 'vector')

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1051:7
 ): Document {
   const container = doc.nodes[containerId];
   if (!container) return doc;
-  if (!container.mask) return doc;
+  if (container.mask) return doc;
   const isLeafRasterProperty =
     isImageShape(doc, container) &&
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: true, …(1) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)
