[Killed] LogicalOperator
packages/scene/src/masks.ts:1053:5
   if (!container) return doc;
   if (!container.mask) return doc;
   const isLeafRasterProperty =
-    isImageShape(doc, container) &&
-    Boolean(container.mask.rasterMask) &&
-    (key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density');
+    isImageShape(doc, container) && Boolean(container.mask.rasterMask) || key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density';
   if (!isContainerNode(container) && !isLeafRasterProperty) return doc;
 
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1053:5
   if (!container) return doc;
   if (!container.mask) return doc;
   const isLeafRasterProperty =
-    isImageShape(doc, container) &&
-    Boolean(container.mask.rasterMask) &&
-    (key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density');
+    false;
   if (!isContainerNode(container) && !isLeafRasterProperty) return doc;
 
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: true, …(1) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] EqualityOperator
packages/scene/src/masks.ts:1055:27
   const isLeafRasterProperty =
     isImageShape(doc, container) &&
     Boolean(container.mask.rasterMask) &&
-    (key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density');
+    (key === 'visible' || key !== 'inverted' || key === 'feather' || key === 'density');
   if (!isContainerNode(container) && !isLeafRasterProperty) return doc;
 
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1055:6
   const isLeafRasterProperty =
     isImageShape(doc, container) &&
     Boolean(container.mask.rasterMask) &&
-    (key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density');
+    (true);
   if (!isContainerNode(container) && !isLeafRasterProperty) return doc;
 
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:1056:7
     isImageShape(doc, container) &&
     Boolean(container.mask.rasterMask) &&
     (key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density');
-  if (!isContainerNode(container) && !isLeafRasterProperty) return doc;
+  if (!isContainerNode(container) || !isLeafRasterProperty) return doc;
 
   const include = shouldInclude ? shouldInclude(value) : value !== undefined;
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: true, …(1) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1056:7
     isImageShape(doc, container) &&
     Boolean(container.mask.rasterMask) &&
     (key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density');
-  if (!isContainerNode(container) && !isLeafRasterProperty) return doc;
+  if (isContainerNode(container) && !isLeafRasterProperty) return doc;
 
   const include = shouldInclude ? shouldInclude(value) : value !== undefined;
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:1058:58
     (key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density');
   if (!isContainerNode(container) && !isLeafRasterProperty) return doc;
 
-  const include = shouldInclude ? shouldInclude(value) : value !== undefined;
+  const include = shouldInclude ? shouldInclude(value) : value === undefined;
   const currentValue = (container.mask as unknown as Record<string, unknown>)[key];
   if ((include && Object.is(currentValue, value)) || (!include && !(key in container.mask))) {
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', …(4) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1058:58
     (key === 'visible' || key === 'inverted' || key === 'feather' || key === 'density');
   if (!isContainerNode(container) && !isLeafRasterProperty) return doc;
 
-  const include = shouldInclude ? shouldInclude(value) : value !== undefined;
+  const include = shouldInclude ? shouldInclude(value) : false;
   const currentValue = (container.mask as unknown as Record<string, unknown>)[key];
   if ((include && Object.is(currentValue, value)) || (!include && !(key in container.mask))) {
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', …(4) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] LogicalOperator
packages/scene/src/masks.ts:1060:8
 
   const include = shouldInclude ? shouldInclude(value) : value !== undefined;
   const currentValue = (container.mask as unknown as Record<string, unknown>)[key];
-  if ((include && Object.is(currentValue, value)) || (!include && !(key in container.mask))) {
+  if ((include || Object.is(currentValue, value)) || (!include && !(key in container.mask))) {
     return doc;
   }
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: true, …(1) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] BlockStatement
packages/scene/src/masks.ts:1060:94
 
   const include = shouldInclude ? shouldInclude(value) : value !== undefined;
   const currentValue = (container.mask as unknown as Record<string, unknown>)[key];
-  if ((include && Object.is(currentValue, value)) || (!include && !(key in container.mask))) {
-    return doc;
-  }
+  if ((include && Object.is(currentValue, value)) || (!include && !(key in container.mask))) {}
   const cleaned: Mask = include
     ? ({ ...container.mask, [key]: value } as Mask)
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { …(8) }
Received: serializes to the same string

[Killed] BlockStatement
packages/scene/src/masks.ts:1065:14
   }
   const cleaned: Mask = include
     ? ({ ...container.mask, [key]: value } as Mask)
-    : (() => {
-        const { [key]: _removed, ...rest } = container.mask as unknown as Record<string, unknown>;
-        return rest as unknown as Mask;
-      })();
+    : (() => {})();
 
   const nodes = {
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected undefined to match object { sourceNodeId: 'n1' }

[Killed] BlockStatement
packages/scene/src/masks.ts:1079:96
 }
 
 /** Toggle mask visibility. */
-export function setMaskVisible(doc: Document, containerId: NodeId, visible: boolean): Document {
-  return updateMaskProperty(doc, containerId, 'visible', visible);
-}
+export function setMaskVisible(doc: Document, containerId: NodeId, visible: boolean): Document {}
 
 /** Toggle mask inversion. */
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] StringLiteral
packages/scene/src/masks.ts:1080:47
 
 /** Toggle mask visibility. */
 export function setMaskVisible(doc: Document, containerId: NodeId, visible: boolean): Document {
-  return updateMaskProperty(doc, containerId, 'visible', visible);
+  return updateMaskProperty(doc, containerId, "", visible);
 }
 
killedBy: setMaskVisible toggles visible
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:1084:98
 }
 
 /** Toggle mask inversion. */
-export function setMaskInverted(doc: Document, containerId: NodeId, inverted: boolean): Document {
-  return updateMaskProperty(doc, containerId, 'inverted', inverted || undefined, (v) => !!v);
-}
+export function setMaskInverted(doc: Document, containerId: NodeId, inverted: boolean): Document {}
 
 /** Set mask feather radius in world-space pixels (0 to remove feather). */
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1085:90
 
 /** Toggle mask inversion. */
 export function setMaskInverted(doc: Document, containerId: NodeId, inverted: boolean): Document {
-  return updateMaskProperty(doc, containerId, 'inverted', inverted || undefined, (v) => !!v);
+  return updateMaskProperty(doc, containerId, 'inverted', inverted || undefined, (v) => !v);
 }
 
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1085:59
 
 /** Toggle mask inversion. */
 export function setMaskInverted(doc: Document, containerId: NodeId, inverted: boolean): Document {
-  return updateMaskProperty(doc, containerId, 'inverted', inverted || undefined, (v) => !!v);
+  return updateMaskProperty(doc, containerId, 'inverted', true, (v) => !!v);
 }
 
killedBy: setMaskInverted removes inverted when set to false
statusReason: expected true to be undefined

[Killed] BlockStatement
packages/scene/src/masks.ts:1089:95
 }
 
 /** Set mask feather radius in world-space pixels (0 to remove feather). */
-export function setMaskFeather(doc: Document, containerId: NodeId, feather: number): Document {
-  const clamped = Math.max(0, feather);
-  return updateMaskProperty(doc, containerId, 'feather', clamped > 0 ? clamped : undefined, (v) => {
-    return (v as number) > 0;
-  });
-}
+export function setMaskFeather(doc: Document, containerId: NodeId, feather: number): Document {}
 
 /** Set mask density (0-1). 1 = full effect, 0 = no effect. */
killedBy: setMaskFeather sets feather radius
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] MethodExpression
packages/scene/src/masks.ts:1090:19
 
 /** Set mask feather radius in world-space pixels (0 to remove feather). */
 export function setMaskFeather(doc: Document, containerId: NodeId, feather: number): Document {
-  const clamped = Math.max(0, feather);
+  const clamped = Math.min(0, feather);
   return updateMaskProperty(doc, containerId, 'feather', clamped > 0 ? clamped : undefined, (v) => {
     return (v as number) > 0;
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1091:58
 /** Set mask feather radius in world-space pixels (0 to remove feather). */
 export function setMaskFeather(doc: Document, containerId: NodeId, feather: number): Document {
   const clamped = Math.max(0, feather);
-  return updateMaskProperty(doc, containerId, 'feather', clamped > 0 ? clamped : undefined, (v) => {
+  return updateMaskProperty(doc, containerId, 'feather', false ? clamped : undefined, (v) => {
     return (v as number) > 0;
   });
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] EqualityOperator
packages/scene/src/masks.ts:1091:58
 /** Set mask feather radius in world-space pixels (0 to remove feather). */
 export function setMaskFeather(doc: Document, containerId: NodeId, feather: number): Document {
   const clamped = Math.max(0, feather);
-  return updateMaskProperty(doc, containerId, 'feather', clamped > 0 ? clamped : undefined, (v) => {
+  return updateMaskProperty(doc, containerId, 'feather', clamped <= 0 ? clamped : undefined, (v) => {
     return (v as number) > 0;
   });
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] EqualityOperator
packages/scene/src/masks.ts:1092:12
 export function setMaskFeather(doc: Document, containerId: NodeId, feather: number): Document {
   const clamped = Math.max(0, feather);
   return updateMaskProperty(doc, containerId, 'feather', clamped > 0 ? clamped : undefined, (v) => {
-    return (v as number) > 0;
+    return v as number <= 0;
   });
 }
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1092:12
 export function setMaskFeather(doc: Document, containerId: NodeId, feather: number): Document {
   const clamped = Math.max(0, feather);
   return updateMaskProperty(doc, containerId, 'feather', clamped > 0 ? clamped : undefined, (v) => {
-    return (v as number) > 0;
+    return false;
   });
 }
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] BlockStatement
packages/scene/src/masks.ts:1097:95
 }
 
 /** Set mask density (0-1). 1 = full effect, 0 = no effect. */
-export function setMaskDensity(doc: Document, containerId: NodeId, density: number): Document {
-  const clamped = Math.max(0, Math.min(1, density));
-  return updateMaskProperty(doc, containerId, 'density', clamped < 1 ? clamped : undefined, (v) => {
-    return (v as number) < 1;
-  });
-}
+export function setMaskDensity(doc: Document, containerId: NodeId, density: number): Document {}
 
 /** Toggle whether the mask is linked to its container transform. */
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] MethodExpression
packages/scene/src/masks.ts:1098:19
 
 /** Set mask density (0-1). 1 = full effect, 0 = no effect. */
 export function setMaskDensity(doc: Document, containerId: NodeId, density: number): Document {
-  const clamped = Math.max(0, Math.min(1, density));
+  const clamped = Math.min(0, Math.min(1, density));
   return updateMaskProperty(doc, containerId, 'density', clamped < 1 ? clamped : undefined, (v) => {
     return (v as number) < 1;
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(4) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] MethodExpression
packages/scene/src/masks.ts:1098:31
 
 /** Set mask density (0-1). 1 = full effect, 0 = no effect. */
 export function setMaskDensity(doc: Document, containerId: NodeId, density: number): Document {
-  const clamped = Math.max(0, Math.min(1, density));
+  const clamped = Math.max(0, Math.max(1, density));
   return updateMaskProperty(doc, containerId, 'density', clamped < 1 ? clamped : undefined, (v) => {
     return (v as number) < 1;
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1099:58
 /** Set mask density (0-1). 1 = full effect, 0 = no effect. */
 export function setMaskDensity(doc: Document, containerId: NodeId, density: number): Document {
   const clamped = Math.max(0, Math.min(1, density));
-  return updateMaskProperty(doc, containerId, 'density', clamped < 1 ? clamped : undefined, (v) => {
+  return updateMaskProperty(doc, containerId, 'density', false ? clamped : undefined, (v) => {
     return (v as number) < 1;
   });
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] BlockStatement
packages/scene/src/masks.ts:1099:100
 /** Set mask density (0-1). 1 = full effect, 0 = no effect. */
 export function setMaskDensity(doc: Document, containerId: NodeId, density: number): Document {
   const clamped = Math.max(0, Math.min(1, density));
-  return updateMaskProperty(doc, containerId, 'density', clamped < 1 ? clamped : undefined, (v) => {
-    return (v as number) < 1;
-  });
+  return updateMaskProperty(doc, containerId, 'density', clamped < 1 ? clamped : undefined, (v) => {});
 }
 
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] EqualityOperator
packages/scene/src/masks.ts:1100:12
 export function setMaskDensity(doc: Document, containerId: NodeId, density: number): Document {
   const clamped = Math.max(0, Math.min(1, density));
   return updateMaskProperty(doc, containerId, 'density', clamped < 1 ? clamped : undefined, (v) => {
-    return (v as number) < 1;
+    return v as number >= 1;
   });
 }
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1100:12
 export function setMaskDensity(doc: Document, containerId: NodeId, density: number): Document {
   const clamped = Math.max(0, Math.min(1, density));
   return updateMaskProperty(doc, containerId, 'density', clamped < 1 ? clamped : undefined, (v) => {
-    return (v as number) < 1;
+    return false;
   });
 }
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected { type: 'alpha', visible: false, …(3) } to match object { Object (visible, inverted, ...) }
(1 matching property omitted from actual)

[Killed] BlockStatement
packages/scene/src/masks.ts:1105:94
 }
 
 /** Toggle whether the mask is linked to its container transform. */
-export function setMaskLinked(doc: Document, containerId: NodeId, linked: boolean): Document {
-  return updateMaskProperty(
-    doc,
-    containerId,
-    'linked',
-    linked ? undefined : false,
-    (v) => v === false,
-  );
-}
+export function setMaskLinked(doc: Document, containerId: NodeId, linked: boolean): Document {}
 
 /** Set the independent mask transform (only meaningful when linked === false). */
killedBy: setMaskLinked unlinks mask from container
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1110:26
     doc,
     containerId,
     'linked',
-    linked ? undefined : false,
+    linked ? undefined : true,
     (v) => v === false,
   );
killedBy: setMaskLinked unlinks mask from container
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1111:18
     containerId,
     'linked',
     linked ? undefined : false,
-    (v) => v === false,
+    (v) => v === true,
   );
 }
killedBy: setMaskLinked unlinks mask from container
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1111:12
     containerId,
     'linked',
     linked ? undefined : false,
-    (v) => v === false,
+    (v) => false,
   );
 }
killedBy: setMaskLinked unlinks mask from container
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:1120:13
   doc: Document,
   containerId: NodeId,
   transform: Affine | undefined,
-): Document {
-  return updateMaskProperty(doc, containerId, 'transform', transform, (v) => v !== undefined);
-}
+): Document {}
 
 /** Change the mask type ('clip', 'alpha', or 'luminance'). */
killedBy: setMaskTransform sets independent mask transform
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1121:78
   containerId: NodeId,
   transform: Affine | undefined,
 ): Document {
-  return updateMaskProperty(doc, containerId, 'transform', transform, (v) => v !== undefined);
+  return updateMaskProperty(doc, containerId, 'transform', transform, (v) => false);
 }
 
killedBy: setMaskTransform sets independent mask transform
statusReason: expected undefined to deeply equal [ 2, +0, +0, 2, 100, 100 ]

[Killed] EqualityOperator
packages/scene/src/masks.ts:1121:78
   containerId: NodeId,
   transform: Affine | undefined,
 ): Document {
-  return updateMaskProperty(doc, containerId, 'transform', transform, (v) => v !== undefined);
+  return updateMaskProperty(doc, containerId, 'transform', transform, (v) => v === undefined);
 }
 
killedBy: setMaskTransform sets independent mask transform
statusReason: expected undefined to deeply equal [ 2, +0, +0, 2, 100, 100 ]

[Killed] BlockStatement
packages/scene/src/masks.ts:1125:91
 }
 
 /** Change the mask type ('clip', 'alpha', or 'luminance'). */
-export function setMaskType(doc: Document, containerId: NodeId, type: MaskType): Document {
-  if (!VALID_MASK_TYPES.includes(type)) return doc;
-  return updateMaskProperty(doc, containerId, 'type', type);
-}
+export function setMaskType(doc: Document, containerId: NodeId, type: MaskType): Document {}
 
 /** Toggle whether the mask source node is hidden from direct rendering. */
killedBy: setMaskType changes mask type
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1126:7
 
 /** Change the mask type ('clip', 'alpha', or 'luminance'). */
 export function setMaskType(doc: Document, containerId: NodeId, type: MaskType): Document {
-  if (!VALID_MASK_TYPES.includes(type)) return doc;
+  if (true) return doc;
   return updateMaskProperty(doc, containerId, 'type', type);
 }
killedBy: setMaskType changes mask type
statusReason: expected 'clip' to be 'alpha' // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1126:7
 
 /** Change the mask type ('clip', 'alpha', or 'luminance'). */
 export function setMaskType(doc: Document, containerId: NodeId, type: MaskType): Document {
-  if (!VALID_MASK_TYPES.includes(type)) return doc;
+  if (VALID_MASK_TYPES.includes(type)) return doc;
   return updateMaskProperty(doc, containerId, 'type', type);
 }
killedBy: setMaskType changes mask type
statusReason: expected 'clip' to be 'alpha' // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:1135:13
   doc: Document,
   containerId: NodeId,
   hideSource: boolean,
-): Document {
-  return updateMaskProperty(
-    doc,
-    containerId,
-    'hideMaskSource',
-    hideSource || undefined,
-    (v) => !!v,
-  );
-}
+): Document {}
 
 /** Set the vector mask path data for a container's mask. */
killedBy: hideMaskSource toggles hideMaskSource on and off
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] StringLiteral
packages/scene/src/masks.ts:1139:5
   return updateMaskProperty(
     doc,
     containerId,
-    'hideMaskSource',
+    "",
     hideSource || undefined,
     (v) => !!v,
killedBy: hideMaskSource toggles hideMaskSource on and off
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:1140:5
     doc,
     containerId,
     'hideMaskSource',
-    hideSource || undefined,
+    hideSource && undefined,
     (v) => !!v,
   );
killedBy: hideMaskSource toggles hideMaskSource on and off
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1140:5
     doc,
     containerId,
     'hideMaskSource',
-    hideSource || undefined,
+    true,
     (v) => !!v,
   );
killedBy: hideMaskSource toggles hideMaskSource on and off
statusReason: expected true to be undefined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1141:13
     containerId,
     'hideMaskSource',
     hideSource || undefined,
-    (v) => !!v,
+    (v) => !v,
   );
 }
killedBy: hideMaskSource toggles hideMaskSource on and off
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:1152:13
   points: PathPoint[],
   closed: boolean,
   fillRule?: MaskFillRule,
-): Document {
-  if (points.length === 0) {
-    const node = doc.nodes[containerId];
-    if (!node || !isContainerNode(node) || !node.mask?.vectorMask) return doc;
-    if (!node.mask.sourceNodeId) return removeMask(doc, containerId);
-  }
-  return updateMaskProperty(
-    doc,
-    containerId,
-    'vectorMask',
-    points.length > 0
-      ? ({ points, closed, fillRule: fillRule ?? 'nonzero' } as VectorMaskData)
-      : undefined,
-  );
-}
+): Document {}
 
 /** Set the fill rule for a clip/vector mask. */
killedBy: native raster masks edits native raster mask properties on eligible image leaves
statusReason: expected undefined to be { …(8) } // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1153:7
   closed: boolean,
   fillRule?: MaskFillRule,
 ): Document {
-  if (points.length === 0) {
+  if (true) {
     const node = doc.nodes[containerId];
     if (!node || !isContainerNode(node) || !node.mask?.vectorMask) return doc;
killedBy: vector masks setMaskVectorPath updates mask path data
statusReason: expected undefined to be defined

[Killed] BlockStatement
packages/scene/src/masks.ts:1153:28
   closed: boolean,
   fillRule?: MaskFillRule,
 ): Document {
-  if (points.length === 0) {
-    const node = doc.nodes[containerId];
-    if (!node || !isContainerNode(node) || !node.mask?.vectorMask) return doc;
-    if (!node.mask.sourceNodeId) return removeMask(doc, containerId);
-  }
+  if (points.length === 0) {}
   return updateMaskProperty(
     doc,
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected { type: 'clip', visible: true } to be undefined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1155:9
 ): Document {
   if (points.length === 0) {
     const node = doc.nodes[containerId];
-    if (!node || !isContainerNode(node) || !node.mask?.vectorMask) return doc;
+    if (node || !isContainerNode(node) || !node.mask?.vectorMask) return doc;
     if (!node.mask.sourceNodeId) return removeMask(doc, containerId);
   }
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected { type: 'clip', visible: true, …(1) } to be undefined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1155:18
 ): Document {
   if (points.length === 0) {
     const node = doc.nodes[containerId];
-    if (!node || !isContainerNode(node) || !node.mask?.vectorMask) return doc;
+    if (!node || isContainerNode(node) || !node.mask?.vectorMask) return doc;
     if (!node.mask.sourceNodeId) return removeMask(doc, containerId);
   }
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected { type: 'clip', visible: true, …(1) } to be undefined

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1156:9
   if (points.length === 0) {
     const node = doc.nodes[containerId];
     if (!node || !isContainerNode(node) || !node.mask?.vectorMask) return doc;
-    if (!node.mask.sourceNodeId) return removeMask(doc, containerId);
+    if (node.mask.sourceNodeId) return removeMask(doc, containerId);
   }
   return updateMaskProperty(
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected { type: 'clip', visible: true } to be undefined

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1156:9
   if (points.length === 0) {
     const node = doc.nodes[containerId];
     if (!node || !isContainerNode(node) || !node.mask?.vectorMask) return doc;
-    if (!node.mask.sourceNodeId) return removeMask(doc, containerId);
+    if (false) return removeMask(doc, containerId);
   }
   return updateMaskProperty(
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected { type: 'clip', visible: true } to be undefined
