[Killed] EqualityOperator
packages/scene/src/masks.ts:1162:5
     doc,
     containerId,
     'vectorMask',
-    points.length > 0
+    points.length <= 0
       ? ({ points, closed, fillRule: fillRule ?? 'nonzero' } as VectorMaskData)
       : undefined,
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected { points: [], closed: true, …(1) } to be undefined

[Killed] EqualityOperator
packages/scene/src/masks.ts:1162:5
     doc,
     containerId,
     'vectorMask',
-    points.length > 0
+    points.length >= 0
       ? ({ points, closed, fillRule: fillRule ?? 'nonzero' } as VectorMaskData)
       : undefined,
killedBy: vector masks removes an emptied vector-only mask and preserves a structural source mask
statusReason: expected { points: [], closed: true, …(1) } to be undefined

[Killed] BlockStatement
packages/scene/src/masks.ts:1173:13
   doc: Document,
   containerId: NodeId,
   fillRule: MaskFillRule,
-): Document {
-  return updateMaskProperty(doc, containerId, 'fillRule', fillRule);
-}
+): Document {}
 
 /**
killedBy: fill rule setMaskFillRule updates fill rule on clip mask
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1190:7
   reason: 'source-replaced' | 'source-changed',
 ): Document {
   const node = doc.nodes[nodeId];
-  if (!node?.mask?.rasterMask) return doc;
+  if (true) return doc;
   const currentRevision = node.mask.rasterMask.sourceIdentity.revision;
   return {
killedBy: native raster masks marks a raster mask stale when the source image is replaced
statusReason: expected undefined to be 'source-replaced' // Object.is equality

[Killed] OptionalChaining
packages/scene/src/masks.ts:1190:8
   reason: 'source-replaced' | 'source-changed',
 ): Document {
   const node = doc.nodes[nodeId];
-  if (!node?.mask?.rasterMask) return doc;
+  if (!node?.mask.rasterMask) return doc;
   const currentRevision = node.mask.rasterMask.sourceIdentity.revision;
   return {
killedBy: native raster masks returns the same document when marking stale on a maskless node
statusReason: Cannot read properties of undefined (reading 'rasterMask')

[Killed] ObjectLiteral
packages/scene/src/masks.ts:1192:10
   const node = doc.nodes[nodeId];
   if (!node?.mask?.rasterMask) return doc;
   const currentRevision = node.mask.rasterMask.sourceIdentity.revision;
-  return {
-    ...doc,
-    nodes: {
-      ...doc.nodes,
-      [nodeId]: {
-        ...node,
-        mask: {
-          ...node.mask,
-          visible: false,
-          rasterMask: {
-            ...node.mask.rasterMask,
-            staleReason: reason,
-            sourceIdentity: {
-              ...node.mask.rasterMask.sourceIdentity,
-              revision: Number.isSafeInteger(currentRevision + 1) ? currentRevision + 1 : 1,
-            },
-          },
-        },
-      },
-    },
-  };
+  return {};
 }
 
killedBy: native raster masks marks a raster mask stale when the source image is replaced
statusReason: Cannot read properties of undefined (reading 'image-1')

[Killed] ObjectLiteral
packages/scene/src/masks.ts:1196:17
     ...doc,
     nodes: {
       ...doc.nodes,
-      [nodeId]: {
-        ...node,
-        mask: {
-          ...node.mask,
-          visible: false,
-          rasterMask: {
-            ...node.mask.rasterMask,
-            staleReason: reason,
-            sourceIdentity: {
-              ...node.mask.rasterMask.sourceIdentity,
-              revision: Number.isSafeInteger(currentRevision + 1) ? currentRevision + 1 : 1,
-            },
-          },
-        },
-      },
+      [nodeId]: {},
     },
   };
killedBy: native raster masks marks a raster mask stale when the source image is replaced
statusReason: expected undefined to be 'source-replaced' // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1200:20
         ...node,
         mask: {
           ...node.mask,
-          visible: false,
+          visible: true,
           rasterMask: {
             ...node.mask.rasterMask,
killedBy: native raster masks marks a raster mask stale when the source image is replaced
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
packages/scene/src/masks.ts:1206:69
             staleReason: reason,
             sourceIdentity: {
               ...node.mask.rasterMask.sourceIdentity,
-              revision: Number.isSafeInteger(currentRevision + 1) ? currentRevision + 1 : 1,
+              revision: Number.isSafeInteger(currentRevision + 1) ? currentRevision - 1 : 1,
             },
           },
killedBy: native raster masks marks a raster mask stale when the source image is replaced
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ArithmeticOperator
packages/scene/src/masks.ts:1206:46
             staleReason: reason,
             sourceIdentity: {
               ...node.mask.rasterMask.sourceIdentity,
-              revision: Number.isSafeInteger(currentRevision + 1) ? currentRevision + 1 : 1,
+              revision: Number.isSafeInteger(currentRevision - 1) ? currentRevision + 1 : 1,
             },
           },

[Killed] BlockStatement
packages/scene/src/masks.ts:1221:13
   visible?: boolean;
   sourceNodeId?: NodeId;
   vectorMask?: VectorMaskData;
-}): boolean {
-  return !!mask.vectorMask && mask.vectorMask.points.length > 0;
-}
+}): boolean {}
 
 /** Check if a mask has a source node reference. */
killedBy: vector masks distinguishes vector geometry from an optional visual source node
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1222:10
   sourceNodeId?: NodeId;
   vectorMask?: VectorMaskData;
 }): boolean {
-  return !!mask.vectorMask && mask.vectorMask.points.length > 0;
+  return true;
 }
 
killedBy: vector masks hasVectorMask returns true only for masks with points
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1222:10
   sourceNodeId?: NodeId;
   vectorMask?: VectorMaskData;
 }): boolean {
-  return !!mask.vectorMask && mask.vectorMask.points.length > 0;
+  return false;
 }
 
killedBy: vector masks distinguishes vector geometry from an optional visual source node
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:1231:13
   visible?: boolean;
   sourceNodeId?: NodeId;
   vectorMask?: VectorMaskData;
-}): boolean {
-  return !!mask.sourceNodeId;
-}
+}): boolean {}
 
 /** Get all mask source node IDs in the document (for invalidation tracking). */
killedBy: vector masks distinguishes vector geometry from an optional visual source node
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1232:11
   sourceNodeId?: NodeId;
   vectorMask?: VectorMaskData;
 }): boolean {
-  return !!mask.sourceNodeId;
+  return !mask.sourceNodeId;
 }
 
killedBy: vector masks distinguishes vector geometry from an optional visual source node
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:1236:65
 }
 
 /** Get all mask source node IDs in the document (for invalidation tracking). */
-export function getAllMaskSourceIds(doc: Document): Set<NodeId> {
-  const sources = new Set<NodeId>();
-  for (const node of Object.values(doc.nodes)) {
-    const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId) {
-      sources.add(n.mask.sourceNodeId);
-    }
-  }
-  return sources;
-}
+export function getAllMaskSourceIds(doc: Document): Set<NodeId> {}
 
 /** Change the mask source node (must be a child of the container). */
killedBy: getAllMaskSourceIds returns empty set when no masks exist
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
packages/scene/src/masks.ts:1238:48
 /** Get all mask source node IDs in the document (for invalidation tracking). */
 export function getAllMaskSourceIds(doc: Document): Set<NodeId> {
   const sources = new Set<NodeId>();
-  for (const node of Object.values(doc.nodes)) {
-    const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId) {
-      sources.add(n.mask.sourceNodeId);
-    }
-  }
+  for (const node of Object.values(doc.nodes)) {}
   return sources;
 }
killedBy: getAllMaskSourceIds collects all mask source node IDs
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1240:9
   const sources = new Set<NodeId>();
   for (const node of Object.values(doc.nodes)) {
     const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId) {
+    if (true) {
       sources.add(n.mask.sourceNodeId);
     }
killedBy: getAllMaskSourceIds returns empty set when no masks exist
statusReason: Cannot read properties of undefined (reading 'sourceNodeId')

[Killed] BlockStatement
packages/scene/src/masks.ts:1240:31
   const sources = new Set<NodeId>();
   for (const node of Object.values(doc.nodes)) {
     const n = node as SceneNode & { mask?: Mask };
-    if (n.mask?.sourceNodeId) {
-      sources.add(n.mask.sourceNodeId);
-    }
+    if (n.mask?.sourceNodeId) {}
   }
   return sources;
killedBy: getAllMaskSourceIds collects all mask source node IDs
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:1252:13
   doc: Document,
   containerId: NodeId,
   sourceNodeId: NodeId,
-): Document {
-  const container = doc.nodes[containerId];
-  if (!container) return doc;
-  if (!isContainerNode(container)) return doc;
-  if (!container.mask) return doc;
-
-  if (!doc.nodes[sourceNodeId]) return doc;
-  // For frames and groups, source must be a child
-  if (container.kind !== 'adjustment') {
-    const children = container.children;
-    if (children && !children.includes(sourceNodeId)) return doc;
-  }
-
-  return updateMaskProperty(doc, containerId, 'sourceNodeId', sourceNodeId);
-}
+): Document {}
 
killedBy: setMaskSourceNode changes mask source node
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1255:7
 ): Document {
   const container = doc.nodes[containerId];
   if (!container) return doc;
-  if (!isContainerNode(container)) return doc;
+  if (true) return doc;
   if (!container.mask) return doc;
 
killedBy: setMaskSourceNode changes mask source node
statusReason: expected 'n1' to be 'n2' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1256:7
   const container = doc.nodes[containerId];
   if (!container) return doc;
   if (!isContainerNode(container)) return doc;
-  if (!container.mask) return doc;
+  if (true) return doc;
 
   if (!doc.nodes[sourceNodeId]) return doc;
killedBy: setMaskSourceNode changes mask source node
statusReason: expected 'n1' to be 'n2' // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1256:7
   const container = doc.nodes[containerId];
   if (!container) return doc;
   if (!isContainerNode(container)) return doc;
-  if (!container.mask) return doc;
+  if (container.mask) return doc;
 
   if (!doc.nodes[sourceNodeId]) return doc;
killedBy: setMaskSourceNode changes mask source node
statusReason: expected 'n1' to be 'n2' // Object.is equality

[Killed] BooleanLiteral
packages/scene/src/masks.ts:1258:7
   if (!isContainerNode(container)) return doc;
   if (!container.mask) return doc;
 
-  if (!doc.nodes[sourceNodeId]) return doc;
+  if (doc.nodes[sourceNodeId]) return doc;
   // For frames and groups, source must be a child
   if (container.kind !== 'adjustment') {
killedBy: setMaskSourceNode changes mask source node
statusReason: expected 'n1' to be 'n2' // Object.is equality

[Killed] ConditionalExpression
packages/scene/src/masks.ts:1258:7
   if (!isContainerNode(container)) return doc;
   if (!container.mask) return doc;
 
-  if (!doc.nodes[sourceNodeId]) return doc;
+  if (true) return doc;
   // For frames and groups, source must be a child
   if (container.kind !== 'adjustment') {
killedBy: setMaskSourceNode changes mask source node
statusReason: expected 'n1' to be 'n2' // Object.is equality

[Killed] EqualityOperator
packages/scene/src/masks.ts:1260:7
 
   if (!doc.nodes[sourceNodeId]) return doc;
   // For frames and groups, source must be a child
-  if (container.kind !== 'adjustment') {
+  if (container.kind === 'adjustment') {
     const children = container.children;
     if (children && !children.includes(sourceNodeId)) return doc;
killedBy: setMaskSourceNode rejects if new source is not a child
statusReason: expected 'n2' to be 'n1' // Object.is equality

[Killed] BlockStatement
packages/scene/src/masks.ts:1260:40
 
   if (!doc.nodes[sourceNodeId]) return doc;
   // For frames and groups, source must be a child
-  if (container.kind !== 'adjustment') {
-    const children = container.children;
-    if (children && !children.includes(sourceNodeId)) return doc;
-  }
+  if (container.kind !== 'adjustment') {}
 
   return updateMaskProperty(doc, containerId, 'sourceNodeId', sourceNodeId);
killedBy: setMaskSourceNode rejects if new source is not a child
statusReason: expected 'n2' to be 'n1' // Object.is equality

[Killed] LogicalOperator
packages/scene/src/masks.ts:1262:9
   // For frames and groups, source must be a child
   if (container.kind !== 'adjustment') {
     const children = container.children;
-    if (children && !children.includes(sourceNodeId)) return doc;
+    if (children || !children.includes(sourceNodeId)) return doc;
   }
 
killedBy: setMaskSourceNode changes mask source node
statusReason: expected 'n1' to be 'n2' // Object.is equality
